{
    "หมวดที่ 1": "รายละเอียดของหลักสตู ร\nหลักสูตรวิทยาศาสตรบัณฑิต\nสาขาวิชานวัตกรรมและการแปรรูปทางดิจิทัล\n(หลักสูตรพหุวิทยาการ/หลักสูตรปรับปรุง พ.ศ. 2566)\nชื่อสถาบันอุดมศึกษา มหาวิทยาลัยธรรมศาสตร์\nคณะ/วิทยาลัย/สถาบัน วิทยาลัยนวัตกรรม\nหมวดที่ 1 ข้อมูลทวั่ ไป\n1.1 รหัสและชื่อหลักสูตร\nรหัสหลักสูตร : 25610054001377\nชื่อหลักสูตร\nภาษาไทย : หลักสูตรวิทยาศาสตรบัณฑิต สาขาวิชานวัตกรรมและการแปรรูปทางดิจิทัล\n(หลักสูตรพหุวิทยาการ)\nภาษาอังกฤษ : Bachelor of Science Program in Digital Transformation and\nInnovation (Multidisciplinary)\n1.2 ชื่อปริญญาและสาขาวิชา\nภาษาไทย ชื่อเต็ม: วิทยาศาสตรบัณฑิต (นวัตกรรมและการแปรรูปทางดิจิทัล)\nชื่อย่อ: วท.บ. (นวัตกรรมและการแปรรูปทางดิจิทัล)\nภาษาอังกฤษ ชื่อเต็ม: Bachelor of Science\n(Digital Transformation and Innovation)\nชื่อย่อ: B.S. (Digital Transformation and Innovation)\n1.3 วิชาเอก (ถ้ามี) - ไม่มี -\n1.4 รูปแบบของหลักสูตร\n1.4.1 รูปแบบ\n\n<exclude> หลักสูตรระดับปริญญาตรี (ต่อเนื่อง)</exclude>\n\n<include> หลักสูตรระดับปริญญาตรี 4 ปี</include>\n\n<exclude> หลักสูตรระดับปริญญาตรี 5 ปี</exclude>\n\n<exclude> หลักสูตรระดับปริญญาตรี 6 ปี</exclude>\nมคอ. 2 หลักสูตรวิทยาศาสตรบัณฑิต สาขาวิชานวัตกรรมและการแปรรูปทำงดจิทัล หน้า 1 1.4.2 ประเภทของหลักสูตร\n\n<include> หลักสูตรปริญญาตรีทางวิชาการ</include>\n\n<exclude> หลักสูตรปริญญาตรีแบบก้าวหน้าทางวิชาการ</exclude>\n\n<exclude> หลักสูตรปริญญาตรีทางวิชาชีพหรือปฏิบัติการ</exclude>\n\n<exclude> หลักสูตรปริญญาตรีแบบก้าวหน้าทางวิชาชีพหรือปฏิบัติการ</exclude>\n1.4.3 ภาษาที่ใช้\n\n<include> จัดการศึกษาภาษาไทย</include>\n\n<exclude> จัดการศึกษาภาษาอังกฤษ</exclude>\n\n<exclude> จัดการศึกษาทั้งภาษาไทยและภาษาอังกฤษ</exclude>\n\n<exclude> จัดการศึกษาภาษาต่างประเทศ ระบุ..</exclude>\n1.4.4 ความร่วมมือกับสถาบันอื่น\n\n<include> หลักสูตรของสถาบันโดยเฉพาะ</include>\n\n<exclude> หลักสูตรที่ได้รับความร่วมมือสนับสนุนจากสถาบันอื่น หรือ หลักสูตรร่วมกับสถาบัน</exclude>\nอื่น ระบุ (โดยต้องระบุชื่อสถาบันการศึกษา/หน่วยงานที่ทำความร่วมมือ\nพร้อมทั้งแนบ MOU)\n1.4.5 การให้ปริญญาแก่ผู้สำเร็จการศึกษา\n\n<include> ให้ปริญญาเพียงสาขาวิชาเดียว</include>\n\n<exclude> ให้ปริญญามากกว่า 1 สาขาวิชา (เช่น ทวิปริญญา) หรือปริญญาร่วมระหว่าง</exclude>\nสถาบันอุดมศึกษา)\n1.4.6 สถานภาพของหลักสูตรและการพิจารณาอนุมัติ/เห็นชอบหลักสูตร\nหลักสูตรปรับปรุง พ.ศ. 2566 ปรับปรุงจากหลักสูตรวิทยาศาสตรบัณฑิต สาขาวิชานวัตกรรมและ\nการแปรรูปทางดิจิทัล (หลักสูตรพหุวิทยาการ) หลักสูตรใหม่พ.ศ. 2561\nกำหนดเปิดสอนในภาคการศึกษาที่ 1 ปีการศึกษา 2566\nได้พิจารณากลั่นกรองโดยคณะกรรมการนโยบายวิชาการ ในการประชุมครั้งที่ครั้งที่ 1/2566\nเมื่อวันที่ 1 มีนาคม พ.ศ. 2566\nได้รับอนุมัติ/เห็นชอบหลักสูตรจากสภามหาวิทยาลัย ในการประชุมครั้งที่ 5/2566\nเมื่อวันที่ 25 เดือน เมษายน พ.ศ. 2566\nมคอ. 2 หลักสูตรวิทยาศาสตรบัณฑิต สาขาวิชานวัตกรรมและการแปรรูปทำงดจิทัล หน้า 2 1.5 อาชีพที่สามารถประกอบได้หลังสำเร็จการศึกษา\n1.5.1 นักบริหารดิจิทัล\n1.5.2 นักวิเคราะห์ข้อมูล\n1.5.3 นักการตลาดดิจิทัล\n1.5.4 ผู้ปฏิบัติงานด้าน Cyber Security\n1.5.5 พนักงานองค์การด้านนวัตกรรม\n1.5.6 พนักงานองค์กรฝ่ายวิเคราะห์และวางแผนโครงการทางดิจิทัล\n1.6 สถานที่จัดการเรียนการสอน\n\n<exclude> ศูนย์รังสิต</exclude>\n\n<include> ท่าพระจันทร์</include>\n\n<exclude> ศูนย์พัทยา</exclude>\n\n<exclude> ศูนย์ลำปาง</exclude>\n1.7 ค่าใช้จ่ายตลอดหลักสูตร\nประเภทโครงการ\n\n<exclude> โครงการปกติ</exclude>\n\n<include> โครงการพิเศษ</include>\n\n<exclude> โครงการปกติและโครงการพิเศษ</exclude>\nค่าใช้จ่ายตลอดหลักสูตร\n\n<include> นักศึกษาไทย 447,615 บาท</include>\n\n<exclude> นักศึกษาต่างชาติ  บาท</exclude>\nค่าใช้จ่ายต่อหัวนักศึกษาตลอดระยะเวลาหลักสูตร 4 ปีคือ 447,615 บาทต่อคน โดยมีการ\nบริหารจัดการโครงการบริการการศึกษา (เพื่อรับปริญญา) (โครงการพิเศษ) นักศึกษามีค่าใช้จ่ายหลัก\nได้แก่ค่าหน่วยกิต ๆ ละ 1,800 บาท และค่าธรรมเนียมอื่น ๆ ของวิทยาลัยนวัตกรรม รายละเอียดดังนี้\nค่าธรรมเนียมพิเศษ ภาคการศึกษาปกติภาคฤดูร้อน\nสำหรับนักศึกษาไทย (เก็บทุกภาค) 20,000 บาท 3,000 บาท\nสำหรับนักศึกษาต่างชาติ (เก็บทุกภาค) 20,000 บาท 3,000 บาท\nทั้งนี้ค่าใช้จ่ายต่อหัวนักศึกษาตลอดระยะเวลาหลักสูตรนี้ยังไม่รวมค่าใช้จ่ายในการศึกษาดูงาน\nต่างประเทศ\nมคอ. 2 หลักสูตรวิทยาศาสตรบัณฑิต สาขาวิชานวัตกรรมและการแปรรูปทำงดจิทัล หน้า 3",
    "หมวดที่ 2": "หมวดที่ 2 คุณสมบัติผู้เข้าศึกษา\n2.1 การรับเข้าศึกษา\n\n<exclude> รับเฉพาะนักศึกษาไทย</exclude>\n\n<include> รับทั้งนักศึกษาไทยและนักศึกษาต่างชาติที่สามารถใช้ภาษาไทยได้ดี</include>\n\n<exclude> รับทั้งนักศึกษาไทยและนักศึกษาต่างชาติ</exclude>\n2.2 คุณสมบัติของผู้เข้าศึกษา\nคุณสมบัติของผู้เข้าศึกษาต้องไปตามข้อบังคับมหาวิทยาลัยธรรมศาสตร์ ว่าด้วยการศึกษา\nชั้นปริญญาตรีพ.ศ. 2561 ข้อ 14\nการคัดเลือกผู้เข้าศึกษา\nการคัดเลือกผู้เข้าศึกษาให้ไปตามระเบียบคัดเลือกเพื่อเข้าศึกษาในสถาบันการศึกษา\nขั้นอุดมศึกษาของส่วนราชการหรือหน่วยงานอื่นดำเนินการตามการมอบหมายของมหาวิทยาลัยหรือ\nตามข้อตกลง หรือ การคัดเลือกตามวิธีการที่มหาวิทยาลัยกำหนดโดยความเห็นชอบของสภามหาวิทยาลัย\nและออกประกาศมหาวิทยาลัย\nในกรณีที่นักศึกษาต่างชาติผู้ที่มีสัญชาติและมีถิ่นฐานอยู่ในประเทศที่ใช้ภาษาอังกฤษ\nภาษาราชการ จะได้รับการพิจารณายกเว้นไม่จำต้องส่งผลทดสอบภาษาอังกฤษ ซึ่งมีรายชื่อ\nประเทศดังนี้ออสเตรเลีย สหราชอาณาจักร นิวซีแลนด์ ไอร์แลนด์ แคนาดา และสหรัฐอเมริกา\n2.3 แผนการรับนักศึกษาและผู้สำเร็จการศึกษาในระยะ 5 ปี\nในแต่ละปีการศึกษาจะรับนักศึกษาปีละ 60 คน\nจำนวนนักศึกษาแต่ละปีการศึกษา\nจำนวนนักศึกษา\n2566 2567 2568 2569 2570\nชั้นปีที่ 1 60 60 60 60 60\nชั้นปีที่ 2 60 60 60 60\nชั้นปีที่ 3 60 60 60\nชั้นปีที่ 4 60 60\nรวม 60 120 180 240 240\nคาดว่าจะจบการศึกษา - - - 60 60\nมคอ. 2 หลักสูตรวิทยาศาสตรบัณฑิต สาขาวิชานวัตกรรมและการแปรรูปทำงดจิทัล หน้า 4",
    "หมวดที่ 3": "หมวดที่ 3 ปรัชญา วัตถุประสงค์ และผลลัพธก์ารเรียนรู้ของหลักสูตร\n3.1 ความสอดคล้องของหลักสูตรกับทิศทางนโยบายและยุทธศาสตร์การพัฒนากำลังคน และ\nยุทธศาสตร์มหาวิทยาลัย\nหลักสูตรนวัตกรรมและการแปรรูปทางดิจิทัล (Digital Transformation and Innovation)\nจะหลักสูตรที่ออกแบบเพื่อสอดคล้องกับยุทธศาสตร์ของมหาวิทยาลัยธรรมศาสตร์ในการพัฒนาทักษะ\nแห่งอนาคตโดยจัดการศึกษา Module ในแต่ละภาคการศึกษาครอบคลุมกลุ่มทักษะที่สำคัญต่อการ\nทำงานในอนาคต ได้แก่การแก้ปัญหาเชิงสร้างสรรค์ การวิเคราะห์ทางธุรกิจ นวัตกรรมและการคิดเชิง\nออกแบบ ความมั่นคงทางไซเบอร์ การแปรรูปทางดิจิทัล การตลาดดิจิทัล ต้น นอกจากนี้หลักสูตรยัง\nได้ออกแบบให้สอดคล้องกับกระบวนการเรียนรู้สู่การปฏิบัติได้จริงและการพัฒนากิจกรรมนักศึกษา โดย\nจัดรายวิชาโครงงาน (Capstone Project) ร่วมกับหน่วยงานภายนอกในการกำหนดโจทย์และปัญหาจาก\nสถานการณ์จริงให้กับนักศึกษาในการเรียนรู้และนำเสนอแนวทางในการแก้ไขปัญหาดังกล่าว\n3.2 ปรัชญา\nหลักสูตรนวัตกรรมและการแปรรูปทางดิจิทัล (Digital Transformation and Innovation) จะ\nหลักสูตรที่มีความยืดหยุ่น (Flexible) ผู้เรียนสามารถเลือกเรียน Module ที่ตนเองสนใจก่อน\nเพื่อสนับสนุนการสร้างสมรรถนะเร่งด่วนในด้านอุตสาหกรรมดิจิทัลโดยเฉพาะ และสามารถที่จะ\nปรับเปลี่ยนได้อย่างรวดเร็วตามการเปลี่ยนแปลงของเทคโนโลยีสามารถที่จะให้ทักษะที่แก้ปัญหาใน\nอุตสาหกรรมได้จริงโดยอาศัยความร่วมมือกับอุตสาหกรรม เพื่อพัฒนาตนและสร้างองค์ความรู้\nพหุวิทยาการด้านนวัตกรรมและการแปรรูปดิจิทัล ก้าวทันความเปลี่ยนแปลง ก้าวข้ามเส้นแบ่งความรู้\nก้าวสู่ความเลิศระดับสากล บนพื้นฐานคุณธรรม จริยธรรม และรับใช้สังคม\n3.3 วัตถุประสงค์ของหลักสูตร\nเพื่อให้บัณฑิตที่สำเร็จการศึกษาในหลักสูตรมีคุณลักษณะ ดังนี้\n3.3.1 เพื่อสร้างบัณฑิตพันธุ์ใหม่ที่ผู้ที่มีทักษะและความรู้ทั้งด้านเทคโนโลยีธุรกิจและนวัตกรรม\nและปัจจัยที่มีผลกระทบต่อสังคม และสร้างสรรค์สิ่งใหม่ให้ธุรกิจ สังคม และประเทศ\n3.3.2 เพื่อผลักดันให้เกิดการพัฒนาการแปรรูปดิจิทัล (Digital Transformation) ซึ่งสิ่งที่สำคัญ\nมากกับธุรกิจในประเทศ ในการเติบโตและพัฒนาของธุรกิจ\n3.3.3 เพื่อแหล่งเรียนรู้ตลอดชีวิต (Life-long learning) ในเรื่องวิทยาศาสตร์ข้อมูลสำหรับ\nผู้เรียนที่ไม่จำกัดในระดับมหาวิทยาลัยเท่านั้น\nมคอ. 2 หลักสูตรวิทยาศาสตรบัณฑิต สาขาวิชานวัตกรรมและการแปรรูปทำงดจิทัล หน้า 5 3.4 ผลลพัธ์การเรียนรู้ของหลักสูตร (PLOs)\nด้านความรู้ (Knowledge)\nK 1 มีความรู้ความเข้าใจเรื่องแนวคิด ทฤษฎี และหลักการด้านนวัตกรรมดิจิทัล\nK 2 มีความรู้ความเข้าใจเรื่องแนวคิดเชิงสร้างสรรค์ หรือการคิดในเชิงสร้างสรรค์\nK 3 มีความรู้ความเข้าใจเรื่องการทำวิจัย\nK 4 มีความรู้ความเข้าใจในการนำองค์กรดิจิทัล\nK 5 มีความรู้ความเข้าใจ และสามารถประยุกต์ใช้เทคโนโลยีดิจิทัลในการสร้างความได้เปรียบ\nด้านทักษะ (Skills)\nS 1 สามารถคิด วิเคราะห์ปัญหาภายใต้สถานการณ์ต่าง ๆ ได้อย่างสร้างสรรค์\nS 2 สามารถใช้ความรู้ในการแก้ไขปัญหาเฉพาะหน้าได้อย่างมีประสิทธิภาพ เหมาะสมกับ\nสถานการณ์\nS 3 สามารถพัฒนาและสร้างสรรค์องค์ความรู้ด้านนวัตกรรมและการแปรรูปดิจิทัล\nS 4 สามารถนำข้อมูลทางที่เกี่ยวข้องมาวิเคราะห์เพื่อประยุกต์ใช้ในการจัดการทางดิจิทัลได้\nอย่างมีประสิทธิภาพ\nS 5 สามารถวิเคราะห์ข้อมูลต่าง ๆ ด้านการเงินและการตลาดเพื่อประกอบการตัดสินใจในการ\nดำเนินงานด้านการจัดการทางดิจิทัล\nS 6 สามารถใช้ทักษะทางการสื่อสารได้อย่างชัดเจนและมีประสิทธิภาพ\nS 7 สามารถประยุกต์ใช้เทคโนโลยีสารสนเทศเพื่อเครื่องมือในการจัดการและการสื่อสาร\nข้อมูลต่าง ๆ ได้อย่างเหมาะสมและมีประสิทธิภาพ\nด้านจริยธรรม (Ethics)\nE 1 มีความรู้ความเข้าใจเรื่องผลกระทบของดิจิทัลต่อสังคม\nE 2 มีความรู้และตระหนักในความรับผิดชอบในการใช้เทคโนโลยีดิจิทัล\nด้านลักษณะบุคคล (Character)\nC 1 มีภาวะความผู้นำและผู้ตามในกลุ่ม ตลอดจนการทำงานร่วมกันทีม\nC 2 สามารถทำงานร่วมกับผู้อื่นและมีมนุษยสัมพันธ์ที่ดีกับผู้ร่วมงาน\nC 3 มีความรับผิดชอบในการกระทำของตนเองและรับผิดชอบงานกลุ่ม\nC 4 มีความกล้าในการแสดงความคิดเห็นและการยอมรับความคิดเห็นของผู้อื่น\nมคอ. 2 หลักสูตรวิทยาศาสตรบัณฑิต สาขาวิชานวัตกรรมและการแปรรูปทำงดจิทัล หน้า 6 3.5 ผลลัพธ์การเรียนรู้ที่คาดหวังเมื่อสิ้นปีการศึกษา (YLOs)\nความรู้ทักษะ ทัศนคติหรืออื่นอ ๆ ที่นักศึกษาจะได้รับเมื่อ\nชั้นปี\nเรียนจบแต่ละชั้นปี\nปีที่ 1 นักศึกษามีความเข้าใจพื้นฐานในเทคโนโลยีดิจิทัลและความรู้พื้นฐานที่สำคัญที่สามารถนำไป\nพัฒนาทักษะในการวิเคราะห์และแก้ไขปัญหา คือ แนวคิดเกี่ยวกับนวัตกรรม พื้นฐานทางสถิติ\nพื้นฐานการเขียนโปรแกรม และทักษะในการสื่อสาร รวมถึงความเข้าใจและตระหนักเรื่อง\nผลกระทบของดิจิทัลต่อสังคม และการใช้เทคโนโลยีดิจิทัล\nปีที่ 2 นักศึกษาสามารถอธิบายหลักการเขียนโปรแกรม การใช้คอมพิวเตอร์ในการสนับสนุนการ\nตัดสินใจ และการประยุกต์ใช้คอมพิวเตอร์ซอฟแวร์ในการนำไปใช้ในการแก้ไขปัญหาเชิง\nสร้างสรรค์ และมีความเข้าใจกระบวนการในการวิเคราะห์ข้อมูล คือ การสำรวจและการเตรียม\nข้อมูล การนำเสนอข้อมูล และการจัดการข้อมูล เพื่อจะประยุกต์ใช้ในการวิเคราะห์ข้อมูล\nสำหรับธุรกิจ รู้จักใช้ข้อมูลโดยคำนึงถึงผลกระทบของดิจิทัลต่อสังคม\nปีที่ 3 นักศึกษาสามารถอธิบายหลักการคิดเชิงออกแบบและการจัดการนวัตกรรมเพื่อนำไป\nประยุกต์ใช้ในการสร้างนวัตกรรมในการแก้ไขปัญหาและสามารถวิเคราะห์ผลตอบแทนและ\nความคุ้มค่าของนวัตกรรมดังกล่าวได้นอกจากนี้นักศึกษาสามารถอธิบายความสำคัญของ\nความปลอดภัยทางไซเบอร์รวมถึงความปลอดภัยของเน็ตเวิร์ก โครงสร้างพื้นฐานสำคัญ และ\nการบริหารความต่อเนื่องทางธุรกิจ มีความตระหนักในการรับผิดชอบการใช้เทคโนโลยีดิจิทัล\nรวมถึงมีความผู้นำและผู้ตาม สามารถทำงานทีม กล้าแสดงความคิดเห็นและรับฟัง\nความคิดเห็นของผู้ร่วมงาน\nปีที่ 4 นักศึกษาสามารถอธิบายหลักการสำคัญเกี่ยวกับการแปรรูปดิจิทัลและมีความเข้าใจใน\nเทคโนโลยีอุบัติใหม่ซึ่งจะนำไปสู่แบบจำลองธุรกิจดิจิทัลใหม่ ๆ รวมถึงกลยุทธ์ในการแปรรูป\nทางดิจิทัล พฤติกรรมองค์กรและภาวะผู้นำความเปลี่ยนแปลงที่ปัจจัยสำคัญในการนำ\nองค์กรให้ประสบความสำเร็จในการแปรรูปทางดิจิทัล กรณีศึกษาการแปรรูปในดิจิทัลที่เกิดขึ้น\nในอุตสาหกรรมต่าง ๆ เพื่อนำมาประยุกต์ใช้ในการวางแผนการแปรรูปทางดิจิทัลได้นอกจากนี้\nนักศึกษาจะเข้าใจการผู้นำและผู้ตามที่ดีรับฟังความคิดเห็นของผู้อื่น และรับผิดชอบงาน\nของตนเองและของกลุ่ม\nมคอ. 2 หลักสูตรวิทยาศาสตรบัณฑิต สาขาวิชานวัตกรรมและการแปรรูปทำงดจิทัล หน้า 7",
    "หมวดที่ 4": "หมวดที่ 4 โครงสร้างหลักสูตร รายวิชา และหน่วยกิต\n4.1 ระบบการจัดการศึกษาและระยะเวลาการศึกษา\n4.1.1 ระบบ\nหลักสูตรแบบเต็มเวลา ใช้ระบบการศึกษาแบบทวิภาค โดย 1 ปีการศึกษาแบ่งออก 2\nภาคการศึกษาปกติ 1 ภาคการศึกษาปกติมีระยะเวลาศึกษาไม่น้อยกว่า 15 สัปดาห์\n4.1.2 ระยะเวลาการศึกษาสูงสุด\n\n<exclude> ไม่กำหนด</exclude>\n\n<include> ไม่เกิน.16..ภาคการศึกษาปกติ</include>\n4.2 การดำเนินการหลักสูตร\n4.2.1 วัน-เวลาในการดำเนินการเรียนการสอน\n\n<include> วัน – เวลาราชการปกติ</include>\n\n<exclude> นอกวัน – เวลาราชการ</exclude>\n4.2.2 ระบบการศึกษา\n\n<include> แบบชั้นเรียน (Onsite)</include>\n\n<exclude> แบบทางไกล (Online)</exclude>\n\n<exclude> แบบประสมประสาน (Hybrid)</exclude>\n\n<include> อื่นๆ (ระบุ)</include>\nนอกเหนือจากระบบการศึกษาแบบชั้นเรียน หลักสูตรจะใช้เทคนิคการเรียนการสอน\nแบบผสมผสานเพื่อสร้างการเรียนรู้ที่มีประสิทธิภาพให้แก่นักศึกษา โดยเทคนิคที่จะใช้ในการสร้างการ\nเรียนรู้ประกอบด้วย การเรียนรู้เชิงรุก (Active learning) การเรียนรู้จากปัญหาที่เผชิญอยู่ในปัจจุบัน\n(Problem-based learning) การเรียนรู้ด้วยการทำโครงงาน (Project-based learning) การทำงาน\nกลุ่ม การทำงานวิจัยโครงการเดี่ยว การวิเคราะห์กรณีศึกษา การฝึกงานผ่านการปฏิบัติจริง รวมถึง\nการศึกษาดูงาน\n4.3 โครงสร้างหลักสูตร รายวิชา และหน่วยกิต\n4.3.1 หลักสูตร\n4.3.1.1 จำนวนหน่วยกิตรวม\nจำนวนหน่วยกิตรวมตลอดหลักสูตร 129 หน่วยกิต\nมคอ. 2 หลักสูตรวิทยาศาสตรบัณฑิต สาขาวิชานวัตกรรมและการแปรรูปทำงดจิทัล หน้า 8 4.3.1.2 โครงสร้างหลักสูตร\nนักศึกษาจะต้องจดทะเบียนศึกษารายวิชา รวมไม่น้อยกว่า 129 หน่วยกิต โดยศึกษารายวิชา\nต่าง ๆ ครบตามโครงสร้างองค์ประกอบ และข้อกำหนดของหลักสูตรดังนี้\n1) วิชาศึกษาทั่วไป 30 หน่วยกิต\n2) วิชาเฉพาะ 93 หน่วยกิต\n2.1) วิชาบังคับ 78 หน่วยกิต\n2.2) วิชาเลือก 15 หน่วยกิต\n3) วิชาเลือกเสรี 6 หน่วยกิต\nรวม 129 หน่วยกิต\n4.3.2 รายวิชาในหลักสูตร\n4.3.2.1 รหัสวิชา\nรายวิชาในหลักสูตรประกอบด้วย อักษรย่อ 2 หรือ 3 ตัว และเลขรหัส 3 ตัว โดยมี\nความหมายดังนี้\nอักษรย่อ ดท/DX หมายถึง อักษรย่อของสาขาวิชานวัตกรรมและการแปรรูปทาง\nดิจิทัล\nตัวเลข มีความหมาย ดังนี้\nเลขหลักหน่วย (ระบุรายละเอียดตามลักษณะของแต่ละหลักสูตร)\nเลข 0-4 หมายถึง วิชาบังคับ\nเลข 5-9 หมายถึง วิชาเลือก\nเลขหลักสิบ (ระบุรายละเอียดตามลักษณะของแต่ละหลักสูตร)\nเลข 0-1 หมายถึง วิชาด้านการแก้ปัญหาเชิงสร้างสรรค์\n(Creative Problem Solving)\nเลข 2 หมายถึง วิชาด้านการวิเคราะห์ทางธุรกิจ\n(Business Analytics)\nเลข 3 หมายถึง วิชาด้านธุรกิจ นวัตกรรมและการคิดเชิงออกแบบ\n(Business, Innovation, and Design Thinking)\nเลข 4 หมายถึง วิชาด้านความมั่นคงทางไซเบอร์ประยุกต์\n(Applied Cybersecurity)\nเลข 5 หมายถึง วิชาด้านการแปรรูปดิจิทัล\n(Digital Transformation)\nเลข 6 หมายถึง วิชาด้านการตลาดดิจิทัล (Digital Marketing)\nมคอ. 2 หลักสูตรวิทยาศาสตรบัณฑิต สาขาวิชานวัตกรรมและการแปรรูปทำงดจิทัล หน้า 9 เลข 7 หมายถึง วิชาด้านสื่อสร้างสรรค์ (Creative Media)\nเลข 8 หมายถึง วิชาในหมวดวิชาปฏิบัติการ\nเลข 9 หมายถึง วิชาอื่น\nเลขหลักร้อย\nเลข 1 หมายถึง รายวิชาที่จัดสอนในหลักสูตรชั้นปีที่ 1\nเลข 2 หมายถึง รายวิชาที่จัดสอนในหลักสูตรชั้นปีที่ 2\nเลข 3 หมายถึง รายวิชาที่จัดสอนในหลักสูตรชั้นปีที่ 3\nเลข 4 หมายถึง รายวิชาที่จัดสอนในหลักสูตรชั้นปีที่ 4\n4.3.2.2 รายวิชาและข้อกำหนดของหลักสูตร\n1) วิชาศึกษาทั่วไป 30 หน่วยกิต\nนักศึกษาทุกคนสามารถเลือกเรียนได้ทุกรายวิชาในแต่ละหมวด โดยต้องเลือกเรียนให้ครบ\nทั้ง 5 หมวด แต่ละหมวดจะเรียนกี่วิชาก็ได้จำนวนรวมทั้งสิ้น 30 หน่วยกิต ตามโครงสร้างและ\nองค์ประกอบของหลักสูตรวิชาศึกษาทั่วไปทวีิ่ทยาลัยกำหนด ดังนี้\nหมวดวิชา\n1) หมวดความเท่าทันโลกและสังคม\n2) หมวดสุนทรียะและทักษะการสื่อสาร\n3) หมวดคณิตศาสตร์ วิทยาศาสตร์ และเทคโนโลยี\n4) หมวดสุขภาวะและทักษะแห่งอนาคต\n5) หมวดการบริการสังคมและการเรียนรู้จากการปฏิบัติ\nรวม 30 หน่วยกิต\nจำนวนหน่วยกิต\nรหัสวิชา ชื่อวิชา\n(บรรยาย – ปฏิบัติ – ศึกษาดว้ยตนเอง)\n1. หมวดความเท่าทันโลกและสังคม\nมธ.101 โลก อาเซียน และไทย 3(3-0-6)\nTU101 Thailand, ASEAN, and the World\nมธ.109 นวัตกรรมกับกระบวนคิดผู้ประกอบการ 3(3-0-6)\nTU109 Innovation and Entrepreneurial mindset\nมธ.124 สังคมกับเศรษฐกิจ 3(3-0-6)\nTU124 Society and Economy\nมคอ. 2 หลักสูตรวิทยาศาสตรบัณฑิต สาขาวิชานวัตกรรมและการแปรรูปทำงดจิทัล หน้า 10 จำนวนหน่วยกิต\nรหัสวิชา ชื่อวิชา\n(บรรยาย – ปฏิบัติ – ศึกษาดว้ยตนเอง)\n2. หมวดสุนทรียะและทักษะการสื่อสาร\nมธ.106 ความคิดสร้างสรรค์และการสื่อสาร 3(3-0-6)\nTU106 Creativity and Communication\nสษ.105 ทักษะการสื่อสารทางภาษาอังกฤษ 3(3-0-6)\nEL105 English Communication Skills\n3. หมวดคณิตศาสตร์ วิทยาศาสตร์ และเทคโนโลยี\nดท.100 นวัตกรรมดิจิทัล 3(3-0-6)\nDX100 Digital Innovation\nมธ.103 ชีวิตกับความยั่งยืน 3(3-0-6)\nTU103 Life and Sustainability\nมธ.107 ทักษะดิจิทัลกับการแก้ปัญหา 3(3-0-6)\nTU107 Digital Skill and Problem Solving\nมธ.155 สถิติพื้นฐาน 3(3-0-6)\nTU155 Elementary Statistics\nมธ.156 การเขียนโปรแกรมเชิงวิทยาศาสตร์เบื้องต้น 3(3-0-6)\nTU156 Introduction to Scientific Programming\n4. หมวดสุขภาวะและทักษะแห่งอนาคต\nมธ.240 เศรษฐกิจภูมิรัฐศาสตร์โลก 3(3-0-6)\nTU240 World Geopolitical Economy\nมธ.243 ทักษะดิจิตอลเพื่ออนาคต 3(3-0-6)\nTU243 Digital Skills for the Future\nวธ.101 การวางแผนการเงินเพื่อความมั่นคงในการดำรงชีพ 3(3-0-6)\nDE101 Financial planning for economic stability in\nlife\n5. หมวดการบริการสังคมและการเรียนรู้จากการปฏิบัติ\nมธ.100 พลเมืองกับการลงมือแก้ปัญหา 3(3-0-6)\nTU100 Civic Engagement\nมธ.200 พลเมืองกับการลงมือแก้ปัญหาโดยออกแบบ 3(3-0-6)\nTU200 การเรียนรู้เอง\nSelf Design Civic Engagement\nมคอ. 2 หลักสูตรวิทยาศาสตรบัณฑิต สาขาวิชานวัตกรรมและการแปรรูปทำงดจิทัล หน้า 11 2) วิชาเฉพาะ 90 หน่วยกิต\n2.1) วิชาบังคับ 78 หน่วยกิต\nนักศึกษาต้องศึกษารายวิชาบังคับ จำนวน 78 หน่วยกิต ตามรายวิชาที่กำหนดไว้ดังนี้\nจำนวนหน่วยกิต\nรหัสวิชา ชื่อรายวิชา (บรรยาย – ปฏิบัติ – ศึกษา\nด้วยตนเอง)\nหมวดการแก้ปัญหาเชิงสร้างสรรค์ Creative Problem Solving\nดท.210 หลักการเขียนโปรแกรม 3(3-0-6)\nDX210 Principle of Programming\nดท.211 คอมพิวเตอร์ซอฟต์แวร์และการประยุกต์ 3(3-0-6)\nDX211 Computer Software and Applications\nดท.212 การเขียนโปรแกรมบนอุปกรณ์เคลื่อนที่ 3(3-0-6)\nDX212 Mobile Programming\nดท.213 วิทยาการคอมพิวเตอร์ของการตัดสินใจ 3(3-0-6)\nDX213 Computer Science of Human Decisions\nดท.214 การจัดการองค์กรดิจิทัล 3(3-0-6)\nDX214 Managing Digital Firm\nหมวดการวิเคราะห์ทางธุรกิจ Business Analytics\nดท.220 การสำรวจและการเตรียมข้อมูล 3(3-0-6)\nDX220 Data Exploration and Preprocessing\nดท.221 อัลกอริทึมของวิทยาศาสตร์ข้อมูล 3(3-0-6)\nDX221 Data Science Algorithms\nดท.222 ระบบธุรกิจอัจฉริยะ 3(3-0-6)\nDX222 Business Intelligence\nดท.223 วิศวกรรมข้อมูล 3(3-0-6)\nDX223 Data Engineering\nดท.224 โครงงานด้านการวิเคราะห์ข้อมูลสำหรับธุรกิจ 3(0-0-9)\nDX224 Business Analytics Capstone Project\nหมวดธุรกิจ นวัตกรรมและการคิดเชิงออกแบบ Business, Innovation, and Design Thinking\nดท.330 หลักการคิดเชิงออกแบบ 3(3-0-6)\nDX330 Principles of Design Thinking\nมคอ. 2 หลักสูตรวิทยาศาสตรบัณฑิต สาขาวิชานวัตกรรมและการแปรรูปทำงดจิทัล หน้า 12 จำนวนหน่วยกิต\nรหัสวิชา ชื่อรายวิชา (บรรยาย – ปฏิบัติ – ศึกษา\nด้วยตนเอง)\nดท.331 การจัดการนวัตกรรม 3(3-0-6)\nDX331 Innovation Management\nดท.332 การออกแบบ UX/UI 3(3-0-6)\nDX332 UX/UI Design\nดท.333 การจัดการการเงินสำหรับนวัตกรรม 3(3-0-6)\nDX333 Financial Management for Innovation\nดท.334 โครงงานด้านนวัตกรรม 3(0-0-9)\nDX334 Innovation Capstone Project\nหมวดความมั่นคงทางไซเบอร์ประยุกต์ Applied Cybersecurity\nดท.340 พื้นฐานความปลอดภัยทางไซเบอร์ 3(3-0-6)\nDX340 Cyber Security Fundamental\nดท.341 การตรวจพิสูจน์พยานหลักฐานทางดิจิทัล 3(3-0-6)\nDX341 Digital Forensic\nดท.342 การบริหารความต่อเนื่องทางธุรกิจ 3(3-0-6)\nDX342 Business Continuity Management\nดท.343 ความปลอดภัยของเน็ตเวิร์ก 3(3-0-6)\nDX343 Network Security\nดท.344 โครงสร้างพื้นฐานสำคัญ 3(3-0-6)\nDX344 Critical Infrastructure\nการฝึกปฏิบัติงาน\nดท.380 การฝึกปฏิบัติงานด้านธุรกิจดิจิทัล 3\nDX380 Internships for Digital Business (135 hrs.) ไม่น้อยกว่า 135 ชั่วโมง\nหมวดการแปรรูปดิจิทัล Digital Transformation\nดท.450 เทคโนโลยีอุบัติใหม่และแบบจำลองธุรกิจดิจิทัล 3(3-0-6)\nDX450 Emerging technologies and Digital Business Model\nดท.451 กลยุทธ์การแปรรูปทางดิจิทัล 3 หน่วยกิต\nDX451 Digital Transformation Strategy\nดท.452 พฤติกรรมองค์กรในยุคดิจิทัลและภาวะผู้นำความเปลี่ยนแปลง 3(3-0-6)\nDX452 Digital Organizational Behavior and Transformational\nมคอ. 2 หลักสูตรวิทยาศาสตรบัณฑิต สาขาวิชานวัตกรรมและการแปรรูปทำงดจิทัล หน้า 13 จำนวนหน่วยกิต\nรหัสวิชา ชื่อรายวิชา (บรรยาย – ปฏิบัติ – ศึกษา\nด้วยตนเอง)\nLeadership\nดท.453 การสัมมนาเทคโนโลยีดิจิทัลขั้นสูง 3(3-0-6)\nDX453 Advanced Digital Technology Seminar\nดท.454 โครงงานด้านการแปรรูปทางดิจิทัล 3(0-0-9)\nDX454 Digital Transformation Capstone Project\n2.2 วิชาเลือก 15 หน่วยกิต\nนักศึกษาต้องศึกษาวิชาเลือกจำนวน 1 หมวด จาก 2 หมวด โดยศึกษาจำนวนไม่น้อยกว่า 15 หน่วย\nกิต จากรายวิชาที่กำหนดไว้ดังนี้\nจำนวนหน่วยกิต\nรหัสวิชา ชื่อรายวิชา (บรรยาย – ปฏิบัติ – ศึกษา\nด้วยตนเอง)\nหมวดการตลาดดิจิทัล Digital Marketing\nดท.465 พฤติกรรมผู้บริโภคในยุคดิจิทัล 3(3-0-6)\nDX465 Digital Consumers Behavior\nดท.466 การสร้างแบรนด์และการมีส่วนร่วม 3(3-0-6)\nDX466 Digital Branding and Engagement\nดท.467 การบริหารชื่อเสียงในยุคดิจิทัล 3(3-0-6)\nDX467 Digital Reputation Management\nดท.468 กลยุทธ์การตลาดดิจิทัล 3(3-0-6)\nDX468 Digital Marketing Strategy\nดท.469 การบริหารแบรนด์เชิงกลยุทธ์ 3(3-0-6)\nDX469 Strategic Brand Management\nหมวดสื่อสร้างสรรค์ Creative Media\nดท.475 พื้นฐานการเขียนโปรแกรมสื่อสร้างสรรค์ 3(3-0-6)\nDX475 Fundamental of Creative Media Programming\nดท.476 เทคโนโลยีดิจิทัลเพื่อการสร้างสรรค์สื่อใหม่ 3(3-0-6)\nDX476 Digital Technology for New Media Creation\nดท.477 ทฤษฎีเกมเพื่องานสื่อสร้างสรรค์ 3(3-0-6)\nDX477 Gamification for Creative Media\nมคอ. 2 หลักสูตรวิทยาศาสตรบัณฑิต สาขาวิชานวัตกรรมและการแปรรูปทำงดจิทัล หน้า 14 จำนวนหน่วยกิต\nรหัสวิชา ชื่อรายวิชา (บรรยาย – ปฏิบัติ – ศึกษา\nด้วยตนเอง)\nดท.478 การวิจัยเพื่องานสื่อสร้างสรรค์ 3(3-0-6)\nDX478 Research for Creative Media\nดท.479 โครงงานด้านสื่อสร้างสรรค์ 3(0-0-9)\nDX479 Creative Media Capstone Project\n3) วิชาเลือกเสรี 6 หน่วยกิต\nนักศึกษาสามารถเลือกศึกษาวิชาใดก็ได้ที่เปิดสอนในมหาวิทยาลัยธรรมศาสตร์วิชาเลือก\nเสรีหรือเลือกศึกษาจากวิชาที่คณะเปิดสอนจำนวนไม่น้อยกว่า 6 หน่วยกิต ทั้งนี้ให้หมายรวมถึงวิชาศึกษา\nทวั่ ไปหมวดภาษาต่างประเทศด้วย\nรายวิชาที่หลักสูตรเปิดสอน มีดังนี้\nจำนวนหน่วยกิต\nรหัสวิชา ชื่อรายวิชา (บรรยาย – ปฏิบัติ – ศึกษา\nด้วยตนเอง)\nดท.395 นวัตกรรมและผู้ประกอบการ 3(3-0-6)\nDX395 Innovation and Entrepreneurship\nดท.396 เศรษฐศาสตร์และการวิเคราะห์สภาวะทางธุรกิจ 3(3-0-6)\nDX396 Economics and Business Condition Analysis\nดท.397 กฎหมายธุรกิจและเทคโนโลยีสารสนเทศ 3(3-0-6)\nDX397 Business and Information Technology Laws\nดท.398 การบริหารโครงการ 3(3-0-6)\nDX398 Project Management\nดท.399 การเงินและบัญชี 3(3-0-6)\nDX399 Accounting and Finance\n นักศึกษาไม่สามารถนำวิชาในหลักสูตรวิชาศึกษาทั่วไปที่รหัส ระดับ 100 ไปวิชาเลือกเสรี\nได้หรือวิชาเลือก หรือวิชาโท\n นักศึกษาไม่สามารถนำรายวิชาเลือกเสรีที่หลักสูตรเปิดสอนไปวิชาเลือกได้\nมคอ. 2 หลักสูตรวิทยาศาสตรบัณฑิต สาขาวิชานวัตกรรมและการแปรรูปทำงดจิทัล หน้า 15 4.3.2.3 แสดงแผนการศึกษา\nปีการศึกษาที่ 1 | ภาคเรียนที่ 1\nมธ.109 นวัตกรรมกับกระบวนคิดผู้ประกอบการ\n3 หน่วยกิต\nTU109 Innovation and Entrepreneurial Mindset\nมธ.103 ชีวิตกับความยั่งยืน 3 หน่วยกิต\nTU103 Life and Sustainability\nมธ.107 ทักษะดิจิทัลกับการแก้ปัญหา 3 หน่วยกิต\nTU107 Digital Skill and Problem Solving\nดท.100 นวัตกรรมดิจิทัล 3 หน่วยกิต\nDX100 Digital Innovation\nสษ.105 ทักษะการสื่อสารทางภาษาอังกฤษ 3 หน่วยกิต\nEL105 English Communication Skills\nรวม 15 หน่วยกิต\nปีการศึกษาที่ 1 | ภาคเรียนที่ 2\nมธ.100 พลเมืองกับการลงมือแก้ปัญหา 3 หน่วยกิต\nTU100 Civic Engagement\nวธ.101 การวางแผนการเงินเพื่อความมั่นคงในการดำรงชีพ\n3 หน่วยกิต\nDE101 Financial planning for economic stability in life\nมธ.106 ความคิดสร้างสรรค์และการสื่อสาร 3 หน่วยกิต\nTU106 Creativity and Communication\nมธ.155 สถิติพื้นฐาน 3 หน่วยกิต\nTU155 Elementary Statistics\nมธ.156 การเขียนโปรแกรมเชิงวิทยาศาสตร์เบื้องต้น 3 หน่วยกิต\nTU156 Introduction to Scientific Programming\nรวม 15 หน่วยกิต\nมคอ. 2 หลักสูตรวิทยาศาสตรบัณฑิต สาขาวิชานวัตกรรมและการแปรรูปทำงดจิทัล หน้า 16 ปีการศึกษาที่ 2 | ภาคเรียนที่ 1\nดท.210 หลักการเขียนโปรแกรม 3 หน่วยกิต\nDX210 Principle of Programming\nดท.211 คอมพิวเตอร์ซอฟต์แวร์และการประยุกต์ 3 หน่วยกิต\nDX211 Computer Software and Applications\nดท.212 การเขียนโปรแกรมบนอุปกรณ์เคลื่อนที่ 3 หน่วยกิต\nDX212 Mobile Programming\nดท.213 วิทยาการคอมพิวเตอร์ของการตัดสินใจ 3 หน่วยกิต\nDX213 Computer Science of Human Decisions\nดท.214 การจัดการองค์กรดิจิทัล 3 หน่วยกิต\nDX214 Managing Digital Firm\nวิชาเลือกเสรี #1 3 หน่วยกิต\nFree Elective #1\nรวม 18 หน่วยกิต\nปีการศึกษาที่ 2 | ภาคเรียนที่ 2\nดท.220 การสำรวจและการเตรียมข้อมูล 3 หน่วยกิต\nDX220 Data Exploration and Preprocessing\nดท.221 อัลกอริทึมของวิทยาศาสตร์ข้อมูล 3 หน่วยกิต\nDX221 Data Science Algorithms\nดท.222 ระบบธุรกิจอัจฉริยะ 3 หน่วยกิต\nDX222 Business Intelligence\nดท.223 วิศวกรรมข้อมูล 3 หน่วยกิต\nDX223 Data Engineering\nดท.224 โครงงานด้านการวิเคราะห์ข้อมูลสำหรับธุรกิจ 3 หน่วยกิต\nDX224 Business Analytics Capstone Project\nรวม 15 หน่วยกิต\nมคอ. 2 หลักสูตรวิทยาศาสตรบัณฑิต สาขาวิชานวัตกรรมและการแปรรูปทำงดจิทัล หน้า 17 ปีการศึกษาที่ 3 | ภาคเรียนที่ 1\nดท.330 หลักการคิดเชิงออกแบบ 3 หน่วยกิต\nDX330 Principles of Design Thinking\nดท.331 การจัดการนวัตกรรม 3 หน่วยกิต\nDX331 Innovation Management\nดท.332 การออกแบบ UX/UI 3 หน่วยกิต\nDX332 UX/UI Design\nดท.333 การจัดการการเงินสำหรับนวัตกรรม 3 หน่วยกิต\nDX333 Financial Management for Innovation\nดท.334 โครงงานด้านนวัตกรรม 3 หน่วยกิต\nDX334 Innovation Capstone Project\nวิชาเลือกเสรี #2 3 หน่วยกิต\nFree Elective #2\nรวม 18 หน่วยกิต\nปีการศึกษาที่ 3 | ภาคเรียนที่ 2\nดท.340 พื้นฐานความปลอดภัยทางไซเบอร์ 3 หน่วยกิต\nDX340 Cyber Security Fundamental\nดท.341 การตรวจพิสูจน์พยานหลักฐานทางดิจิทัล 3 หน่วยกิต\nDX341 Digital Forensic\nดท.342 การบริหารความต่อเนื่องทางธุรกิจ 3 หน่วยกิต\nDX342 Business Continuity Management\nดท.343 ความปลอดภัยของเน็ตเวิร์ก 3 หน่วยกิต\nDX343 Network Security\nดท.344 โครงสร้างพื้นฐานสำคัญ 3 หน่วยกิต\nDX344 Critical Infrastructure\nรวม 15 หน่วยกิต\nปีการศึกษาที่ 3 | ภาคฤดูร้อน\nดท.380 การฝึกปฏิบัติงานด้านธุรกิจดิจิทัล 3 หน่วยกิต\nDX380 Internships for Digital Business (135 hrs.)\nรวม 3 หน่วยกิต\nมคอ. 2 หลักสูตรวิทยาศาสตรบัณฑิต สาขาวิชานวัตกรรมและการแปรรูปทำงดจิทัล หน้า 18 ปีการศึกษาที่ 4 | ภาคเรียนที่ 1\nดท.450 เทคโนโลยีอุบัติใหม่และแบบจำลองธุรกิจดิจิทัล 3 หน่วยกิต\nDX450 Emerging Technologies and Digital Business Model\nดท.451 กลยุทธ์การแปรรูปทางดิจิทัล 3 หน่วยกิต\nDX451 Digital Transformation Strategy\nดท.452 พฤติกรรมองค์กรในยุคดิจิทัลและภาวะผู้นำความเปลี่ยนแปลง 3 หน่วยกิต\nDX452 Digital Organizational Behavior and Transformational Leadership\nดท.453 การสัมมนาเทคโนโลยีดิจิทัลขั้นสูง 3 หน่วยกิต\nDX453 Advanced Digital Technology Seminar\nดท.454 โครงงานด้านการแปรรูปทางดิจิทัล 3 หน่วยกิต\nDX454 Digital Transformation Capstone Project\nรวม 15 หน่วยกิต\nปีการศึกษาที่ 4 | ภาคเรียนที่ 2\nวิชาเลือก #1 3 หน่วยกิต\nElective Course #1\nวิชาเลือก #2 3 หน่วยกิต\nElective Course #2\nวิชาเลือก #3 3 หน่วยกิต\nElective Course #3\nวิชาเลือก #4 3 หน่วยกิต\nElective Course #4\nวิชาเลือก #5 3 หน่วยกิต\nElective Course #5\nรวม 15 หน่วยกิต\nมคอ. 2 หลักสูตรวิทยาศาสตรบัณฑิต สาขาวิชานวัตกรรมและการแปรรูปทำงดจิทัล หน้า 19 4.3.2.4 คำอธิบายรายวิชา\nวิชาศึกษาทั่วไป\nหมวดความเท่าทันโลกและสังคม\nมธ.101 โลก อาเซียน และไทย 3(3-0-6)\nTU101 Thailand, ASEAN, and the World\nศึกษาปรากฏการณ์ที่สำคัญของโลก อาเซียนและไทย ในมิติทางการเมือง เศรษฐกิจ สังคม\nวัฒนธรรม โดยใช้กรอบแนวคิด ทฤษฎี และระเบียบวิจัยทางสังคมศาสตร์ ผ่านการอภิปรายและ\nยกตัวอย่างสถานการณ์หรือบุคคลที่ได้รับความสนใจ เพื่อให้เกิดมุมมองต่อความหลากหลายและ\nเข้าใจความซับซ้อนที่สัมพันธ์กันทั้งโลก มีจิตสำนึกสากล สามารถท้าทายกรอบความเชื่อเดิมและเปิดโลก\nทัศน์ใหม่ให้กว้างขวางขึ้น\nStudy of significant phenomena around the world, in the ASEAN region and in\nThailand in terms of their political, economic and sociocultural dimensions. This is done\nthrough approaches, theories and principles of social science research via discussion and\nraising examples of situations or people of interest. The purpose of this is to create a\nperspective of diversity, to understand the complexity of global interrelationships, to\nbuild a global mindset and to be able to challenge old paradigms and open up a new,\nbroader worldview.\nมธ.109 นวัตกรรมกับกระบวนคิดผู้ประกอบการ 3(3-0-6)\nTU109 Innovation and Entrepreneurial Mindset\nการประเมินความเสี่ยงและการสร้างโอกาสใหม่การคิดและการวางแผนแบบผู้ประกอบการ\nการตัดสินใจและการพัฒนาธุรกิจ การสื่อสารเชิงธุรกิจและการสร้างแรงจูงใจอย่างมีประสิทธิภาพ การ\nสร้างคุณค่าร่วมเพื่อสังคม\nRisk assessment and creating new opportunities. Thinking and planning as an\nentrepreneur. Decision making and entrepreneurial venture development. Business\ncommunication for delivering concept or initiative in an efficient, effective and\ncompelling manner. Social shared value creation.\nมคอ. 2 หลักสูตรวิทยาศาสตรบัณฑิต สาขาวิชานวัตกรรมและการแปรรูปทำงดจิทัล หน้า 20 มธ.124 สังคมกับเศรษฐกิจ 3(3-0-6)\nTU124 Society and Economy\nแนวทางการศึกษาและการวิเคราะห์สังคม และเศรษฐกิจในฐานะที่วิชานี้การศึกษาทางด้าน\nสังคมศาสตร์แล้วนาสู่การวิเคราะห์วิวัฒนาการของสังคมและเศรษฐกิจที่เกิดขึ้นในภาพกว้างของโลกและ\nของประเทศไทย โดยเน้นให้เห็นถึงอิทธิพลของวัฒนธรรมและสถาบันที่มีต่อระบบสังคมเศรษฐกิจ\nTo provide guidelines for the study and analysis of society and economy. To\nanalyze social and economic evolution in Thailand and worldwide. To emphasize the\ninfluence of culture and institutions on the social and economic system.\nหมวดสุนทรียะและทักษะการสื่อสาร\nมธ.106 ความคิดสร้างสรรค์และการสื่อสาร 3(3-0-6)\nTU106 Creativity and Communication\nกระบวนการคิดอย่างสร้างสรรค์ โดยมีการคิดเชิงวิพากษ์องค์ประกอบสำคัญ และการ\nสื่อสารความคิดดังกล่าวให้เกิดผลสัมฤทธิ์อย่างเหมาะสมตามบริบทสังคม วัฒนธรรม สภาพแวดล้อม ทั้งใน\nระดับบุคคล องค์กร และสังคม\nCreative thought processes, with critical thinking as an important part, as well as\ncommunication of these thoughts that lead to suitable results in social, cultural and\nenvironmental contexts, at personal, organisational andsocial levels.\nสษ.105 ทักษะการสื่อสารด้วยภาษาอังกฤษ 3(3-0-6)\nEL105 English Communication Skills\nพัฒนาทักษะการสื่อสารทางภาษาอังกฤษด้านการฟัง พูด อ่าน และเขียน ฝึกการใช้ภาษา\nคำศัพท์ และสำนวนในบริบททางวิชาการการและสังคม\nDevelopment of English communication skills, including listening, speaking,\nreading and writing. Practice of language, vocabulary and expressions used in academic\nand social contexts.\nมคอ. 2 หลักสูตรวิทยาศาสตรบัณฑิต สาขาวิชานวัตกรรมและการแปรรูปทำงดจิทัล หน้า 21 หมวดคณิตศาสตร์ วิทยาศาสตร์ และเทคโนโลยี\nดท.100 นวัตกรรมดิจิทัล 3(3-0-6)\nDX100 Digital Innovation\nเทคโนโลยีดิจิทัลร่วมสมัย แรงขับเคลื่อนในยุคดิจิทัล ธุรกิจและสังคมดิจิทัล ผู้บริโภคยุคดิจิทัล\nเศรษฐกิจดิจิทัล ผลกระทบของนวัตกรรมดิจิทัลต่อธุรกิจและสังคม\nState of the Arts Digital Technoloy. Digital Driving Forces. Digital Business and\nSociety. Digital Consumers. Digital Economy. Impacts of Digital Innovation on Business\nand Society.\nมธ.103 ชีวิตกับความยั่งยืน 3(3-0-6)\nTU103 Life and Sustainability\nการดำเนินชีวิตอย่างเท่าทันกับการเปลี่ยนแปลงของโลก เข้าใจความสัมพันธ์ระหว่างพลวัตของ\nธรรมชาติมนุษย์ และสรรพสิ่ง ทั้งสิ่งแวดล้อมสรรสร้าง การใช้พลังงาน เศรษฐกิจ สังคมในความขัดแย้ง\nและการแปรเปลี่ยน ตลอดจนองค์ความรู้ทางวิทยาศาสตร์สิ่งแวดล้อม ที่นำไปสู่การปรับเปลี่ยนวิถีชีวิตสู่\nความยั่งยืน\nThis course provides an introduction to the importance of life-cycle systems\nperspectives in understanding major challenges and solutions to achieving more\nsustainable societies in this changing world. Students will learn about the relationship\nbetween mankind and the environment in the context of energy and resource use,\nconsumption and development, and environmental constraints. Furthermore, an\nexamination of social conflict and change from the life-cycle perspective will be used to\ndevelop an understanding of potential solution pathways for sustainable lifestyle\nmodifications.\nมธ.107 ทักษะดิจิทัลกับการแก้ปัญหา 3(3-0-6)\nTU107 Digital Skill and Problem Solving\nทักษะการคิดเชิงคำนวณเพื่อการแก้ปัญหาและการพัฒนาโอกาสใหม่ด้านสังคมและเศรษฐกิจ\nความสามารถในค้นหาและการเข้าถึงสารสนเทศได้อย่างมีประสิทธิภาพ การประเมินความน่าเชื่อถือของ\nสารสนเทศ การกลั่นกรองและจัดการสารสนเทศอย่างระบบ การใช้และจรรยาบรรณด้านดิจิทัล การ\nสื่อสารออนไลน์อย่างมืออาชีพ\nBasic computational thinking skill for solving problems and developing new\nsocial and economic opportunities. Efficient access and search for information.\nมคอ. 2 หลักสูตรวิทยาศาสตรบัณฑิต สาขาวิชานวัตกรรมและการแปรรูปทำงดจิทัล หน้า 22 Information reliability evaluation. Filtering and managing information systematically.\nEthical digital usage and professional online communication.\nมธ.155 สถิติพื้นฐาน 3(3-0-6)\nTU155 Elementary Statistics\nลักษณะปัญหาทางสถิติทบทวนสถิติเชิงพรรณนาความน่าจะ ตัวแปรสุ่มและการแจกแจง\nของตัวแปรสุ่มแบบทวินาม ปัวซง และปกติ เทคนิคการชักตัวอย่างและการแจกแจงของตัวสถิติ\nการประมาณค่าและการทดสอบสมมติฐานเกี่ยวกับค่าเฉลี่ยประชากรกลุ่มเดียวและสองกลุ่ม การวิเคราะห์\nความแปรปรวนจำแนกทางเดียว การวิเคราะห์การถดถอยและสหสัมพันธ์เชิงเส้นเชิงเดียว การทดสอบไค\nกำลังสอง\nThe nature of statistical problems, review of descriptive statistics, probability,\nrandom variables and some probability distributions (binomial, poison and normal),\nelementary sampling and sampling distributions, estimation and hypotheses testing for\none and two populations, one-way analysis of variance, simple linear regression and\ncorrelation, chi-square test.\nมธ.156 การเขียนโปรแกรมเชิงวิทยาศาสตร์เบื้องต้น 3(3-0-6)\nTU156 Introduction to Scientific Programming\nหลักการพื้นฐานของระบบคอมพิวเตอร์ หลักการประมวลผลข้อมูลอิเล็กทรอนิกส์ ซอฟต์แวร์\nระบบ และซอฟต์แวร์ประยุกต์ ขั้นตอนวิธีผังงาน การแทนข้อมูล วิธีการการออกแบบและพัฒนาโปรแกรม\nการแกปั้ญหาด้วยภาษาโปรแกรมระดับสูง\nBasic concepts of computer systems, electronic data processing concepts, system\nand application software, algorithms, flowcharts, data representation, program design\nand development methodology, problem solving using high-level language programming.\nหมวดสุขภาวะและทักษะแห่งอนาคต\nมธ.240 เศรษฐกิจภูมิรัฐศาสตร์โลก 3(3-0-6)\nTU240 World Geopolitical Economy\nศึกษาความสัมพันธ์ระหว่างภูมิรัฐศาสตร์ เศรษฐกิจ ความสัมพันธ์ระหว่างประเทศในภูมิภาค\nเศรษฐกิจโลก ปัญหาภูมิรัฐศาสตร์ มหาอำนาจทางเศรษฐกิจ ความขัดแย้งระหว่างประเทศ และนโยบาย\nทางเศรษฐกิจและการเมืองของมหาอำนาจที่มีอิทธิพลต่อประเทศต่าง ๆ เช่น การใช้นโยบายซอฟท์\nพาวเวอร์ นโยบายการลงโทษทางสังคม ต้น\nมคอ. 2 หลักสูตรวิทยาศาสตรบัณฑิต สาขาวิชานวัตกรรมและการแปรรูปทำงดจิทัล หน้า 23 A Study of the Relationship between Geopolitics, Economy, Relations between\nCountries in the Region, World Economy, Geopolitical Problems. Economic Superpower,\nInternational Conflict and the Economic and Political Policies of the Great Powers that\nInfluence Countries such as using Soft Power Policy, Social Sanction and etc.\nมธ.243 ทักษะดิจิตอลเพื่ออนาคต 3(3-0-6)\nTU243 Digital Skills for the Future\nเรียนรู้ทักษะการใช้เทคโนโลยีดิจิทัล การรู้และใช้สื่อ (Media literacy) ทักษะในการใช้\nเทคโนโลยี เพื่อการติดต่อ สื่อสาร เพื่อการทำงานร่วมกัน (Communications and collaboration)\nทักษะความสามารถในการใช้ดิจิทัลเสริมกับอาชีพแห่งตน จัดการดูแลอัตลักษณ์ความตัวตนในโลก\nไซเบอร์ (Career & Identity management) ทักษะการใช้เทคโนโลยีดิจิทัล (Digital literacy) เข้าใจ\nเทคโนโลยีดิจิทัลพนื้ฐาน ใช้อุปกรณ์ทางด้านดิจิทัลได้ทักษะการใช้ดิจิทัลเพื่อการเรียนรู้ (Learning skills)\nทักษะการใช้ข้อมูลข่าวสารเพื่อประโยชน์เชิงวิชาการ (Digital scholarship) และทักษะการใช้ข้อมูล\nข่าวสาร (Information literacy)\nLearn Digital Technology Skills, Media Literacy, Skills in using Technology for\nCommunication forCollaboration (Communications and collaboration), Digital Skills to\nSupport their Career (Career and Identity Management), Digital Literacy, Understand Basic\nDigital Technology, able to use Digital Devices, Digital Skills for Academic and Information\nLiteracy.\nวธ.101 การวางแผนการเงินเพื่อความมั่นคงในการดำรงชีพ 3(3-0-6)\nDE101 Financial planning for ecomomic stability in life\nการตั้งเป้าหมายทางการเงิน ภาษีเงินได้บุคคลธรรมดา กองทุนสำรองเลี้ยงชีพ หลักการวางแผน\nจัดการเงินส่วนบุคคลเพื่อสร้างความมั่งคั่ง อันประกอบไปด้วยการสร้างรายได้การออม การใช้จ่ายในการ\nดำรงชีพ และการลงทุน รวมถึงการแนะนำสินทรัพย์การลงทุนประเภทต่าง ๆ พร้อมกลักการวิเคราะห์เพื่อ\nนำไปปฏิบัติจริง\nHow to set financial goal, Personal Income Tax, Provident fund, Principles of\npersonal financial planning for wealth including revenue generating, saving, living\nexpense, and investment, Introduction of various investment assets with analytical\nprinciples for practice\nมคอ. 2 หลักสูตรวิทยาศาสตรบัณฑิต สาขาวิชานวัตกรรมและการแปรรูปทำงดจิทัล หน้า 24 หมวดการบริการสังคมและการเรียนรู้จากการปฏิบัติ\nมธ.100 พลเมืองกับการลงมือแก้ปัญหา 3(3-0-6)\nTU100 Civic Engagement\nปลูกฝังจิตสำนึก บทบาท และหน้าที่ความรับผิดชอบของการสมาชิกที่ดีของสังคมในฐานะ\nพลเมืองโลก ผ่านกระบวนการหลากหลายวิธี เช่น การบรรยาย การอภิปรายกรณีศึกษาต่าง ๆ ดูงาน\nต้น โดยนักศึกษาจะต้องจัดทำโครงการรณรงค์ เพื่อให้เกิดการรับรู้หรือเกิดการเปลี่ยนแปลง ใน\nประเด็นที่สนใจ\nInstillation of social conscience and awareness of one’s role and duties as a\ngood global citizen. This is done through a variety of methods such as lectures,\ndiscussion of various case studies and field study outings. Students are required to\norganize a campaign to raise awareness or bring about change in an area of their interest.\nมธ.200 พลเมืองกับการลงมือแก้ปัญหาโดยออกแบบการเรียนรู้เอง 3(3-0-6)\nTU200 Self Design Civic Engagement\nการพัฒนาทัศนคติความพลเมืองในระบอบประชาธิปไตยที่พึ่งพาตนเองในการแก้ไขปัญหา\nของสังคม เรียนรู้วิธีการลงมือแก้ปัญหาต่าง ๆ ที่เกิดขึ้นในสังคมด้วยการลงมือทำ โดยออกแบบ\nกระบวนการเรียนรู้และการวัดผลร่วมกับอาจารย์ผู้สอน\nThe development of citizenship attitudes in a self-reliant democracy in solving\nsocial problems; Learn how to take self action to solve problems in society by designing\nthe learning process and evaluation in collaboration with instructor.\nวิชาบังคับ\nหมวดการแก้ปัญหาเชิงสร้างสรรค์ Creative Problem Solving\nดท.210 หลักการเขียนโปรแกรม 3(3-0-6)\nDX210 Principle of Programming\nการเขียนโปรแกรม โครงสร้างข้อมูล พื้นฐานการควบคุมขั้นตอนวิธีประมวลผล การสร้างและใช้\nงานโมดูล การนำเข้าข้อมูลจากไฟล์และฐานข้อมูล การจัดการข้อมูล องค์ประกอบการสร้างแผนภูมิ และ\nการส่งข้อมูลต่อให้ผู้ใช้\nProgramming. Data structure. Control structure. Module creation and usage. Data\ninput from files and database. Data management. Graph creation. Presentation of data to\nusers.\nมคอ. 2 หลักสูตรวิทยาศาสตรบัณฑิต สาขาวิชานวัตกรรมและการแปรรูปทำงดจิทัล หน้า 25 ดท.211 คอมพิวเตอร์ซอฟต์แวร์และการประยุกต์ 3(3-0-6)\nDX211 Computer Software and Applications\nการแนะนำคอมพิวเตอรซอฟตแวรและระบบปฏิบัติการ เครื่องมือผลิตภาพและการประยุกตเพื่อ\nการเขียน การวิเคราะห และการนำเสนอขอมูล อินเตอรเน็ต เครื่องมือสื่อประสม และการประยุกตเพื่อ\nการสื่อสาร และการวิจัย เครื่องมือทางคณิตศาสตรและการประยุกตเพื่อการแกปญหา\nIntroduction to computer software and operating systems. Productivity tools and\ntheir applications for writing, analyzing and presenting information. Internet, multimedia\ntools and their applications for communications and research. Mathematical tools and\ntheir applications for problem solving.\nดท.212 การเขียนโปรแกรมบนอุปกรณ์เคลื่อนที่ 3(3-0-6)\nDX212 Mobile Programming\nศึกษาแนวคิดการพัฒนาแอพพลิเคชั่นบนอุปกรณ์เคลื่อนที่ เทคโนโลยีที่เกี่ยวข้องกับการ\nประมวลผลบนอุปกรณ์เคลื่อนที่และการสื่อสารแบบไร้สาย กรอบการพัฒนาแอพพลิเคชั่นบนอุปกรณ์\nเคลื่อนที่และปฏิสัมพันธ์กับผู้ใช้\nStudy mobile application development. Mobile computing technologies and\nwireless communication. Mobile application development framework and user\ninteraction.\nดท.213 วิทยาการคอมพิวเตอร์ของการตัดสินใจ 3(3-0-6)\nDX213 Computer Science of Human Decisions\nศึกษาอัลกอริทึมทางวิทยาการคอมพิวเตอร์ที่สามารถนำมาประยุกต์ใช้กับการตัดสินใจใน\nชีวิตประจำวัน ประกอบไปด้วย Optimal Stopping. Explore/Exploit. Sorting. Caching.\nScheduling. Bayes’s Rule. Overfitting. Relaxation. Randomness. Networking. Game Theory.\nStudy computer science algorithms that can be applied to decision making\nproblems: Optimal Stopping. Explore/Exploit. Sorting. Caching. Scheduling. Bayes’s Rule.\nOverfitting. Relaxation. Randomness. Networking. Game Theory\nดท.214 การจัดการองค์กรดิจิทัล 3(3-0-6)\nDX214 Managing Digital Firm\nระบบสารสนเทศในธุรกิจระดับโลก ธุรกิจดิจิทัลในระดับโลก ระบบสารสนเทศ องค์กรและ\nกลยุทธ์ ประเด็นทางสังคมและจริยธรรมเกี่ยวกับระบบสารสนเทศ โครงการพื้นฐานทางเทคโนโลยี\nสารสนเทศและเทคโนโลยีอุบัติใหม่พื้นฐานธุรกิจอัจริยะ โทรคมนาคม อินเทอร์เน็ตและเทคโนโลยีไร้สาย\nมคอ. 2 หลักสูตรวิทยาศาสตรบัณฑิต สาขาวิชานวัตกรรมและการแปรรูปทำงดจิทัล หน้า 26 ความปลอดภัยของระบบสารสนเทศ ซอฟต์แวร์ประยุกต์สำหรับองค์กร การพาณิชย์ดิจิทัล การจัดการ\nองค์ความรู้และปัญญาประดิษฐ์ การสร้างระบบสารสนเทศ\nInformation Systems in Global Business. Global Digital Business. Information\nSystems, Organizations, and Strategy. Ethical and Social Issues in Information Systems. IT\nInfrastructure and Emerging Technologies. Foundations of Business Intelligence.\nTelecommunications, the Internet, and Wireless Technology. Securing Information\nSystems. Enterprise Applications. Digital Commerce. Managing Knowledge and Artificial\nIntelligence. Decision Making. Building Information Systems.\nหมวดการวิเคราะห์ทางธุรกิจ Business Analytics\nดท.220 การสำรวจและการเตรียมข้อมูล 3(3-0-6)\nDX220 Data Exploration and Preprocessing\nการสำรวจข้อมูล การตรวจสอบคุณสมบัติของข้อมูลและการแสดงผลข้อมูล การเตรียมข้อมูลเพื่อ\nการวิเคราะห์ ได้แก่การทำความสะอาดข้อมูล การสกัดข้อมูล และการเลือกตัวแปร\nData Exploration Investigation the properties of data and Visualizing data pre-\nproposing the data that include data cleaning feature extraction and feature selection\nดท.221 อัลกอริทึมของวิทยาศาสตร์ข้อมูล 3(3-0-6)\nDX221 Data Science Algorithms\nอัลกอริทึมที่ใช้ในการจัดแยกข้อมูล สมการถดถอย การแบ่งกลุ่มข้อมูล การวิเคราะห์ความ\nสอดคล้อง และการวิเคราะห์ข้อมูลเชิงลำดับ\nAlgorithms for classification, regression, clustering, association analysis and\nsequential data analysis.\nดท.222 ระบบธุรกิจอัจฉริยะ 3(3-0-6)\nDX222 Business Intelligence\nกระบวนการการบูรณาการข้อมูลจากแหล่งข้อมูลต่าง ๆ การออกแบบตัวชี้วัดด้านสมรรถภาพของ\nธุรกิจ การสกัด เปลี่ยนแปลง และการบันทึกข้อมูล การแสดงผลข้อมูล และการออกแบบแดชบอร์ด\nData Integration from various sources. Key Performance Indicator Design. Data\nExtraction, Transformation, and Loading. Data Visualization and Dashboard Design.\nมคอ. 2 หลักสูตรวิทยาศาสตรบัณฑิต สาขาวิชานวัตกรรมและการแปรรูปทำงดจิทัล หน้า 27 ดท.223 วิศวกรรมข้อมูล 3(3-0-6)\nDX223 Data Engineering\nแนวคิดด้านฐานข้อมูล คลังข้อมูล กระบวนการ ETL คุณภาพของข้อมูล ฐานข้อมูล NoSQL\nเบื้องต้น\nDatabase Concepts. Data Warehousing. ETL Process. Data Quality. Introduction to\nNoSQL Databases.\nดท.224 โครงงานด้านการวิเคราะห์ข้อมูลสำหรับธุรกิจ 3(0-9-0)\nDX224 Business Analytics Capstone Project\nการประยุกต์เทคโนโลยีร่วมสมัยที่เกี่ยวกับธุรกิจอัจฉริยะ การเตรียมข้อมูล และการทำเหมือง\nข้อมูล สำหรับกรณีศึกษาทางธุรกิจ เริ่มจากการวิเคราะห์ความต้องการทางธุรกิจ การดำเนินการตาม\nขั้นตอนต่าง ๆ ในการวิเคราะห์ข้อมูลเพื่อสกัดความรู้จากแหล่งข้อมูล และการนำเสนอผลการดำเนินงาน\nแก่ผู้ที่เกี่ยวข้อง\nApply state of the art business intelligence, data preparation and data mining\ntechniques to a specific case study and dataset. Starting with a business objective and\ndata, work through all stages of an appropriate methodology to extract knowledge from\nthe data in accordance with the business objectives, and present the results to\nstakeholders\nหมวดธุรกิจ นวัตกรรมและการคิดเชิงออกแบบ Business, Innovation, and Design Thinking\nดท.330 หลักการคิดเชิงออกแบบ 3(3-0-6)\nDX330 Principles of Design Thinking\nกิจกรรมพื้นฐานที่เกี่ยวข้องกับการคิดการออกแบบ การเอาใจใส่เพื่อทำความเข้าใจกับปัญหา\nการสร้างความคิด ขัดเกลาความคิด และการสื่อสาร การสร้างต้นแบบและการทดสอบผู้ใช้\nFoundational activities related to design thinking. Empathizing to understand the\nproblem. Ideation, Iteration, and Communication. Prototyping and user testing.\nดท.331 การจัดการนวัตกรรม 3(3-0-6)\nDX331 Innovation Management\nกระบวนการด้านนวัตกรรมและวิธีการในการจัดการนวัตกรรมในองค์กร เข้าใจกระบวนการ\nในการพัฒนาผลิตภัณฑ์ใหม่รวมถึง การวิจัยตลาด การสร้างแบบจำลองธุรกิจ และกระบวนการในการ\nยอมรับนวัตกรรมใหม่\nมคอ. 2 หลักสูตรวิทยาศาสตรบัณฑิต สาขาวิชานวัตกรรมและการแปรรูปทำงดจิทัล หน้า 28 Innovation process and how to manage innovation in organization.\nUnderstanding product development process including market research, business model,\nand market adoption process.\nดท.332 การออกแบบ UX/UI 3(3-0-6)\nDX332 UX/UI Design\nเข้าใจการออกแบบโดยให้ผู้ใช้ศูนย์กลาง การออกแบบกราฟฟิคบนหน้าจอ เทคนิคการจำลอง\nสถานการณ์และการสร้างโปรโตไทป์ วิธีการทดสอบการใช้งาน เทคโนโลยีที่เกี่ยวกับกับส่วนติดต่อกับผู้ใช้\nซอฟต์แวร์ที่ช่วยในการสร้างไวร์เฟรมและโปรโตไทป์\nUnderstanding of user- centered design. Graphic design on screens. Simulation\nand prototyping techniques. Usability testing methods. Interface technologies.\nWireframing and Prototyping software.\nดท.333 การจัดการการเงินสำหรับนวัตกรรม 3(3-0-6)\nDX333 Financial Management for Innovation\nหลักการของการจัดการการเงิน รวมถึง ความเสี่ยง ผลตอบแทน ต้นทุนทางการเงิน การวิเคราะห์\nความไปได้ทางการเงิน และการประเมินมูลค่าธุรกิจ ทางเลือกต่าง ๆ ในการจัดหาแหล่งเงินทุนสำหรับ\nธุรกิจ\nPrinciples of Financial Management including risks, returns, cost of capital,\nfinancial feasibility analysis, business valuation. Various options in financing business.\nดท.334 โครงงานด้านนวัตกรรม 3(0-9-0)\nDX334 Innovation Capstone Project\nการประยุกต์ใช้กระบวนการในการสร้างนวัตกรรม การคิดเชิงออกแบบ เพื่อนำไปแก้ปัญหาหรือ\nออกแบบผลิตภัณฑ์หรือบริการใหม่ในสถานการณ์จริง\nApply the innovation creation process and design thinking methods in order to\nsolve real world business and industry problems and present the results to stakeholders\nหมวดความมั่นคงทางไซเบอร์ประยุกต์ Applied Cybersecurity\nดท.340 พื้นฐานความปลอดภัยทางไซเบอร์ 3(3-0-6)\nDX340 Cyber Security Fundamental\nเทคโนโลยีอินเตอร์เน็ตและระบบเครือข่าย การรักษาความปลอดภัยระบบเทคโนโลยีสารสนเทศ\nภัยคุกคามทางอินเตอร์เน็ตทั้งในระดับมัลแวร์ การโจรกรรมทางไซเบอร์ การเคลื่อนไหวเพื่อประโยชน์ของ\nมคอ. 2 หลักสูตรวิทยาศาสตรบัณฑิต สาขาวิชานวัตกรรมและการแปรรูปทำงดจิทัล หน้า 29 กลุ่ม และสงครามทางไซเบอร์ ความส่วนตัวและการเฝ้าระวังทางไซเบอร์ เทคโนโลยีการป้องกันภัย\nทางไซเบอร์ การเข้ารหัส เศรษฐศาสตร์ของความมั่นคงปลอดภัยทางไซเบอร์ นโยบายด้านการรักษาความ\nปลอดภัยทางไซเบอร์ ทั้งในระดับประเทศและระดับสากล การป้องกันโครงสร้างพื้นฐานสำคัญและการวาง\nแผนการกู้คืนจากภัยพิบัติกรณีศึกษาด้านความมั่นคงปลอดภัยทางไซเบอร์\nInternet and Network Technology. Information System Security. Cyber Threats\nfrom Malware Cyber Crime Hacktivist and Cyber War. Privacy and Cyber Surveillance.\nCyber Protection Technology. Encryption. Cybersecurity Economy. National and\nInternational Cybersecurity Policy. Critical Infrastructure Protection and Disaster Recovery\nPlanning. Case Studies on Cybersecurity\nดท.341 การตรวจพิสูจน์พยานหลักฐานทางดิจิทัล 3(3-0-6)\nDX341 Digital Forensic\nการสืบสวนของอาชกรรมทางดิจิทัลประเภทต่าง ๆ บทบาทของนักสอบสวน วิธีการในการ\nดำเนินการตรวจพิสูจน์พยาน เครื่องมือทั้งแบบเปิดรหัสและเครื่องมือ Commercial สำหรับการถ่ายภาพ\nและการวิเคราะห์ ระบบจัดเก็บข้อมูลพิสูจน์หลักฐานทางดิจิทัล\nVarious different types of digital crime and investigations, role of an investigator.\nmethodology for performing a digital forensics investigation. open source and\ncommercial tools used for imaging and analysis; low level file system forensics.\nดท.342 การบริหารความต่อเนื่องทางธุรกิจ 3(3-0-6)\nDX342 Business Continuity Management\nการวิเคราะห์ผลกระทบทางธุรกิจ กลยุทธ์การกู้คืน การพัฒนากลยุทธ์ความต่อเนื่องธุรกิจและการ\nกู้คืน การออกแบบและการดำเนินการตามแผน BC การเตรียมพร้อมและการอบรมเตรียมความพร้อม\nBusiness Impact Analysis. Recovery Strategy. Developing Business Continuity (BC)\nand Disaster Recovery Strategy. Design and Implementation of BC Plan. Preparing and\nConducting Preparedness and training Programmes.\nดท.343 ความปลอดภัยของเน็ตเวิร์ก 3(3-0-6)\nDX343 Network Security\nโปรโตคอลการสื่อสารทางเครือข่าย การออกแบบระบบเครื่อข่าย ระบบตรวจสอบและป้องกัน\nการจู่โจม การติดตั้ง Firewall มาตรฐานความปลอดภัย\nNetworking communication protocols. Network design. Intrusion Detection and\nPrevention Systems. Firewall Implementation. Security Standard\nมคอ. 2 หลักสูตรวิทยาศาสตรบัณฑิต สาขาวิชานวัตกรรมและการแปรรูปทำงดจิทัล หน้า 30 ดท.344 โครงสร้างพื้นฐานสำคัญ 3(3-0-6)\nDX344 Critical Infrastructure\nการระบุและวิเคราะห์ระบบโครงสร้างพื้นฐานสำคัญ การประเมินระดับความปลอดภัยและ\nภัยคุกคาม การลดระดับภัยคุกคามเพื่อปกป้องโครงสร้างพื้นฐานสำคัญ\nIdentification and analysis of critical infrastructure systems. Security and threat\nassessments. Mitigation of threats to protect critical infrastructures.\nการฝึกปฏิบัติงาน\nดท.380 การฝึกปฏิบัติงานด้านธุรกิจดิจิทัล 3 (ฝึกงาน 135 ชั่วโมง)\nDX380 Internships for Digital Business\nฝึกปฏิบัติงานภายในองค์กรทางดิจิทัลเพื่อเพิ่มพูนความรู้และทักษะด้านนวัตกรรมและการแปรรูป\nทางดิจิทัลตามความสนใจและความถนัดภายใต้คำแนะนำของอาจารย์ที่ปรึกษา การวัดผลแบ่งออก 2\nระดับ คือ S (ใช้ได้) และ U (ใช้ไม่ได้)\nPracticum in digital organizations in order to enhance students’ knowledge and\nskills for innovation and digita transformation based on learners’ interest and skill\nadvised by advisor. Assessment for internships is graded into 2 grades: S (Satisfactory)\nand U (Unsatisfactory).\nหมวดการแปรรูปดิจิทัล Digital Transformation\nดท.450 เทคโนโลยีอุบัติใหม่และแบบจำลองธุรกิจดิจิทัล 3(3-0-6)\nDX450 Emerging technologies and Digital Business Model\nเทคโนโลยีอุบัติใหม่ที่ทำให้เกิดการเปลี่ยนแปลงครั้งสำคัญที่มีผลต่อการดำเนินธุรกิจ แบบจำลอง\nธุรกิจดิจิทัล ธุรกิจแพลตฟอร์ม การเปลี่ยนสินค้าแพลตฟอร์ม การสร้างนวัตกรรมจากแพลตฟอร์ม\nการเจรจาต่อรองสำรับแพลตฟอร์มสตาร์ทอัพ การปรับเปลี่ยนธุรกิจ การตัดสินใจเกี่ยวกับการเปิด การกิน\nส่วนแบ่งตลาดของตัวเอง และการแข่งขัน\nEmerging technologies that are breakthrough and disruptive technologies in\nbusiness operation. Digital Business Model. Platform Business. Products to platforms\nconversion. Generating platform innovation. Platform startup. Existing businesses\nconversion. Decisions on issues of openness, cannibalization, and competition.\nมคอ. 2 หลักสูตรวิทยาศาสตรบัณฑิต สาขาวิชานวัตกรรมและการแปรรูปทำงดจิทัล หน้า 31 ดท.451 กลยุทธ์การแปรรูปทางดิจิทัล 3(3-0-6)\nDX451 Digital Transformation Strategy\nความสามารถทางดิจิทัล สมรรถนะและการนำด้านดิจิทัล การปรับเปลี่ยนประสบการณ์ลูกค้าด้วย\nเทคโนโลยีดิจิทัล การปรับปรุงกระบวนการภายใน และการปรับเปลี่ยนโมเดลทางธุรกิจ การจัดการ\nการเปลี่ยนแปลงด้านดิจิทัล การมีส่วนร่วมด้านดิจิทัล การสร้างทักษะทางดิจิทัล แพลตฟอร์มทางดิจิทัล\nDigital Capability. Digital Leadership Capability. Digital-Enhanced User Experience.\nInternal Process Improvement. Business Model Transformation. Digital Change\nManagement. Digital Engagement. Digital Skill Creation. Digital Platform.\nดท.452 พฤติกรรมองค์กรในยุคดิจิทัลและภาวะผู้นำความเปลี่ยนแปลง 3(3-0-6)\nDX452 Digital Organizational Behavior and Transformational\nLeadership\nการวางแผนทรัพยากรมนุษย์ การสรรหาและคัดเลือกบุคลากร การประเมินสรรถนะการทำงาน\nการธำรงรักษาบุคลากร กลยุทธ์การจัดการพนักงานสมรรถนะสูง มาตรวัดของภาวะผู้นำความ\nเปลี่ยนแปลง ความจงภักดีและความพึงพอใจของผู้ติดตามผู้นำที่สร้างความเปลี่ยนแปลง ความท้าทายของ\nผู้นำความเปลี่ยนแปลง การเปลี่ยนแปลงวัฒนธรรมองค์กร การพัฒนาผู้นำความเปลี่ยนแปลง\nHuman Resources Planning. Staff recruitment and selection. Performance\nEvaluation. Staff retention. Talent management strategy. The Measurement of\nTransformational leadership. Loyalty and satisfaction of followers of transformational\nleadership. Challenge of Transformational leadership Transformational Organization\nCultures. Development of Transformation Leadership.\nดท.453 การสัมมนาเทคโนโลยีดิจิทัลขั้นสูง 3(3-0-6)\nDX453 Advanced Digital Technology Seminar\nกรณีศึกษาการใช้เทคโนโลยีร่วมสมัยเพื่อการแปรรูปดิจิทัล โดยมุ่งเน้นที่เทคโนโลยีเพื่อส่งเสริม\nประสบการณ์ผู้ใช้ เทคโนโลยีเพื่อสร้างประสิทธิภาพในการดำเนินงาน และเพื่อการเปลี่ยนแปลงรูปแบบ\nการดำเนินธุรกิจ ศึกษาการเปลี่ยนแปลงทางดิจิทัลต่อกลยุทธ์ด้านลูกค้า การแข่งขัน ข้อมูล นวัตกรรม\nและคุณค่า ในอุตสาหกรรมต่าง ๆ\nCase studies for the State of the Art Digital Technology for Transformation that\nfocus on enhancing user experience, improving internal process, and modifying business\nmodel. How digital forces are reshaping five key domains of strategy: customers,\ncompetition, data, innovation, and value in various industries.\nมคอ. 2 หลักสูตรวิทยาศาสตรบัณฑิต สาขาวิชานวัตกรรมและการแปรรูปทำงดจิทัล หน้า 32 ดท.454 โครงงานด้านการแปรรูปทางดิจิทัล 3(3-0-6)\nDX454 Digital Transformation Capstone Project\nการประยุกต์แนวคิดการแปรรูปทางดิจิทัลเพื่อและนำไปสู่การสร้างแนวคิดและการเปลี่ยนแปลง\nใหม่ ๆ ต่อองค์กร และการนำเสนอผลการดำเนินงานแก่ผู้ที่เกี่ยวข้อง\nApply digital transformation concepts and coming up with idea to transform\nbusiness and present the results to stakeholders\nวิชาเลือก\nหมวดการตลาดดิจิทัล Digital Marketing\nดท.465 พฤติกรรมผู้บริโภคในยุคดิจิทัล 3(3-0-6)\nDX465 Digital Consumers Behavior\nแนะนำพฤติกรรมผู้ซื้อ การตัดสินใจของผู้บริโภค พฤติกรรมการซื้อบน E-Commerce การรับรู้\nและความคิดแบบไม่รู้ตัว การเรียนรู้ความทรงจำ และตำแหน่งของสินค้า แรงจูงใจและการมีส่วนร่วม\nการสร้างและการเปลี่ยนแปลงแนวคิด จริยธรรมผู้บริโภค\nIntroduction to buyer behavior. Consumer decision making. E-commerce buying\nbehavior. Perception and unconscious thought. Learning, memory and product\npositioning. Motivation and involvement. Attitude formation and change. Consumer\nethics and misbehavior.\nดท.466 การสร้างแบรนด์และการมีส่วนร่วม 3(3-0-6)\nDX466 Digital Branding and Engagement\nความท้าทายในการบริหารแบรนด์ในโลกดิจิทัล ความสำคัญของเนื้อหาและการกระจายเนื้อหาใน\nช่องทางดิจิทัลต่อการสร้างแบรนด์ ผู้บริโภคยุคดิจิทัล การตลาดโดยใช้เนื้อหา สื่อที่ทำเองและสื่อที่ได้มา\nChallenges of managing a digital brand. Effects of content and digital distribution,\nare integral to brand engagement. The Digital Consumer. Content Marketing. Owned\nMedia Assets. Earned Media.\nดท.467 การบริหารชื่อเสียงในยุคดิจิทัล 3(3-0-6)\nDX467 Digital Reputation Management\nชื่อเสียงองค์กรในยุคดิจิทัล ชื่อเสียงและวัฒนธรรมการมีส่วนร่วม ผลกระทบของโลกออนไลน์ต่อ\nวงจรสื่อ การบริหารชื่อเสียงออนไลน์ การป้องกันชื่อเสียง วิธีการในการบริหารชื่อเสียง\nมคอ. 2 หลักสูตรวิทยาศาสตรบัณฑิต สาขาวิชานวัตกรรมและการแปรรูปทำงดจิทัล หน้า 33 Corporate reputation in the digital age. Reputation and participatory culture. How\nonline has changed the media cycle. Managing reputation online. Protecting a\nReputation. Towards best practice reputation management.\nดท.468 กลยุทธ์การตลาดดิจิทัล 3(3-0-6)\nDX468 Digital Marketing Strategy\nแนะนำการตลาดดิจิทัล การแบ่งกลุ่มและกลยุทธ์การวางตำแหน่ง การบริหารการตลาดดิจิทัล\nเครื่องมือการตลาดดิจิทัล การวัดความสำเร็จการตลาดดิจิทัล พฤติกรรมผู้บริโภคออนไลน์ การวางแผน\nและพัฒนาเว็บไซต์และเนื้อหา การตลาดโดยใช้สื่อสังคมออนไลน์ การวิเคราะห์ข้อมูล\nIntroduction to digital marketing. Segmentation, targeting, differentiation and\npositioning strategies. Digital marketing management. Digital marketing tools. Strategic\ndigital marketing and performance metrics. Online consumer behaviour and psychology.\nPlanning and developing website and content. Social Media Marketing. Digital Analytics.\nดท.469 การบริหารแบรนด์เชิงกลยุทธ์ 3(3-0-6)\nDX469 Strategic Brand Management\nหัวข้อและกลยุทธ์ที่เกี่ยวข้องกับการสร้าง การวัด และการบริหารแบรนด์ การวัดโดยตรงและโดย\nอ้อมของคุณค่าของแบรนด์ โครงสร้างของความรู้เกี่ยวกับแบรนด์ ทางเลือกขององค์ประกอบของแบรนด์\nการพัฒนาโปรแกรมทางการตลาดเพื่อมาสนับสนุนและการบริหารแบรนด์ในระยะยาว\nTopics and various strategies related to building, measuring, and managing a\nbrand. Direct and indirect measures of brand equity. Structures of desired brand\nknowledge. Choice of brand elements. Development of supporting marketing programs\nand management of brands over time.\nหมวดสื่อสร้างสรรค์ Creative Media\nดท.475 พื้นฐานการเขียนโปรแกรมสื่อสร้างสรรค์ 3(3-0-6)\nDX475 Fundamental of Creative Media Programming\nหลักการและการแก้ไขปัญหา การโปรแกรมสื่อสร้างสรรค์แบบโครงสร้าง ไวยากรณ์และ\nความหมายของภาษาโปรแกรม ชนิดข้อมูล การควบคุม ฟังก์ชัน การเวียนเกิด การทดสอบและตรวจหา\nข้อผิดพลาด\nPrinciples and problem solving, creative media structure programming, syntax and\ndefinition of programming language, type of variable, condition, function, recursive,\ntesting and debugging.\nมคอ. 2 หลักสูตรวิทยาศาสตรบัณฑิต สาขาวิชานวัตกรรมและการแปรรูปทำงดจิทัล หน้า 34 ดท.476 เทคโนโลยีดิจิทัลเพื่อการสร้างสรรค์สื่อใหม่ 3(3-0-6)\nDX476 Digital Technology for New Media Creation\nศึกษาหลักการและเทคโนโลยีดิจิทัลทั้งแบบดั้งเดิมและสมัยใหม่ เพื่อนำมาบูรณาการใช้สร้างสรรค์\nสื่อใหม่ โดยผู้เรียนสามารถกำหนดโจทย์งานสร้างสรรค์ขึ้นมาใหม่หรือรับปัญหาจริงจากภาค\nอุตสาหกรรม ภายใต้การชี้แนะของคณาจารย์และผู้เชี่ยวชาญจากธุรกิจและอุตสาหกรรม\nStudy principles and digital technology both traditional and modern style for\nintegration new media creation. Student can define problem by themself or order actual\nproblem from industry under coach suggestion.\nดท.477 ทฤษฎีเกมเพื่องานสื่อสร้างสรรค์ 3(3-0-6)\nDX477 Gamification for Creative Media\nความหมายและประเภทของทฤษฎีเกม กระบวนการและส่วนประกอบเกี่ยวกับเกม\nการจูงใจ การออกแบบ ข้อจำกัด ประเด็น และการตระหนักจากการใช้เกมมิฟิเคชัน\nDefinition and type of gamification, game process and component, motivation\ndesign, limitation, issue and awareness with gamification.\nดท.478 การวิจัยเพื่องานสื่อสร้างสรรค์ 3(3-0-6)\nDX478 Research for Creative Media\nศึกษาหลักการและระเบียบวิธีการวิจัย การกำหนดปัญหา วัตถุประสงค์ ประชากรและกลุ่ม\nตัวอย่าง การทบทวนวรรณกรรมที่เกี่ยวข้อง การออกแบบวิธีดำเนินงานวิจัย การสร้างเครื่องมือสำหรับ\nงานวิจัย การวิเคราะห์ข้อมูลเพื่องานวิจัย การเขียนรายงานและการนำเสนอผลการวิจัย การประยุกต์ใช้\nการวิจัยเพื่องานสื่อสร้างสรรค์\nPrinciples of research methodology; problem defining; research objectives\npopulation and sample literature review; research methodology design; research tool\ndevelopment; data analytic for research; research report and presentation; application of\nresearch for creative media.\nดท.479 โครงงานด้านสื่อสร้างสรรค์ 3(0-9-0)\nDX479 Creative Media Capstone Project\nโครงการเพื่อสร้างงานด้านสื่อสร้างสรรค์และนำไปใช้ในเชิงพาณิชย์ โดยใช้ปัญหาจริงจากภาค\nธุรกิจและอุตสาหกรรม โดยผู้เรียนจะทำงานทีมภายใต้การชี้แนะของคณาจารย์และผู้เชี่ยวชาญจาก\nธุรกิจและอุตสาหกรรม\nมคอ. 2 หลักสูตรวิทยาศาสตรบัณฑิต สาขาวิชานวัตกรรมและการแปรรูปทำงดจิทัล หน้า 35 Applying state of the art creative media in order to solve real world business and\nindustry problems and present the results to stakeholders.\nวิชาเลือกเสรี\nดท.395 นวัตกรรมและผู้ประกอบการ 3(3-0-6)\nDX395 Innovation and Entrepreneurship\nสมรรถนะทางนวัตกรรม กลยุทธ์การสร้างสมรรถนะทางนวัตกรรม อุปสรรคในการพัฒนา\nนวัตกรรม ความพร้อมทางนวัตกรรม การบริหารการเปลี่ยนแปลงจากผลกระทบของนวัตกรรม โครงสร้าง\nองค์กร วัฒนธรรม และลักษณะผู้นำที่นำไปสู่นวัตกรรม การรักษาไว้ซึ่งนวัตกรรม แนวคิดพื้นฐานของ\nเครื่องมือที่ใช้ในการประเมินโอกาส และพัฒนาองค์กรใหม่ และแนวทางการใช้แนวคิดนี้ในการประยุกต์\nกับโอกาสและสถานการณ์ของธุรกิจจริง พัฒนาและสามารถสื่อสารแนวคิดธุรกิจใหม่ ๆ ได้อย่างมี\nประสิทธิภาพ\nInnovation Capability. Strategy for building innovation capacity. Barriers to\ninnovation. Innovation Readiness. Manage Organization Change resulting from\nInnovation. Organization structure, cultures, and leadership for innovation. Sustaining\nInnovation. Fundamental concepts and analytical tools that help assess opportunities\nand develop entrepreneurial ventures, and how these concepts and tools may be\napplied to real world business situations and opportunities. Develop, define and clearly\ncommunicate a new business concept or initiative in an efficient, effective and\ncompelling manner.\nดท.396 เศรษฐศาสตร์และการวิเคราะห์สภาวะทางธุรกิจ 3(3-0-6)\nDX396 Economics and Business Condition Analysis\nหลักการเบื้องตนเกี่ยวกับเศรษฐศาสตรทฤษฏีและการประยุกตใชในการวิเคราะห์สภาวะทาง\nธุรกิจ รวมถึงหนาที่ของเศรษฐกิจในตลาดสมัยใหม เศรษฐศาสตรจุลภาคที่วิเคราะหพฤติกรรมของผู\nบริโภคและธุรกิจ วิเคราะหตลาดและทางเลือกนโยบายที่เกี่ยวของ และเศรษฐศาสตรมหภาคที่เกี่ยวเนื่อง\nกับสภาวะการณทางเศรษฐกิจระดับประเทศ รวมทั้งการคาดการณผลกระทบตอโครงสรางธุรกิจและองค\nกร\nPrinciples of economics; concepts and its application for business condition\nanalysis. Functioning of the modern market economy; microeconomics that analyzing\nthe behavior of consumers and firms; analyzing markets and policy choices that affect\nมคอ. 2 หลักสูตรวิทยาศาสตรบัณฑิต สาขาวิชานวัตกรรมและการแปรรูปทำงดจิทัล หน้า 36 these markets and macroeconomics that concern the national economic conditions\nwhich also encapsulate the impact to business conditions and organization\nดท.397 กฎหมายธุรกิจและเทคโนโลยีสารสนเทศ 3(3-0-6)\nDX397 Business and Information Technology Laws\nหลักการที่สำคัญของกฎหมายเกี่ยวกับธุรกิจและเทคโนโลยีสารสนเทศ เช่น กฎหมายว่าด้วย\nธุรกรรมทางอิเล็กทรอนิกส์ กฎหมายว่าด้วยการกระทำความผิดเกี่ยวกับคอมพิวเตอร์ ผลกระทบของ\nเทคโนโลยีสารสนเทศที่มีต่อการคุ้มครองทรัพย์สินทางปัญญา ปัญหาการใช้บังคับกฎหมายปัจจุบันใน\nสังคมยุคเทคโนโลยีสารสนเทศ ระบบทุน การระดมทุนของบริษัทโดยการออกหลักทรัพย์\nFundamental of Laws on Business and Information Technology such as Laws on\nElectronic Transaction, Computer-Related Crime Bills. Impact of Information technology\non Intellectual Property. Problems on Enforcing Current Laws in Digital Society. Capital\nSystem. Raising Capital though Securities.\nดท.398 การบริหารโครงการ 3(3-0-6)\nDX398 Prooject Management\nความหมายของโครงการ และความสำคัญของการบริหารโครงการ การวางแผนการดำเนินงาน\nของโครงการทางดิจิทัล การสร้างกลุ่มงาน การกำหนดขอบเขต และบทบาทของสมาชิกกลุ่ม การจัด\nกำหนดการ และการกำหนดทรัพยากร การประมาณค่าใช้จ่ายของโครงการ การสร้างแผนงานด้วยตาราง\nปฏิบัติงาน การวางแผนและการกำหนดเวลาโครงการ การวิเคราะห์และการประเมินผลโครงการเพื่อการ\nตัดสินใจและการควบคุม\nProject definition and significance of project management; project planning,\nproject network and role of network’s members. Project resources management. Project\ncost estimation. Project Planning and Scheduling. Project analysis and evaluation for\ndecision making and monitoring Environment. Environment Analysis. Business Strategy.\nMonitoring and Evaluation.\nดท.399 การเงินและบัญชี 3(3-0-6)\nDX399 Accounting and Finance\nหลักการสำคัญของบัญชีการเงิน การวิเคราะห์รายงานทางการเงิน การประเมินประโยชน์ทาง\nการเงิน การตัดสินใจลงทุน การเปรียบเทียบการลงทุนของโครงการ\nKey principles of financial accounting. Analysis of financial statement. Evaluation\nof financial benefits. Investment decision. Comparison of capital investment project.\nมคอ. 2 หลักสูตรวิทยาศาสตรบัณฑิต สาขาวิชานวัตกรรมและการแปรรูปทำงดจิทัล หน้า 37",
    "หมวดที่ 5": "หมวดที่ 5 การจัดกระบวนการเรียนรู้\nลำดับ ผลลัพธ์การเรียนรู้ของหลักสูตร (PLOs) การจัดกระบวนการเรียนรู้วิธีการวัดและประเมินผล\nด้านความรู้ (Knowledge)\nK 1 มีความรู้ความเข้าใจเรื่องแนวคิด ทฤษฎี และหลักการด้าน การบรรยายและการอภิปรายกลุ่ม ประเมินผลจากการแลกเปลี่ยนความ\nนวัตกรรมดิจิทัล คิดเห็นของนักศึกษาในชั้นเรียน\nK 2 มีความรู้ความเข้าใจเรื่องแนวคิดเชิงสร้างสรรค์ หรือการคิดใน การใช้กรณีศึกษาต่าง ๆ ในการฝึกทักษะการวิเคราะห์ การ ประเมินผลจากงานที่ไดรั้บมอบหมาย\nเชิงสร้างสรรค์ สังเคราะห์ข้อมูล ทั้งงานกลุ่มและงานเดี่ยว\nK 3 มีความรู้ความเข้าใจเรื่องการทาวจิัย การศึกษาดูงานเพื่อเรียนรู้จากผู้มปีระสบการณ์ ประเมินผลจากการสอบย่อย (Quiz)\nและการสอบข้อเขียน\nK 4 มีความรู้ความเข้าใจในการนำองค์กรดิจิทัล การเรยีนรู้จากวิทยากรพิเศษและผู้เชี่ยวชาญ ประเมินผลจากการฝึกภาคปฏิบตั ใิน\ncapstone project\nK 5 มีความรู้ความเข้าใจ และสามารถประยุกต์ใช้เทคโนโลยีดิจิทัลใน การมอบหมายงานวิจัย รายงานกลุ่ม รายงานบคุ คล ประเมินผลจากงานที่ไดรั้บมอบหมาย\nการสร้างความได้เปรียบ ทั้งงานกลุ่มและงานเดี่ยว\nการมอบหมายให้อ่านเอกสารประกอบการเรียนล่วงหน้า ประเมินผลจากการฝึกภาคปฏิบตั ใิน\nเพื่ออภิปรายร่วมกันในชั้นเรียน capstone project\nการฝึกภาคปฏิบตัิในการจดัการโครงการ ประเมินผลจากการแลกเปลี่ยนความ\nคิดเห็นของนักศึกษาในชั้นเรียน\nด้านทักษะ (Skills)\nS 1 สามารถคิด วิเคราะห์ปญัหำภายใต้สถานการณต์่าง ๆ ได้อย่าง การใช้กรณีศึกษาต่าง ๆ ในการฝึกทักษะการวิเคราะห์และ ประเมินผลจากคณุ ภาพของผลงานที่\nสร้างสรรค์ การสังเคราะห์ข้อมลู ได้รับมอบหมายทั้งงานกลุ่มและงาน\nเดี่ยว\nมคอ. 2 หลักสูตรวิทยาศาสตรบัณฑิต สาขาวิชานวัตกรรมและการแปรรูปทำงดจิทัล หน้า 38 ลำดับ ผลลัพธ์การเรียนรู้ของหลักสูตร (PLOs) การจัดกระบวนการเรียนรู้วิธีการวัดและประเมินผล\nS 2 สามารถใช้ความรู้ในการแกไ้ขปัญหาเฉพาะหน้าได้อย่างมีการมอบหมายงานค้นคว้าและการนำเสนอรายงานจากการ ประเมินผลจากงานที่ไดรั้บมอบหมาย\nประสิทธภิาพ เหมาะสมกับสถานการณ์ ค้นคว้า ทั้งงานกลุ่มและงานเดี่ยว\nS 3 สามารถพัฒนาและสร้างสรรค์องค์ความรู้ด้านนวตักรรมและการ การฝึกปฏิบัติจริงจากการประยุกต์ใช้ความรู้ในแต่ละ ประเมินผลจากงานที่ไดรั้บมอบหมาย\nแปรรูปดจิทัล รายวิชา ทั้งงานกลุ่มและงานเดี่ยว\nการสร้างและการนำเสนอโครงการจำลอง (Virtual ประเมินผลจากการฝึกปฏิบตัิจริง\nProject) และการสร้างโครงการจำลอง\nS 4 สามารถนำข้อมูลทางที่เกี่ยวข้องมาวิเคราะห์เพื่อประยุกต์ใช้ใน การมอบหมายงานค้นคว้าและการนำเสนอรายงานจากการ ประเมินผลจากงานที่ไดรั้บมอบหมาย\nการจัดการทางดิจิทัลได้อย่างมีประสิทธิภาพ ค้นคว้า ทั้งงานกลุ่มและงานเดี่ยว\nS 5 สามารถวิเคราะห์ข้อมลู ต่าง ๆ ด้านการเงินและการตลาดเพื่อ การมอบหมายงานค้นคว้าและการนำเสนอรายงานจากการ ประเมินผลจากงานที่ไดรั้บมอบหมาย\nประกอบการตัดสินใจในการดำเนนิงานด้านการจัดการทางดิจิทลัค้นคว้า ทั้งงานกลุ่มและงานเดี่ยว\nS 6 สามารถใช้ทักษะทางการสื่อสารได้อย่างชัดเจนและมีการมอบหมายงานค้นคว้าและการนำเสนอรายงานจากการ ประเมินผลจากการนำ เสนอผลงาน\nประสิทธภิาพ ค้นคว้า\nS 7 สามารถประยุกต์ใช้เทคโนโลยสีารสนเทศเพื่อเครื่องมือในการ การฝึกปฏิบัติจริงจากการประยุกต์ใช้ความรู้ในแต่ละ ประเมินผลจากงานที่ไดรั้บมอบหมาย\nจัดการและการสื่อสารข้อมลู ต่าง ๆ ได้อย่างเหมาะสมและมีรายวิชา ทั้งงานกลุ่มและงานเดี่ยว\nประสิทธภิาพ\nด้านจริยธรรม (Ethic)\nE 1 มีความรู้ความเข้าใจเรื่องผลกระทบของดิจิทัลต่อสังคม การบรรยายและการอภิปรายกลุ่ม ประเมินผลจากความรับผดิชอบใน\nงานที่ได้รับมอบหมาย ทั้งงานกลุ่ม\nและงานเดยี่ว\nE 2 มีความรู้และตระหนักในความรับผิดชอบในการใช้เทคโนโลยีการศึกษาดูงานเพื่อเรียนรู้จากหนว่ยงานหรือผู้ที่มีประเมินผลจากผลงานที่ได้รับ\nดิจิทัล ประสบการณ์ มอบหมาย\nมคอ. 2 หลักสูตรวิทยาศาสตรบัณฑิต สาขาวิชานวัตกรรมและการแปรรูปทำงดจิทัล หน้า 39 ลำดับ ผลลัพธ์การเรียนรู้ของหลักสูตร (PLOs) การจัดกระบวนการเรียนรู้วิธีการวัดและประเมินผล\nการมอบหมายงานกลุ่มหรืองานเดยี่ว สังเกตจากแนวความคิดของนักศึกษา\nที่สะท้อนให้เห็นจากงานที่ได้รับ\nมอบหมายและการอภิปรายในชั้น\nเรียน\nด้านลักษณะบุคคล (Character)\nC 1 มีภาวะความผู้นำและผตู้ามในกลุ่ม ตลอดจนการทำงาน การมอบหมายงานกลุ่มเพื่อฝึกการทำงานร่วมกันทีม ประเมินผลจากความรับผดิชอบใน\nร่วมกันทีม งานที่ได้รับมอบหมายทั้งงานกลุ่ม\nและงานเดยี่ว\nC 2 สามารถทำงานร่วมกับผู้อื่นและมมีนุษยสัมพันธ์ที่ดีกับผู้ร่วมงาน การมอบหมายให้อ่านเอกสารประกอบการเรียนล่วงหน้า สังเกตจากการทำงานร่วมกันทีม\nเพื่ออภิปรายร่วมกันในชั้นเรียน การแสดงความคิดเห็น และการ\nอภิปรายในชั้นเรยีน\nC 3 มีความรับผิดชอบในการกระทำของตนเองและรับผิดชอบงาน การฝึกปฏิบัติจริงกลุ่มจากการประยุกต์ใช้ความรู้ในแต่ประเมินผลจากงานที่ไดรั้บมอบหมาย\nกลุ่ม ละรายวิชา ทั้งงานกลุ่มและงานเดี่ยว\nC 4 มีความกล้าในการแสดงความคิดเห็นและการยอมรบัความคดิ เห็น การสร้างและการนำเสนอโครงการจำลอง (Virtual ประเมินผลจากงานค้นคว้า การฝกึ\nของผู้อื่น Project) ปฏิบัติจริง และการสร้างโครงการ\nจำลอง\nมคอ. 2 หลักสูตรวิทยาศาสตรบัณฑิต สาขาวิชานวัตกรรมและการแปรรูปทำงดจิทัล หน้า 40",
    "หมวดที่ 6": "หมวดที่ 6 ความพร้อมและศักยภาพในการบริหารจัดการหลักสูตร\nหลักสูตรมีความพร้อมในด้านต่าง ๆ ตามกฎกระทรวงมาตรฐานการจัดการศึกษาระดับอุดมศึกษา\nพ.ศ.2565 ข้อ 6 ที่ประกอบด้วย 4 ด้าน ได้แก่\n6.1 ด้านกายภาพ\nวิทยาลัยนวัตกรรมมีความพร้อมด้านกายภาพ โดยประกอบด้วยห้องเรียน ห้องอเนกประสงค์\nห้อง Common Room สำหรับนักศึกษา ตามรายละเอียดดังนี้\nรายละเอียด จำนวน\n1. ห้องเรียน ขนาด 60 ที่นั่ง 4 ห้อง\n2. ห้องเรียน ขนาด 100 ที่นั่ง 3 ห้อง\n3. ห้องเรียน ขนาด 170 ที่นั่ง 1 ห้อง\n4. ห้องอเนกประสงค์ Innovative 1 ห้อง\n5. ห้อง Common Room 4 ห้อง\n6. ห้องพักอาจารย์ 9 ห้อง\n7. กล้องวงจรปิด CCTV 38 ตำแหน่ง\n8. แม่บ้านดูแลความสะอาด 3 คน\n9. เจ้าหน้าที่รักษาความปลอดภัย 2 คน\nสำหรับสิ่งอำนวยความสะดวกเพื่อการเรียนรู้นักศึกษาสามารถใช้บริการจากสำนักหอสมุด และ\nห้องสมุดคณะต่าง ๆ ทั้งที่ศูนย์ท่าพระจันทร์และศูนย์รังสิต ซึ่งมีตำรา หนังสือทั้งภาษาไทยและ\nภาษาอังกฤษ วารสารภาษาไทยและภาษาอังกฤษ รวมถึงสื่ออิเล็กทรอนิกส์ต่าง ๆ อย่างพอเพียง ดังนี้\nหนังสือภาษาไทย จำนวน 20,994 เล่ม\nหนังสือภาษาอังกฤษ จำนวน 8,323 เล่ม\nวารสาร จำนวน 82 ชื่อ\n- ภาษาไทย จำนวน 40 ชื่อ\n- ภาษาอังกฤษ จำนวน 42 ชื่อ\nโสตทัศนวัสดุประเภทต่าง ๆ จำนวน 700 ชิ้น\nหนังสือพิมพ์ จำนวน 16 ชื่อ\n- ภาษาไทย จำนวน 14 ชื่อ\n- ภาษาอังกฤษ จำนวน 2 ชื่อ\nฐานข้อมูลออนไลน์ จำนวน 19 ฐาน\nวิทยานิพนธ์อิเล็กทรอนิกส์ของ มธ. จำนวน 13,476 เล่ม\nหนังสือหายากอิเล็กทรอนิกส์ จำนวน 361 เล่ม\nมคอ. 2 หลักสูตรวิทยาศาสตรบัณฑิต สาขาวิชานวัตกรรมและการแปรรูปทำงดจิทัล หน้า 41 นักศึกษาสามารถขอใช้บริการได้ที่หอสมุดแห่งชาติสำนักหอสมุดของมหาวิทยาลัยทุกแห่งใน\nส่วนกลาง ห้องสมุดหรือศูนย์เอกสารของหน่วยงานราชการและเอกชน\n6.2 ด้านวิชาการ\n(จำนวนผลงานวิชาการ สิ่งประดิษฐ์ ผลงานอื่น ๆ ของอาจารย์ประจำหลักสูตร ในรอบ 5 ปีย้อนหลัง)\nสัดส่วนอาจารย์ :\nจำนวนผลงานทางวิชาการ\nผลงาน\nจำนวนอาจารย์\nงานวิจัยหรือ ผลงานทางวิชาการอื่น ๆ รวมผลงาน\nประจำหลักสูตร\nบทความวิจัย (ชิ้น) เช่น ตำรา หนังสือ/ ทาง วิชาการ\n(คน)\nวิจัย อื่น ๆ\nบทความวิชาการอื่น ๆ ทั้งหมด (ชิ้น)\nสิ่งประดิษฐ์ ต้น (ชิ้น)\n1 : 4 1 : 0.6\n20 3 23 5\nรวม 1 : 4.6\n6.3 ด้านการเงินและการบัญชี\n6.3.1 งบอุดหนุนจากคณะ/มหาวิทยาลัย\nวิทยาลัยนวัตกรรมหน่วยงานเงินรายได้การจัดสรรงบประมาณสำหรับหลักสูตรในการบริหาร\nจัดการมาจากเงินรายได้ 100%\n6.3.2 ทุนสนับสนุนการศึกษาอาจารย์และนักศึกษา\nวิทยาลัยนวัตกรรมมีการสนับสนุนทุนประเภทต่าง ๆ สำหรับอาจารย์และนักศึกษา จากกองทุน\n3 ประเภท ดังนี้\n1) กองทุนค่าธรรมเนียมเพื่อการพัฒนาการศึกษา\n2) กองทุนการศึกษาวิทยาลัยนวัตกรรม\n3) กองทุนวิจัยวิทยาลัยนวัตกรรม\n6.3.3 ประมาณการรายได้และค่าใช้จ่ายนักศึกษาของหลักสูตร\nการประมาณการรายได้ของวิทยาลัยกำหนดตามจำนวนเป้ารับนักศึกษาที่กำหนดใน มคอ.2 โดย\nค่าใช้จ่ายแบ่ง ค่าใช้จ่ายคงที่ และค่าใช้จ่ายผันแปร ตามรายละเอียดดังนี้\nปี 2567 ปี 2568 ปี 2569 ปี 2570 ปี 2571\nงบประมาณรายรับ\nต.ค. 66 - ก.ย. 67 ต.ค. 67 - ก.ย. 68 ต.ค. 68 - ก.ย. 69 ต.ค. 69 - ก.ย. 70 ต.ค. 70 - ก.ย. 71\n1 ค่าสมัครสอบ - - - - -\n2 ค่าหน่วยกิต 1,620,000 4,989,600 8,197,200 11,404,800 12,862,800\n3 ค่าธรรมเนียมพิเศษ 1,200,000 3,480,000 5,640,000 7,962,000 9,042,000\n4 ค่าธรรมเนียมการศึกษา 533,100 1,271,370 1,953,870 2,663,160 3,020,370\nรวมรายรับทั้งสิ้น 3,353,100 9,740,970 15,791,070 22,029,960 24,925,170\nมคอ. 2 หลักสูตรวิทยาศาสตรบัณฑิต สาขาวิชานวัตกรรมและการแปรรูปทำงดจิทัล หน้า 42 งบประมาณรายจ่าย ปี 2567 ปี 2568 ปี 2569 ปี 2570 ปี 2571\nค่าใช้จ่ายคงที่ต.ค. 66 - ก.ย. 67 ต.ค. 67 - ก.ย. 68 ต.ค. 68 - ก.ย. 69 ต.ค. 69 - ก.ย. 70 ต.ค. 70 - ก.ย. 71\n1. ค่าตอบแทนบุคลากร 5,950,000 5,950,000 5,950,000 5,950,000 5,950,000\n2. ค่าใช้สอย 3,470,000 3,470,000 3,470,000 3,470,000 3,470,000\n3. ค่าวัสดุ 770,000 770,000 770,000 770,000 770,000\n4. ค่าใช้จ่ายเบ็ดเตลด็ 200,000 200,000 200,000 200,000 200,000\nรวมค่าใช้จ่ายคงที่ทั้งสิ้น 10,390,000 10,390,000 10,390,000 10,390,000 10,390,000\nงบประมาณรายจ่าย ปี 2567 ปี 2558 ปี 2569 ปี 2570 ปี 2571\nค่าใช้จ่ายผันแปร ต.ค. 66 - ก.ย. 67 ต.ค. 67 - ก.ย. 68 ต.ค. 68 - ก.ย. 69 ต.ค. 69 - ก.ย. 70 ต.ค. 70 - ก.ย. 71\n1. ค่าบำรุงมหาวิทยาลัย\n- ค่าหน่วยกิต (นำส่ง 15%) 243,000 748,440 1,229,580 1,710,720 1,929,420\n- ค่าธรรมเนยีมพิเศษ (นำส่ง\n180,000 522,000 846,000 1,194,300 1,356,300\n15%)\n2. ค่าธรรมเนียมการศึกษา\n317,100 644,970 938,670 1,259,160 1,421,970\nนำส่ง 100%\n3. ค่าใช้จ่ายในการ\n150,000 150,000 150,000 150,000\nปฐมนิเทศ 150,000\n4. ค่าจัดทำเอกสาร\n60,000 300,000 420,000 480,000\nประกอบการสอน 120,000\n5. ค่าใช้จ่ายในการปัจฉิม\n- - - - 120,000\nนิเทศ\nรวมค่าใช้จ่ายผันแปรทั้งสิ้น 1,166,100 2,811,810 4,479,450 6,138,180 7,056,090\nค่าใช้จ่ายต่อหัวนักศึกษาตลอดระยะเวลาหลักสูตร 4 ปีคือ 447,615 บาทต่อคน โดยมีการบริหาร\nจัดการโครงการบริการการศึกษา (เพื่อรับปริญญา) (โครงการพิเศษ) นักศึกษามีค่าใช้จ่ายหลักได้แก่\nค่าหน่วยกิต ๆ ละ 1,800 บาท และค่าธรรมเนียมอื่น ๆ ของวิทยาลัยนวัตกรรม รายละเอียดดังนี้\nค่าธรรมเนียมพิเศษ ภาคการศึกษาปกติภาคฤดูร้อน\nสำหรับนักศึกษาไทย (เก็บทุกภาค) 20,000 บาท 3,000 บาท\nสำหรับนักศึกษาต่างชาติ (เก็บทุกภาค) 20,000 บาท 3,000 บาท\nทั้งนี้ค่าใช้จ่ายต่อหัวนักศึกษาตลอดระยะเวลาหลักสูตรนี้ยังไม่รวมค่าใช้จ่ายในการศึกษาดูงาน\nต่างประเทศ\nมคอ. 2 หลักสูตรวิทยาศาสตรบัณฑิต สาขาวิชานวัตกรรมและการแปรรูปทำงดจิทัล หน้า 43 6.4 ด้านการบริหารจัดการ\nปัจจุบันวิทยาลัยนวัตกรรมมีบุคลากรสายวิชาการ สายสนับสนุนวิชาการ จำนวน 59 คน ตาม\nรายละเอียดดังนี้\n6.4.1 จำนวนอาจารย์ (ประจำ/พิเศษ)\nพนักงานมหาวิทยาลัย (ส่วนงาน) พนักงานเงินรายได้\n22 คน 8 คน\n6.4.2 จำนวนเจ้าหน้าที่\nพนักงานมหาวิทยาลัย (ส่วนงาน) พนักงานเงินรายได้\n27 คน 2 คน\n6.4.3 กำกับดูแลและประเมินผล\nหลักสูตรมีการกำกับดูแลและประเมินผลของการดำเนินงานโดยคณะกรรมการบริหารหลักสูตร\nประกอบด้วย ผู้อำนวยการหลักสูตร และอาจารย์ประจำหลักสูตร โดยจะมีการประชุมร่วมกันเพื่อหารือ\nประเด็นต่าง ๆ และประเมินผลการดำเนินงานที่ผ่านมา อย่างน้อยภาคการศึกษาละ 2 ครั้ง นอกจากนั้น\nวิทยาลัยนวัตกรรมมีคณะกรรมการบริหารวิชาการ และทำนุบำรุงศิลปะวัฒนธรรม ซึ่งกรรมการ\nประกอบด้วย คณบดีรองคณบดีผู้อำนวยการหลักสูตรทุกหลักสูตร ประชุมหารือในเรื่องต่าง ๆ ประจำ\nทุก ๆ 2 เดือน ซึ่งการติดตามประเมินผลการดำเนินงานของแต่ละหลักสูตร และเปิดโอกาสให้มีเวที\nในการหารือนโยบาย แนวปฏิบัติ และประเด็นร่วมต่าง ๆ ระหว่างหลักสูตร\nมคอ. 2 หลักสูตรวิทยาศาสตรบัณฑิต สาขาวิชานวัตกรรมและการแปรรูปทำงดจิทัล หน้า 44 6.5 อาจารย์ผู้รับผิดชอบหลักสูตรและอาจารย์ประจำหลักสูตร\nตำแหน่งทาง สำเร็จการศึกษาจาก\nลำดับที่ชื่อ - สกุล คุณวุฒิสาขาวิชา\nวิชาการ สถาบัน ปีพ.ศ.\n1. ผู้ช่วย นพพล ตั้งจิตพรหม ปร.ด. การเงิน สถาบนับัณฑิตพัฒนบริหารศาสตร์ 2556\nศาสตราจารย์ วท.ม. เทคโนโลยสีารสนเทศ สถาบนั เทคโนโลยีพระจอมเกล้า 2549\nธนบุรี\nB.B.A. Finance & Banking Assumpition University, 2546\nInternational Business Thailand\nManagement\n2. อาจารย์ อำพล ตังคนาวนชิย์ Ph.D. Electrical Engineering Osaka University, Japan, 2545\nM.Eng Electrical Engineering Osaka University, Japan 2542\nวศ.บ. วิศวกรรมไฟฟ้า จุฬาลงกรณ์มหาวิทยาลัย 2538\n3. อาจารย์ ปรีชญา ชวลิตธำรง M.P.S. Real Estate Cornell University, USA 2552\nสถ.บ. สาขาวชิาสถาปัตยกรรม จุฬาลงกรณ์มหาวิทยาลัย 2549\n4. อาจารย์ จิรพล ทับทิมหิน M.Eng Construction Management Asian Institute of Technology 2527\nวศ.บ. วิศวกรรมโยธา มหาวิทยาลยัขอนแก่น 2519\n5. อาจารย์ พชรพร พิจารณากุล M.B.A. Global Business มหาวิทยาลยับูรพา 2558\nManagement (ASEAN)\nB.B.A. Tourism & Hotel มหาวิทยาลยับูรพา 2555\nManagement\n(ระบุอาจารย์ผู้รับผิดชอบหลักสูตรและอาจารย์ประจำหลักสูตรอย่างน้อย 5 คน กรณีจบการศึกษาต่างประเทศให้ใช้ภาษาอังกฤษ และระบุประเทศในช่องสถาบันด้วย อาจารย์ประจำหลักสูตรต้องมีคุณวุฒิตรงหรือสัมพันธ์กับสาขาวิชาที่เปิดสอนโดยให้มีคุณวุฒิและ\nจำนวนสอดคล้องกับเกณฑ์มาตรฐานหลักสูตร)\nมคอ. 2 หลักสูตรวิทยาศาสตรบัณฑิต สาขาวิชานวัตกรรมและการแปรรูปทำงดจิทัล หน้า 45",
    "หมวดที่ 7": "หมวดที่ 7 การประเมินผลการเรียนและเกณฑ์การสำเร็จการศึกษา\n7.1 การประเมินผลการเรียนของนักศึกษา\nการประเมินผลการเรียน ให้ไปตามข้อบังคับมหาวิทยาลัยธรรมศาสตร์ ว่าด้วยการศึกษาระดับ\nปริญญาตรีพ.ศ. 2561 หมวดที่ 8 และหมวดที่ 9\n7.1.1 การวัดผลการศึกษา แบ่ง 8 ระดับ มีชื่อและค่าระดับต่อหนึ่งหน่วยกิตดังต่อไปนี้\nระดับ A B+ B C+ C D+ D F\nค่าระดับ 4.00 3.50 3.00 2.50 2.00 1.50 1.00 0.00\n7.1.2 การวัดผลการศึกษาวิชา ดท.380 การฝึกปฏิบัติงานด้านธุรกิจดิจิทัล แบ่งออก 2 ระดับ คือ\nS (ใช้ได้) และระดับ U (ใช้ไม่ได้)\n7.2 เกณฑ์การสำเร็จการศึกษาตามหลักสูตร\n7.2.1 สอบผ่านและได้รับหน่วยกิตสะสมรายวิชาครบตามโครงสร้างหลักสูตร และมีหน่วยกิตสะสม\nไม่น้อยกว่า 129 หน่วยกิต\n7.2.2 ได้ค่าระดับเฉลี่ยสะสมไม่ต่ำกว่า 2.00 (จากระบบ 4 ระดับคะแนน)\n7.2.3 ได้ค่าระดับ S (ใช้ได้) ในรายวิชา ดท.380 การฝึกปฏิบัติงานด้านธุรกิจดิจิทัล\n7.2.4 ตอ้งปฏิบัติตามเงื่อนไขอื่น ๆ ที่วิทยาลัยนวัตกรรมและมหาวิทยาลัยธรรมศาสตร์กำหนด\nมคอ. 2 หลักสูตรวิทยาศาสตรบัณฑิต สาขาวิชาการแปรรูปธุรกจิทางดิจิทัล หน้า 46",
    "หมวดที่ 8": "หมวดที่ 8 การประกันคุณภาพหลักสูตร\nหลักสูตรใช้ระบบประกันคุณภาพการศึกษาตามที่สภามหาวิทยาลัยกำหนด\nหมวดที่ 9 ระบบและกลไกในการพัฒนาหลักสูตร\n9.1 ผลการรับฟังความคิดเห็นจากผู้ใช้บัณฑิต ผู้เรียน และนักเรียนที่ต้องการเข้าศึกษาในหลักสูตร\nหลักสูตรให้ความสำคัญกับการรับฟังความคิดเห็นจากผู้เรียนและลูกค้ากลุ่มอื่น ๆ โดยผลที่ได้จาก\nการรับฟังเสียงจากภาคส่วนต่าง ๆ ทำให้ได้ข้อมูลที่นำไปสู่การพัฒนาหลักสูตร การปรับปรุง\nกระบวนการเรียนการสอน การพัฒนาบริการด้านการศึกษา การกำหนดนโยบายการสนับสนุนการวิจัย\nและการจัดบริการวิชาการแก่สังคมและชุมชน โดยในแต่ละปีจะดำเนินการสำรวจความคิดเห็นจากผู้ที่\nเกี่ยวข้องต่าง ๆ ดังนี้\nแหล่งข้อมูล ประเภทข้อมูล วิธีการได้มาซึ่งข้อมูล การใช้ประโยชน์\nนักศึกษา ความพึงพอใจ ไม่พึงพอใจและ - แบบประเมินรายวิชา ใช้เพื่อการปรับปรุงหลักสูตร\nข้อคิดเห็นต่อหลักสูตร การจัดการ - แบบประเมินการสอน และจัดการเรียนการสอน\nเรียนการสอน สภาพแวดล้อม - นักศึกษาพบผู้บริหาร\nทางการศึกษา อาจารย์ผู้สอน - ช่องทางการสื่อสารอื่นๆ\nรูปแบบการสอนของผู้สอน สิ่ง เช่น เพจ facebook\nสนับสนุนการเรียนรู้ระบบการ คณะกรรมการนักศึกษา\nพัฒนานักศึกษา ต้น\nผู้ใช้บัณฑิต ความพึงพอใจต่อคุณภาพบัณฑิต - แบบประเมินผลการใช้หลักสูตรใช้ข้อมูลเพื่อการ\nงานบัณฑิต ปรับปรุงหลักสูตร และการ\nจัดกระบวนการเรียนการ\nสอน\nศิษย์เก่า ข้อเสนอแนะการจัดการเรียนการ - แบบสำรวจข้อมูลสำหรับ หลักสูตรใช้ข้อมูลเพื่อการ\nสอนแหล่งฝึกประสบการณ์ ศิษย์เก่า ปรับปรุงหลักสูตร และการ\nทุนการศึกษา จัดกระบวนการเรียนการ\nและความต้องการพัฒนาตนเอง สอนแหล่งฝึกงาน\nทุนการศึกษา และการ\nพัฒนาศิษย์เก่าตลอดชีพ\nผู้ปกครอง ข้อเสนอแนะการจัดการเรียนการ - แบบประเมิน/สำรวจ เพื่อการปรับปรุงหลักสูตร\nสอน ความพึงพอใจผู้ปกครอง และการจัดกระบวนการ\nมคอ. 2 หลักสูตรวิทยาศาสตรบัณฑิต สาขาวิชาการแปรรูปธุรกจิทางดิจิทัล หน้า 47",
    "หมวดที่ 9": "หมวดที่ 8 การประกันคุณภาพหลักสูตร\nหลักสูตรใช้ระบบประกันคุณภาพการศึกษาตามที่สภามหาวิทยาลัยกำหนด\nหมวดที่ 9 ระบบและกลไกในการพัฒนาหลักสูตร\n9.1 ผลการรับฟังความคิดเห็นจากผู้ใช้บัณฑิต ผู้เรียน และนักเรียนที่ต้องการเข้าศึกษาในหลักสูตร\nหลักสูตรให้ความสำคัญกับการรับฟังความคิดเห็นจากผู้เรียนและลูกค้ากลุ่มอื่น ๆ โดยผลที่ได้จาก\nการรับฟังเสียงจากภาคส่วนต่าง ๆ ทำให้ได้ข้อมูลที่นำไปสู่การพัฒนาหลักสูตร การปรับปรุง\nกระบวนการเรียนการสอน การพัฒนาบริการด้านการศึกษา การกำหนดนโยบายการสนับสนุนการวิจัย\nและการจัดบริการวิชาการแก่สังคมและชุมชน โดยในแต่ละปีจะดำเนินการสำรวจความคิดเห็นจากผู้ที่\nเกี่ยวข้องต่าง ๆ ดังนี้\nแหล่งข้อมูล ประเภทข้อมูล วิธีการได้มาซึ่งข้อมูล การใช้ประโยชน์\nนักศึกษา ความพึงพอใจ ไม่พึงพอใจและ - แบบประเมินรายวิชา ใช้เพื่อการปรับปรุงหลักสูตร\nข้อคิดเห็นต่อหลักสูตร การจัดการ - แบบประเมินการสอน และจัดการเรียนการสอน\nเรียนการสอน สภาพแวดล้อม - นักศึกษาพบผู้บริหาร\nทางการศึกษา อาจารย์ผู้สอน - ช่องทางการสื่อสารอื่นๆ\nรูปแบบการสอนของผู้สอน สิ่ง เช่น เพจ facebook\nสนับสนุนการเรียนรู้ระบบการ คณะกรรมการนักศึกษา\nพัฒนานักศึกษา ต้น\nผู้ใช้บัณฑิต ความพึงพอใจต่อคุณภาพบัณฑิต - แบบประเมินผลการใช้หลักสูตรใช้ข้อมูลเพื่อการ\nงานบัณฑิต ปรับปรุงหลักสูตร และการ\nจัดกระบวนการเรียนการ\nสอน\nศิษย์เก่า ข้อเสนอแนะการจัดการเรียนการ - แบบสำรวจข้อมูลสำหรับ หลักสูตรใช้ข้อมูลเพื่อการ\nสอนแหล่งฝึกประสบการณ์ ศิษย์เก่า ปรับปรุงหลักสูตร และการ\nทุนการศึกษา จัดกระบวนการเรียนการ\nและความต้องการพัฒนาตนเอง สอนแหล่งฝึกงาน\nทุนการศึกษา และการ\nพัฒนาศิษย์เก่าตลอดชีพ\nผู้ปกครอง ข้อเสนอแนะการจัดการเรียนการ - แบบประเมิน/สำรวจ เพื่อการปรับปรุงหลักสูตร\nสอน ความพึงพอใจผู้ปกครอง และการจัดกระบวนการ\nมคอ. 2 หลักสูตรวิทยาศาสตรบัณฑิต สาขาวิชาการแปรรูปธุรกจิทางดิจิทัล หน้า 47 แหล่งข้อมูล ประเภทข้อมูล วิธีการได้มาซึ่งข้อมูล การใช้ประโยชน์\nเรียนการสอน\nการวิจัย ความต้องการของแหล่งทุนภายนอก - แบบสำรวจ เพื่อวางแผนและมอบหมาย\nโดยสอดคล้องต่อองค์ความรู้ใน - การประชุมร่วม งานที่สอดคล้องกับความ\nลักษณะพหุวิทยาการของแต่ละ เชี่ยวชาญของหลักสูตร\nหลักสูตร\nการบริการ ความต้องการของผู้ขอรับบริการ - แบบสำรวจ เพื่อวางแผนและมอบหมาย\nวิชาการ โดยสอดคล้องกับองค์ความรู้ใน - การประชุมร่วม งานที่สอดคล้องกับความ\nลักษณะพหุวิทยาการของแต่ละ เชี่ยวชาญของหลักสูตร\nหลักสูตร\nผลการสำรวจความคิดเห็นของภาคส่วนต่าง ๆ มีข้อสังเกต ข้อเสนอแนะ ดังนี้\n หลักสูตรมคีวามหลากหลายและสอดคล้องกับทักษะที่จำโดยเฉพาะทักษะด้านดิจิทัล และ\nควรเพิ่มเติมทักษะบางส่วน ได้แก่ด้าน UX/UI แนวคิดการทำงานแบบ Agile ต้น\n รายวิชาศึกษาทั่วไปที่เคยกำหนดไว้วิชาด้านสังคมและทั่วไปหลัก อยากให้กำหนด\nรายวิชาศึกษาทั่วไปที่เกี่ยวข้องกับด้านดิจิทัล หรือทักษะที่ใช้ในการวิเคราะห์มากขึ้น\n เพิ่มเติมการพาไปศึกษาดูงาน เพื่อให้ได้รับรู้ถึงประสบการณ์จริงในการทำงานมากยิ่งขึ้น\n9.2 การวิเคราะห์ความเสี่ยงและผลกระทบภายนอก\nหลักสูตรวิทยาศาสตรบัณฑิต สาขาวิชานวัตกรรมและการแปรรูปทางดิจิทัล เผชิญกับปัจจัย\nภายนอกที่ก่อให้เกิดผลกระทบต่อการบริหารหลักสูตร ประกอบไปด้วย อัตราการเกิดในประเทศไทย\nไทยต่ำลง การก้าวเข้าสู่สังคมผู้สูงอายุ ความนิยมในการเรียนเพื่อรับปริญญาลดลง ความนิยมในการ\nเรียนหลักสูตรระยะสั้นและหลักสูตรแบบไม่รับปริญญาเพิ่มขึ้น ความนิยมในการเรียนผ่านช่องทาง\nออนไลน์เพิ่มขึ้นโดยเฉพาะหลักสูตรจากมหาวิทยาลัยในต่างประเทศ\nแม้ว่าหลักสูตรวิทยาศาสตรบัณฑิต สาขาวิชานวัตกรรมและการแปรรูปทางดิจิทัล ยังคงสามารถ\nรับนักศึกษาไปตามเป้าหมายส่งผลให้ยังสามารถจัดการหลักสูตรได้คุ้มกับต้นทุน อย่างไรก็ตาม\nหลักสูตรกลับเผชิญกับสภาวะที่มีจำนวนผู้สมัครจำนวนลดลงส่งผลให้ขาดโอกาสในการคัดเลือกผู้เรียน\nที่เหมาะสมกับปรัชญาของหลักสูตร หลักสูตร ฯ จึงต้องทำการแสวงหาตลาดใหม่ประกอบไปด้วย การ\nคัดเลือกนักศึกษาต่างชาติเพื่อควบคุมความเสี่ยงเกี่ยวกับอัตราการเกิดที่ลดลงและการก้าวเข้าสู่สังคม\nผู้สูงอายุโดยทำการขยายส่วนตลาด (Market Segmentation) ไปยังผู้เรียนในนานาชาติการจัดการ\nเรียนการสอนในลักษณะ Accredited ทั้งในรูปแบบ Offline และรูปแบบ Online เพื่อควบคุมความ\nเสี่ยงในเรื่องของความนิยมในการเรียนหลักสูตรระยะสั้นและหลักสูตรแบบไม่รับปริญญา\nมคอ. 2 หลักสูตรวิทยาศาสตรบัณฑิต สาขาวิชาการแปรรูปธุรกจิทางดิจิทัล หน้า 48 9.3 ผลการดำเนินงานของหลักสูตร/ผลการประกันคุณภาพการศึกษา\nหลักสูตรวิทยาศาสตรบัณฑิต สาขาวิชานวัตกรรมและการแปรรูปทางดิจิทัล มีวัตถุประสงค์เพื่อ\nผลิตบัณฑิตให้มีคุณภาพภายใต้การควบคุมกำกับมาตรฐานตามประกาศคณะกรรมการมาตรฐานการ\nอุดมศึกษา เรื่อง เกณฑ์มาตรฐานหลักสูตรระดับปริญญาตรีพ.ศ. 2565 โดยในแต่ละปีวิทยาลัยมีการ\nแต่งตั้งคณะกรรมการประเมินคุณภาพการศึกษาภายในระดับหลักสูตร เพื่อตรวจสอบผลการ\nดำเนินงานของหลักสูตรในแต่ละปี โดยผลการดำเนินงานของหลักสูตรย้อนหลัง 3 ปีการศึกษา มีดังนี้\nหลักสูตร ปีการศึกษา 2562 ปีการศึกษา 2563 ปีการศึกษา 2564\ndX 3.44 4.00 3.72\n9.4 จัดทำแผนปรับปรุงและพัฒนาหลักสูตร\nการพัฒนาหลักสูตร วิธีการดำเนินการ\nจุดเด่น\n1. การพัฒนาศักยภาพของหลักสูตรเพื่อเพิ่มพูนความรู้ 1. การส่งเสริมคณาจารย์และนักศึกษาเข้าร่วมการ\nและประสบการณ์ ฝึกอบรมหรือประชุมวิชาการทั้งในระดับ ประเทศ\nและระดับนานาชาติ\n2. การส่งเสริมคณาจารย์และนักศึกษาเข้าร่วมการ\nแข่งขันในระดับชาติและนานาชาติ\nจุดด้อย\n1. การทำการตลาดและการประชาสัมพันธ์เชิงรุก 1. การศึกษากลุ่มเป้าหมายของหลักสูตร การเจาะ\n2. การส่งเสริมการแลกเปลี่ยนนักศึกษา ขาเข้า - ขา ตลาดกลุ่มเป้าหมายโดยใช้เทคนิคการตลาดเชิงรุก\nออก การจัดการประชาสัมพันธ์ที่มีประสิทธิภาพ\nสอดคล้องกับกลุ่มเป้าหมาย การจัดสัมมนาวิชาการ\nการฝึกอบรม\n2. การสนับสนุนให้ให้นักศึกษาเข้าร่วมโครงการ\nแลกเปลี่ยนนักศึกษา ขาเข้า - ขาออก\nมคอ. 2 หลักสูตรวิทยาศาสตรบัณฑิต สาขาวิชาการแปรรูปธุรกจิทางดิจิทัล หน้า 49 ภาคผนวก\nภาคผนวก 1 ผลงานทางวิชาการ (ย้อนหลัง 5 ปี) ของอาจารย์ผู้รับผิดชอบหลักสูตรและอาจารย์\nประจำหลักสูตร (ถ้ามี)\n1. ผู้ช่วยศาสตราจารย์ ดร.นพพล ตั้งจิตพรหม\nผลงานวิจัยที่หน่วยงานหรือองค์กรระดับชาติว่าจ้างให้ดำเนินการ : 1.00\nนพพล ตั้งจิตพรหม (2565). โครงการวิจัยเรื่อง จ้างที่ปรึกษาเพื่อพัฒนาเครื่องมือบนช่องทางออนไลน์ เพื่อ\nใช้ในการสำรวจประเด็นที่เกี่ยวข้องกับสื่อในมิติต่างๆ. (ทุนกองทุนพัฒนาสื่อปลอดภัยและ\nสร้างสรรค์)\nนพพล ตั้งจิตพรหม (2565). โครงการวิจัยเรื่อง จ้างที่ปรึกษาเพื่อทบทวนและจัดทำแผนปฏิบัติการ 20 ปี /\n5 ปี (พ.ศ. 2566/2570) ของ สำนักงานพัฒนาเศรษฐกิจจากฐานชีวภาพ (องค์การมหาชน). (ทุน\nสำนักงานพัฒนาเศรษฐกิจจากฐานชีวภาพ (องค์การมหาชน), สพภ)\nนพพล ตั้งจิตพรหม (2565). โครงการวิจัยเรื่อง วิจัยทางการตลาดเพื่อ ข้อมูลสนับสนุนคุณค่าของแบ\nรนด์ บริษัทหลักทรัพย์ จีเอ็มโอ-แซด คอม (ประเทศไทย) จำกัด (มหาชน). (ทุนบริษัทหลักทรัพย์\nจีเอ็มโอ-แซด คอม (ประเทศไทย) จำกัด (มหาชน))\nบทความวิจัยหรือบทความวิชาการฉบับสมบูรณ์ที่ตีพิมพ์ในวารสารวิชาการระดับนานาชาติที่\nปรำกฎในฐานข้อมูลระดับนานาชาติตามประกาศ ก.พ.อ. หรือระเบียบคณะกรรมการการอุดมศึกษา\nว่าด้วยหลักเกณฑ์การพิจารณาวารสารทางวิชาการสำหรับการเผยแพร่ผลงานทางวิชาการ พ.ศ.2556\n: 1.00 (SCOPUS)\nYooyanyong, P., Suwanragsa, I., Tangjitprom, N. (2020). The accuracy of various value\ndrivers of price multiple method in determining equity price. Journal of Asian\nFinance, Economics and Business, 7(1), pp. 29-36\nบทความวิจัยหรือบทความวิชาการฉบับสมบูรณ์ที่ตีพิมพ์ในวารสารวิชาการระดับนานาชาติที่ไม่\nอยู่ในฐานข้อมูล ตามประกาศ ก.พ.อ. หรือระเบียบคณะกรรมการการอุดมศึกษาว่าด้วย หลักเกณฑ์การ\nพิจารณาวารสารทางวิชาการสำหรับการเผยแพร่ผลงานทางวิชาการ พ.ศ.2556 แต่สถาบันนำเสนอสภา\nสถาบันอนุมัติและจัดทำประกาศให้ทราบการทั่วไป และแจ้งให้ก.พ.อ./กกอ. ทราบภายใน 30\nวันนับแต่วันที่ออกประกาศ (ซึ่งไม่อยู่ใน Beall’s list) หรือตีพิมพ์ในวารสารวิชาการที่ปรำกฎใน\nฐานข้อมูล TCI กลุ่มที่ 1 : 0.80\nดนัย ลิขิตรัตน์เจริญ, นพพล ตั้งจิตพรหม, รติกร ชื่นสุขสมบูรณ์. (2565). อิทธิพลของลำดับที่มีต่อความ\nตั้งใจที่จะซื้อ กรณีศึกษาโดยใช้แนวคิดเมนูอาหารใหม่. วารสารธรรมศาสตร์ ปีที่ 41 ฉบับที่ 2\nพ.ค.-ส.ค. พ.ศ.2565 (หน้า 211-222)\nมคอ. 2 หลักสูตรวิทยาศาสตรบัณฑิต สาขาวิชาการแปรรูปธุรกจิทางดิจิทัล หน้า 50 Joungrattanakamjorn, W., & Tangjitprom, N. (2019). Determinants of Relative Risk Aversion\n: The case of Thai High Net Worth Investor. Business Review Journal, 11 (2),\npp.135-156.\nYooyanyong P, Tangjitprom N, Suwanragsa I. (2019). Valuation Accuracy Using Price\nMultiple in Thailand. WMS Journal of Management, Vol. 8 No. 4 October -\nDecember 2019, pp.17-26\nPokavattana N, Sethjinda T, Tangjitprom N. (2019). The Over-Reaction Effect in the Stock\nExchange of Thailand: An Empirical Study. Journal of Community Development\nResearch, Vol 12 No 3 July-September 2019, pp.92-106\nTangjitprom N, Romprasert S. (2019). Community and Renewable Energy Economic and\nManagement. Asian Administration & Management Review, Vol. 2, No. 1, January-\nJune 2019, pp.177-187\nJYao J, Tangjitprom N. (2019). Herding Behaviors in ASEAN Stock Markets. Journal of\nEconomics and Management Strategy, Vol. 6, No. 1 January-June 2019, pp.19-34\nSuwanragsa I, Srivalosakul P, Tangjitprom N. (2018). An Integrative Model of Factors\nInfluencing Debt Burden: A Mediating Role of Money Management in Thai Society.\nMFU Connation, Vol. 7 No. 2 July-December 2018, pp.223-250\nSrivalosakul P, Suwanragsa I, Tangjitprom N. (2018). More Knowledge, More Experience,\nLess Debt? The Mediating Role of Money Management on the Effects of Financial\nKnowledge and Experience on Consumer Debt. Asian Administration and\nManagement Review, Vol. 1 No. 2 (July-December 2018) pp.17-30\nInta-iad W, Tangjitprom N. (2018). The Role of Innovation on Thailand's Vehicle Export\nValue. ASEAN Journal of Management & Innovation, Vol. 5. No.1, pp.235-246\nบทความวิจัยหรือบทความวิชาการฉบับสมบูรณ์ที่ตีพิมพ์ในวารสารวิชาการที่ปรำกฎใน\nฐานข้อมูล TCI กลุ่มที่ 2 : 0.60\nJieni Ma, Luyi Yang, Mai Aye Aye Aung, Nopphon Tangjitpprom, Mayuree Aryupong. (2022).\nA Study of Online Reviewers' Behavior in China on Tall and JD Platform. วารสาร\nนานาชาติมหาวิทยาลัยขอนแก่น สาขามนุษยศาสตร์และสังคมศาสตร์ ปีที่ 12 ฉบับที่ 2\nพฤษภาคม-สิงหาคม 2565\nPoomontre Kasemsant J, Ratanasawadwat N, Tangjitprom N, (2021). Determinant\nAttributes of Customer Satisfaction on Organic Rice in Thailand: A Comparison of\nMethods. APHEIT International Journal, 10 (1), 21 June 2021. pp.19-29\nมคอ. 2 หลักสูตรวิทยาศาสตรบัณฑิต สาขาวิชาการแปรรูปธุรกจิทางดิจิทัล หน้า 51 บทความวิจัยหรือบทความวิชาการฉบับสมบูรณ์ที่ตีพิมพ์ในรายงานสืบเนื่องจากการประชุม\nวิชาการระดับนานาชาติหรือในวารสารทางวิชาการระดับชาติที่ไม่อยู่ในฐานข้อมูล ตามประกาศ\nก.พ.อ. หรือระเบียบคณะกรรมการการอุดมศึกษาว่าด้วย หลักเกณฑ์การพิจารณาวารสารทางวิชาการ\nสำหรับการเผยแพร่ผลงานทางวิชาการ พ.ศ.2556 แต่สถาบันนำเสนอสภาสถาบันอนุมัติและจัดทำ\nประกาศให้ทราบการทั่วไป และแจ้งให้ก.พ.อ./กกอ. ทราบภายใน 30 วันนับแต่วันที่ออกประกาศ\n: 0.40\nTangjitprom, N. (2021). Dividend Smoothing in Thailand. 2nd Kuala Lumpur International\nConference on Business, Education, Social Sciences and Technology (KLIBEST\n2021), 20-21 May 2021\nSangkaew, P., Jago, L. and Gkritzali, A. (2018). Factor influencing intention to use mobile\napplications in business events. The conference attendee perspectives. The 28th\nAnnual CAUTHE conference, Newcastle, Australia, 5 – 8 February, 2018, page 97.\n2. อาจารย์ ดร.อำพล ตังคนาวนิชย์\nผลงานวิจัยที่หน่วยงานหรือองค์กรระดับชาติว่าจ้างให้ดำเนินการ : 1.00\nTungkanawanich A. (2021). OMRON & AIS Cooperation for applying Smart Manufacturing\nSolutions to Thailand Industry 4.0 (Joint Funding from Omron Industrial\nAutomation Thailand and Advanced Info Services Public Company Limited).\n3. อาจารย์ ปรีชญา ชวลิตธำรง\nผลงานวิจัยที่หน่วยงานหรือองค์กรระดับชาติว่าจ้างให้ดำเนินการ : 1.00\nปรีชญา ชวลิตธำรง (2564). โครงการวิจัยเรื่อง โครงการติดตามและประเมินผลตามนโยบายที่สำคัญ :\nกรณีการจัดให้มีคลื่นความถี่เพื่อประโยชน์สาธารณะหรือสำหรับภาคประชาชน คณะกรรมการ\nติดตามและผลการปฏิบัติงาน. (ทุนสำนักงานคณะกรรมการกิจการกระจายเสียง กิจการโทรทัศน์\nและกิจการโทรคมนาคมแห่งชาติ)\nปรีชญา ชวลิตธำรง (2562). โครงการวิจัยเรื่อง โครงการติดตามประเมินผล นโยบายรัฐบาลมิติบูรณาการ.\n(ทุนสำนักงบประมาณ)\nมคอ. 2 หลักสูตรวิทยาศาสตรบัณฑิต สาขาวิชาการแปรรูปธุรกจิทางดิจิทัล หน้า 52 4. อาจารย์ จิรพล ทับทิมหิน\nผลงานวิจัยที่หน่วยงานหรือองค์กรระดับชาติว่าจ้างให้ดำเนินการ : 1.00\nจิรพล ทับทิมหิน. (2565). โครงการวิจัยเรื่อง ดำเนินโครงการจัดทำแผนปฏิบัติการดิจิทัล สถาบันวิจัย\nระบบสาธารณสุข (สวรส.) พ.ศ.2566-2569. (ทุนสถาบันวิจัยระบบสาธารณสุข (สวรส.))\n5. อาจารย์ พชรพร พิจารณากุล\nบทความวิจัยหรือบทความวิชาการที่ตีพิมพ์ในวารสารวิชาการระดับนานาชาติที่มีอยู่ใน\nฐานข้อมูล ตามประกาศ ก.พ.อ. หรือระเบียบคณะกรรมการการอุดมศึกษาว่าด้วย หลักเกณฑ์การ\nพิจารณาวารสารทางวิชาการสำหรับการเผยแพร่ผลงานทางวิชาการ พ.ศ.2556 ; 1.00 (SCOPUS)\nFukushige, A., Aryupong, M., Phijaranakul, P. (2019). Moderating effects of Hofstede's\ncultural dimensions on the relationship between AEWOM and FEWOM in\nThailand. ABAC Journal Volume 39, Issue 2, pp 1 - 22\nบทความวิจัยหรือบทความวิชาการฉบับสมบูรณ์ที่ตีพิมพ์ในรายงานสืบเนื่องจากการประชุม\nวิชาการระดับนานาชาติหรือในวารสารทางวิชาการระดับชาติที่ไม่อยู่ในฐานข้อมูล ตามประกาศ\nก.พ.อ ; 0.40\nPhijaranakul P (2018). The Exploration of Social Media Platforms Use for Business\nth\nPurposes in Thailand. 4 Business management International Conference on\nChallenges of Creative and Innovative Management, November 1-2, Pattaya,\nThailand\nมคอ. 2 หลักสูตรวิทยาศาสตรบัณฑิต สาขาวิชาการแปรรูปธุรกจิทางดิจิทัล หน้า 53 ภาคผนวก 2 ตารางเปรียบเทียบโครงสร้างและองค์ประกอบของหลักสูตร ฉบับ พ.ศ. 2566 กับ\nฉบับ พ.ศ. 2561\nหลักสูตร ฉบับ พ.ศ. 2561 หลักสูตร ฉบับ พ.ศ. 2566 สรุปการ\nเปลี่ยนแปลง\n1) ชื่อหลักสูตรและชอื่ปริญญา\n1.2 ชื่อหลักสูตร 1.1 ชื่อหลักสูตร คงเดิม\nชื่อภาษาไทย: ชื่อภาษาไทย:\nหลักสตู รวิทยาศาสตรบณัฑิต สาขาวิชานวัตกรรม หลักสตู รวิทยาศาสตรบณัฑิต สาขาวิชานวัตกรรม\nและการแปรรูปทำงดจิทัล และการแปรรูปทำงดจิทัล\nชื่อภาษาอังกฤษ: ชื่อภาษาอังกฤษ:\nBachelor of Science Program in Digital Bachelor of Science Program in Digital\nTransformation and Innovation Transformation and Innovation\n(Multidisciplinary) (Multidisciplinary)\n1.2 ชื่อปริญญา 1.2 ชื่อปริญญา\nภาษาไทย ชื่อเต็ม: วิทยาศาสตรบณัฑติ (นวัตกรรม ภาษาไทย ชื่อเต็ม: วิทยาศาสตรบณัฑติ (นวัตกรรม\nและการแปรรูปทำงดจิทัล) และการแปรรูปทำงดจิทัล)\nชื่อย่อ: วท.บ. (นวัตกรรมและการแปรรูปทาง ชื่อย่อ: วท.บ. (นวัตกรรมและการแปรรูปทาง\nดิจิทัล) ดิจิทัล)\nภาษาอังกฤษชื่อเต็ม: Bachelor of Science ภาษาอังกฤษชื่อเต็ม: Bachelor of Science\n(Digital Transformation and Innovation) (Digital Transformation and Innovation)\nชื่อย่อ: B.S. (Digital Transformation and ชื่อย่อ: B.S. (Digital Transformation and\nInnovation) Innovation)\n2) ปรัชญาและ/หรือวัตถุประสงค์ของหลักสูตร\nปรัชญา ปรัชญา เน้นสร้างองค์ความรู้\nหลักสูตรนวัตกรรมและการแปรรูปทางดิจิทัล หลักสูตรนวัตกรรมและการแปรรูปทางดิจิทัล พหุวิทยาการด้าน\n(Digital Transformation and Innovation) จะ (Digital Transformation and Innovation) จะ นวัตกรรมและการ\nหลักสูตรที่มีความยืดหยุ่น (Flexible) ผู้เรียน หลักสูตรที่มีความยืดหยุ่น (Flexible) ผู้เรียน แปรรูปดิจิทัล แทน\nสามารถเลือกเรียน Module ที่ตนเองสนใจก่อน สามารถเลือกเรียน Module ที่ตนเองสนใจก่อน ด้านวัฒนธรรมและ\nเพื่อสนับสนุนการสร้างสมรรถนะเร่งด่วนในด้าน เพื่อสนับสนุนการสร้างสมรรถนะเร่งด่วนในด้าน การจัดการ\nอุตสาหกรรมดิจิทัลโดยเฉพาะ และสามารถที่จะ อุตสาหกรรมดิจิทัลโดยเฉพาะ และสามารถที่จะ\nปรับเปลี่ยนได้อย่างรวดเร็วตามการเปลี่ยนแปลง ปรับเปลี่ยนได้อย่างรวดเร็วตามการเปลี่ยนแปลง\nของเทคโนโลยีสามารถที่จะให้ทักษะที่แก้ปัญหา ของเทคโนโลยีสามารถที่จะให้ทักษะที่แก้ปัญหา\nในอุตสาหกรรมได้จริงโดยอาศัยความร่วมมือกับ ในอุตสาหกรรมได้จริงโดยอาศัยความร่วมมือกับ\nอุตสาหกรรม เพื่อพัฒนาตนและสร้างองค์ความรู้อุตสาหกรรม เพื่อพัฒนาตนและสร้างองค์ความรู้\nพหุวิทยาการด้านวัฒนธรรมและการจัดการ ก้าว พหุวิทยาการด้านนวัตกรรมและการแปรรูปดิจิทัล\nมคอ. 2 หลักสูตรวิทยาศาสตรบัณฑิต สาขาวิชาการแปรรูปธุรกจิทางดิจิทัล หน้า 54 หลักสูตร ฉบับ พ.ศ. 2561 หลักสูตร ฉบับ พ.ศ. 2566 สรุปการ\nเปลี่ยนแปลง\nทันความเปลี่ยนแปลง ก้าวข้ามเส้นแบ่งความรู้ก้าวทันความเปลี่ยนแปลง ก้าวข้ามเส้นแบ่งความรู้\nก้าวสู่ความเลิศระดับสากล บนพื้นฐานคุณธรรม ก้าวสู่ความเลิศระดับสากล บนพื้นฐาคุณธรรม\nจริยธรรม และรับใช้สังคม จริยธรรม และรับใช้สังคม\nวัตถุประสงค์ของหลักสูตร วัตถุประสงค์ของหลักสูตร คงเดิม\n1) เพื่อสร้างบัณฑิตพันธุ์ใหม่ที่ผู้ที่มีทักษะและ เพื่อให้บัณฑิตทสี่าเร็จการศึกษาในหลักสตู รมี\nความรู้ทั้งด้านเทคโนโลยีธุรกิจและนวัตกรรม ลักษณะ ดังนี้\nและปัจจัยที่มีผลกระทบต่อสังคม และสร้างสรรค์ 1) เพื่อสร้างบัณฑิตพันธุ์ใหม่ที่ผู้ที่มีทักษะและ\nสิ่งใหม่ให้ธุรกิจ สังคม และประเทศ ความรู้ทั้งด้านเทคโนโลยีธุรกิจและนวัตกรรม\n2) เพื่อผลักดันให้เกิดการพัฒนาการแปรรูปดิจิทัล และปัจจัยที่มีผลกระทบต่อสังคม และสร้างสรรค์\n(Digital Transformation) ซึ่งสิ่งที่สำคัญมาก สิ่งใหม่ให้ธุรกิจ สังคม และประเทศ\nกับธุรกิจในประเทศ ในการเติบโตและพัฒนาของ 2) เพื่อผลักดันให้เกิดการพัฒนาการแปรรูปดิจิทัล\nธุรกิจ (Digital Transformation) ซึ่งสิ่งที่สำคัญมาก\n3) เพื่อแหล่งเรียนรู้ตลอดชีวิต (Life-long กับธุรกิจในประเทศ ในการเติบโตและพัฒนาของ\nlearning) ในเรื่องวิทยาศาสตร์ข้อมูลสา หรับ ธุรกิจ\nผู้เรยีนที่ไม่จา กัดในระดับมหาวิทยาลัยเท่านั้น 3) เพื่อแหล่งเรียนรู้ตลอดชีวิต (Life-long\nlearning) ในเรื่องวิทยาศาสตร์ข้อมูลสา หรับ\nผู้เรยีนที่ไม่จา กัดในระดับมหาวิทยาลัยเท่านั้น\n3) คุณสมบัติของผู้เข้าศึกษา\nคุณสมบัติของผู้เข้าศึกษา คุณสมบัติของผู้เข้าศึกษา ระบุข้อบังคับ\nคุณสมบัติของผู้เข้าศึกษาต้องไปตามข้อบังคับ คุณสมบัติของผู้เข้าศึกษาต้องไปตามข้อบังคับ ข้อที่ 14\nมหาวิทยาลยัธรรมศาสตร์ว่าด้วยการศึกษาชั้น มหาวิทยาลยัธรรมศาสตร์ว่าด้วยการศึกษาชั้น\nปริญญาตรีพ.ศ. 2561 ปริญญาตรีพ.ศ. 2561 ข้อ 14\nการคัดเลือกผู้เข้าศึกษา การคัดเลือกผู้เข้าศึกษา\n- การคัดเลือกผู้เข้าศึกษาให้ไปตาม - การคัดเลือกผู้เข้าศึกษาให้ไปตาม - ปรับการคัดเลือก\nวิธีการที่มหาวิทยาลัยกำหนดโดยความ ระเบียบคัดเลือกเพื่อเข้าศึกษาใน ให้ไปตาม\nเห็นชอบของสภามหาวิทยาลัย หรือให้สถาบันการศึกษาขั้นอุดมศึกษาของส่วน ระเบียบคัดเลือก\nไปตามระเบียบการคัดเลือกบุคคล ราชการหรือหน่วยงานอื่นดำเนินการ ของส่วนราชการ\nเพื่อเข้าศึกษาในสถาบันการศึกษาขั้น ตามการมอบหมายของมหาวิทยาลัย หรือหน่วยงานตาม\nอุดมศึกษาของสำนักงานคณะกรรมการ หรือตามข้อตกลง หรือ การคัดเลือกตาม การมอบหมายของ\nการอุดมศึกษา วิธีการที่มหาวิทยาลัยกำหนดโดยความ มหาวิทยาลัยที่ได้\n- เงื่อนไขอื่น ๆ ให้ไปตามประกาศรับ เห็นชอบของสภามหาวิทยาลัยและ เห็นชอบตามสภา\nสมัครบุคคลเข้าศึกษาในระดับอุดม ออกประกาศมหาวิทยาลัย มหาวิทยาลัย\nศึกษาของมหาวิทยาลัยธรรมศาสตร์ - ในกรณีที่นักศึกษาต่างชาติผู้ที่มี - เพิ่มเงื่อนไขการ\nและ/หรือ วิทยาลัยนวัตกรรม สัญชาติและมีถิ่นฐานอยู่ในประเทศที่ใช้ยกเว้นการส่งผล\nภาษาอังกฤษภาษาราชการ จะได้รับ สอบภาษาอังกฤษ\nการพิจารณายกเว้นไม่จำต้องส่งผล สำหรับนักศึกษา\nมคอ. 2 หลักสูตรวิทยาศาสตรบัณฑิต สาขาวิชาการแปรรูปธุรกจิทางดิจิทัล หน้า 55 หลักสูตร ฉบับ พ.ศ. 2561 หลักสูตร ฉบับ พ.ศ. 2566 สรุปการ\nเปลี่ยนแปลง\nทดสอบภาษาอังกฤษ ซึ่งมีรายชื่อ ต่างชาติที่มีสัญชาติ\nประเทศดังนี้ออสเตรเลีย สหราช และถิ่นฐานใน -\nอาณาจักร นิวซีแลนด์ ไอร์แลนด์ ประเทศที่ใช้ภาษา\nแคนาดา และสหรัฐอเมริกา อังกฤษภาษา\nราชการ\n4) จำนวนการรับนักศกึษา\nรับนักศึกษาปีละ 60 คน รับนักศึกษาปีละ 60 คน คงเดิม\n5) ระบบการศึกษา\nระบบ ระบบ ปรับรายละเอียด\nใช้ระบบการศึกษาแบบทวิภาค โดย 1 ปีการศึกษา หลักสูตรแบบเต็มเวลา ใช้ระบบการศึกษา ระบบการศึกษาตาม\nแบ่งออก 2 ภาคการศึกษาปกติซึ่ง 1 ภาค แบบทวิภาค โดย 1 ปีการศึกษาแบ่งออก 2 เกณฑ์ฯ 2565\nการศึกษาปกติมีระยะเวลาศึกษาไม่น้อยกว่า 15 ภาคการศึกษาปกติ 1 ภาคการศึกษาปกติมี\nสัปดาห์ และอาจเปิดภาคฤดูร้อนได้ โดยใช้เวลา ระยะเวลาศึกษาไม่น้อยกว่า 15 สัปดาห์\nการศึกษาไม่น้อยกว่า 6 สัปดาห์ แต่ให้เพิ่มชั่วโมง\nการศึกษาในแต่ละรายวิชาให้เท่ากับภาค\nการศึกษาปกติ\nระบบการศึกษา ระบบการศึกษา\n\n<include> แบบชั้นเรียน </include>\n<include> แบบชั้นเรียน (Onsite)</include>\n\n<exclude> แบบทางไกลผ่านสื่อสิ่งพิมพ์หลัก </exclude>\n<exclude> แบบทางไกล (Online)</exclude>\n\n<exclude> แบบทางไกลผ่านสื่อแพร่ภาพและเสียง </exclude>\n<exclude> แบบประสมประสาน (Hybrid)</exclude>\nสื่อหลัก\n<include> อื่นๆ (ระบุ)</include>\n\n<exclude> แบบทางไกลทางอิเล็กทรอนิกส์สื่อหลัก นอกเหนือจากระบบการศึกษาแบบชั้นเรียน</exclude>\n(E-Learning) หลักสูตรจะใช้เทคนิคการเรียนการสอนแบบ\n\n<exclude> แบบทางไกลทางอินเทอร์เน็ต ผสมผสานเพื่อสร้างการเรียนรู้ที่มีประสิทธิภาพ</exclude>\n\n<include> อื่น ๆ ให้แก่นักศึกษา โดยเทคนิคที่จะใช้ในการสร้างการ</include>\nนอกเหนือจากระบบการศึกษาแบบชั้น เรียนรู้ประกอบด้วย การเรียนรู้เชิงรุก (Active\nเรียน หลักสูตรจะใช้เทคนิคการเรียนการสอนแบบ learning) การเรียนรู้จากปัญหาที่เผชิญอยู่ใน\nผสมผสาน เพื่อสร้างการเรียนรู้ที่มีประสิทธิภาพ ปัจจุบัน (Problem-based learning) การเรียนรู้\nให้แก่นักศึกษา โดยเทคนิคที่จะใช้ในการสร้างการ ด้วยการทำโครงงาน (Project-based learning)\nเรียนรู้ประกอบด้วย การเรียนรู้เชิงรุก (Active การทำงานกลุ่ม การทำงานวิจัยโครงการเดี่ยว การ\nlearning) การเรียนรู้จากปัญหาที่เผชิญอยู่ใน วิเคราะห์กรณีศึกษา การฝึกงานผ่านการปฏิบัติ\nปัจจุบัน (Problem-based learning) การเรียนรู้จริง รวมถึงการศึกษาดูงาน\nด้วยการทำโครงงาน (Project-based learning)\nการทำงานกลุ่ม การทำงานวิจัย โครงการเดี่ยว\nการวิเคราะห์กรณีศึกษา การฝึกงานผ่านการ\nปฏิบัติจริง รวมถึงการศึกษาดูงาน\nมคอ. 2 หลักสูตรวิทยาศาสตรบัณฑิต สาขาวิชาการแปรรูปธุรกจิทางดิจิทัล หน้า 56 หลักสูตร ฉบับ พ.ศ. 2561 หลักสูตร ฉบับ พ.ศ. 2566 สรุปการ\nเปลี่ยนแปลง\n6) เกณฑ์การสำเร็จการศึกษา\nเกณฑ์การสำเร็จการศึกษาตามหลักสูตร เกณฑ์การสำเร็จการศึกษาตามหลักสูตร ปรับเกณฑ์การ\n ศึกษารายวิชาต่าง ๆ ครบตามโครงสร้าง  สอบผ่านและได้รับหน่วยกิตสะสมรายวิชา สำเร็จการศึกษา\nหลักสูตร และมีหน่วยกิตสะสมไม่น้อยกว่า ครบตามโครงสร้างหลักสูตร และมีหน่วยกิต โดยนักศึกษาต้อง\n129 หน่วยกิต สะสมไม่น้อยกว่า 129 หน่วยกิต สอบผ่านและได้รับ\n ได้ค่าระดับเฉลี่ยสะสมไม่ต่ำกว่า 2.00 (จาก  ได้ค่าระดับเฉลี่ยสะสมไม่ต่ำกว่า 2.00 (จาก หน่วยกิตสะสม\nระบบ 4 ระดับคะแนน) ระบบ 4 ระดับคะแนน) รายวิชาครบตาม\n ได้ค่าระดับ S (ใช้ได้) ในรายวิชา ดท.380  ได้ค่าระดับ S (ใช้ได้) ในรายวิชา ดท.380 โครงสร้างหลักสูตร\nการฝึกปฏิบัติงานด้านธุรกิจดิจิทัล การฝึกปฏิบัติงานด้านธุรกิจดิจิทัล และมีหน่วยกิต\n ปฏิบัติตามเงื่อนไขอื่น ๆ ที่วิทยาลัยนวัตกรรม  ปฏิบัติตามเงื่อนไขอื่น ๆ ที่วิทยาลัยนวัตกรรม สะสมไม่น้อยกว่า\nและมหาวิทยาลัยธรรมศาสตร์กำหนด และมหาวิทยาลัยธรรมศาสตร์กำหนด 129 หน่วยกิต\nแทนการศึกษา\nรายวิชาต่าง ๆ ครบ\nตามโครงสร้าง\nหลักสูตร\n7) โครงสร้างและองค์ประกอบของหลักสูตร\nโครงสร้างหลักสูตร โครงสร้างหลักสูตร คงเดิม\nนักศึกษาจะต้องจดทะเบียนศึกษารายวิชา รวมไม่\nน้อยกว่า 129 หน่วยกิต โดยศึกษารายวิชาต่าง ๆ\nครบตามโครงสร้างองค์ประกอบ และข้อกำหนด\nของหลักสูตรดังนี้\n1) หมวดวิชาศึกษาทั่วไป 30 หน่วยกิต 1) วิชาศึกษาทั่วไป 30 หน่วยกิต\n2) หมวดวิชาเฉพาะ 93 หน่วยกิต 2) วิชาเฉพาะ 93 หน่วยกิต\n2.1) วิชาบังคับ 78 หน่วยกิต 2.1) วิชาบังคับ 78 หน่วยกิต\n2.2) วิชาเลือก 15 หน่วยกิต 2.2) วิชาเลือก 15 หน่วยกิต\n3) หมวดวิชาเลือกเสรี 6 หน่วยกิต 3) วิชาเลือกเสรี 6 หน่วยกิต\nรวม 129 หน่วยกิต รวม 129 หน่วยกิต\n8) รายวิชาตามโครงสร้างของหลักสูตร\n1. หมวดวิชาศึกษาทั่วไป 1. หมวดวิชาศึกษาทั่วไป\nวิชาศึกษาทั่วไป วิชาศึกษาทั่วไป 30 หน่วยกิต ปรับเงื่อนไขหมวด\nนักศึกษาจะต้องศึกษารายวิชาในหลักสตู รวิชา นักศึกษาทุกคนสามารถเลือกเรียนได้ทุกรายวิชาใน วิชาและรายวิชา\nศึกษาทั่วไป รวมแล้วไม่น้อยกว่า 30 หน่วยกิต แต่ละหมวด โดยต้องเลือกเรียนให้ครบทั้ง 5 หมวด ตามเล่มหลักสตู ร\nมคอ. 2 หลักสูตรวิทยาศาสตรบัณฑิต สาขาวิชาการแปรรูปธุรกจิทางดิจิทัล หน้า 57 หลักสูตร ฉบับ พ.ศ. 2561 หลักสูตร ฉบับ พ.ศ. 2566 สรุปการ\nเปลี่ยนแปลง\nตามโครงสร้างและองค์ประกอบของหลักสูตรวิชา แต่ละหมวดจะเรียนกี่วิชาก็ได้จำนวนรวมทั้งสิ้น ศึกษาทั่วไป ฉบับ\nศึกษาทั่วไป ซึ่งแบ่ง 2 ส่วน คือ 30 หน่วยกิต ตามโครงสร้างและองค์ประกอบของ ปรับปรุง พ.ศ. 2566\nหลักสูตรวิชาศึกษาทั่วไปที่มหาวิทยาลัยกำหนด\nส่วนที่ 1: หลักสตู รกลางของมหาวิทยาลยัที่ดังนี้\nกำหนดให้นักศึกษาทุกคนต้องเรยีน จำนวน 21\nหมวดวิชา\nหน่วยกิต โดยกา หนดให้นักศึกษาศึกษาในรูปแบบ\n1) หมวดความเท่าทันโลกและสังคม\nดังนี้\n2) หมวดสุนทรียะและทักษะการสอื่สาร\n3) หมวดคณิตศาสตร์ วิทยาศาสตร์ และ\nหมวดวิชา จำนวนหน่วยกิต\nเทคโนโลยี\n1. สังคมศาสตร์ 6 หน่วยกิต\n4) หมวดสุขภาวะและทักษะแห่งอนาคต\n2. มนุษยศาสตร์ 3 หน่วยกิต\n5) หมวดการบริการสังคมและการเรียนรจู้ากการ\n3. วิทยาศาสตร์กับ 3 หน่วยกิต\nปฏิบัติ\nคณิตศาสตร์\n4. ภาษา 9 หน่วยกิต\nรวม 21 หน่วยกิต\nส่วนที่ 1\n1. หมวดสังคมศาสตร์\nบังคับ 1 วิชา 3 หน่วยกิต\nมธ.100 พลเมืองกับการลงมือ 3 (3-0-6) มธ.100 พลเมืองกับการลงมือ 3 (3-0-6) คงเดิม\nแก้ปัญหา แก้ปัญหา(5)\nTU100 Civic Engagement TU100 Civic Engagement\nบังคับเลือก 1 วิชา 3 หน่วยกิต\nมธ.101 โลก อาเซียนและไทย 3 (3-0-6) มธ.101 โลก อาเซียนและไทย(1) 3 (3-0-6) คงเดิม\nTU101 Thailand, ASEAN and TU101 Thailand, ASEAN and\nหรือ the World the World\nมธ.109 นวัตกรรมกับกระบวน 3 (3-0-6) มธ.109 นวัตกรรมกับกระบวน 3 (3-0-6) คงเดิม\nคิดผู้ประกอบการ คิดผู้ประกอบการ(1)\nTU109 Innovation and TU109 Innovation and\nEntrepreneurial Entrepreneurial\nmindset mindset\nมธ.124 สังคมกับเศรษฐกิจ(1) 3 (3-0-6) เพิ่มรายวิชา\nTU124 Society and\nEconomy\nมคอ. 2 หลักสูตรวิทยาศาสตรบัณฑิต สาขาวิชาการแปรรูปธุรกจิทางดิจิทัล หน้า 58 หลักสูตร ฉบับ พ.ศ. 2561 หลักสูตร ฉบับ พ.ศ. 2566 สรุปการ\nเปลี่ยนแปลง\n2.หมวดมนุษยศาสตร์\nบังคับเลือก 1 วิชา 3 หน่วยกิต\nมธ.102 ทักษะชีวิตทางสังคม 3 (3 - 0 - 6) ยกเลิก\nTU102 Social Life Skills\nหรือ\nมธ.108 การพัฒนาและจัดการ 3 (3-0-6) ยกเลิก\nตนเอง\nTU108 Self-Development\nand Management\n3. หมวดวิทยาศาสตร์กับคณิตศาสตร์\nบังคับเลือก 1 วิชา 3 หน่วยกิต\nมธ.103 ชีวิตกับความยั่งยืน 3 (3-0-6) มธ.103 ชีวิตกับความยั่งยืน(3) 3 (3-0-6) คงเดิม\nTU103 Life and Sustainability TU103 Life and Sustainability\nหรือ\nมธ.107 ทักษะดิจิทัลกับการ 3 (3-0-6) มธ.107 ทักษะดิจิทัลกับการ 3 (3-0-6) คงเดิม\nแก้ปัญหา แก้ปัญหา(3)\nTU107 Digital Skill and TU107 Digital Skill and\nProblem Solving Problem Solving\nมธ.155 สถิติพื้นฐาน(3) 3 (3-0-6) เพิ่มรายวิชา\nTU155 Elementary Statistics\nมธ.156 การเขียนโปรแกรมเชิง 3 (3-0-6) เพิ่มรายวิชา\nวิทยาศาสตร์เบื้องต้น(3)\nTU156 Introduction to\nScientific\nProgramming\n4. หมวดภาษา บังคับ 3 วิชา 9 หน่วยกิต\nมธ.050 การพัฒนาทักษะ ไม่นับ ยกเลิก\nภาษาอังกฤษ หน่วยกิต\nTU050 English Skill\nDevelopment\nมธ.104 การคิด อ่าน และเขียน 3 (3-0-6) ยกเลิก\nอย่างมีวิจารณญาณ\nTU104 Critical Thinking,\nมคอ. 2 หลักสูตรวิทยาศาสตรบัณฑิต สาขาวิชาการแปรรูปธุรกจิทางดิจิทัล หน้า 59 หลักสูตร ฉบับ พ.ศ. 2561 หลักสูตร ฉบับ พ.ศ. 2566 สรุปการ\nเปลี่ยนแปลง\nReading, and Writing\nมธ.105 ทักษะการสื่อสารด้วย 3 (3-0-6) สษ.105 ทักษะการสื่อสารทาง 3 (3-0-6) เปลี่ยนรหัส ชื่อวิชา\nภาษาอังกฤษ ภาษาอังกฤษ(2) และคำอธิบาย\nTU105 Communication EL105 English รายวิชา\nSkills in English Communication Skills\nมธ.106 ความคิดสร้างสรรค์และ 3 (3-0-6) มธ.106 ความคิดสร้างสรรค์และ 3 (3-0-6) คงเดิม\nการสื่อสาร การสื่อสาร(2)\nTU106 Creativity and TU106 Creativity and\nCommunication Communication\nมธ.240 เศรษฐกิจภมูิรัฐศาสตร์ 3 (3-0-6) เพิ่มรายวิชา\nโลก(4)\nTU240 World Geopolitical\nEconomy\nมธ.243 ทักษะดิจิตอลเพื่ออนาคต(4) 3 (3-0-6) เพิ่มรายวิชา\nTU243 Digital Skills for the\nFuture\nวธ.101 การวางแผนการเงินเพื่อ 3 (3-0-6) เพิ่มรายวิชา\nความมั่นคงในการดำรง\nชีพ(4)\nDE101 Financial planning for\neconomic stability in\nlife\nมธ.200 พลเมืองกับการลงมือ 3 (3-0-6) เพิ่มรายวิชา\nแก้ปัญหาโดยออกแบบ\nการเรยีนรู้เอง(1)\nTU200 Self Design Civic\nEngagement\nส่วนที่ 2\nนักศึกษาต้องศึกษารายวิชาที่วิทยาลัยฯ กำหนด\nจำนวน 3 วิชา 9 หน่วยกิต ดังนี้\nมธ.116 มนุษย์กับศิลปะ: 3 (3-0-6) ยกเลิก\nมคอ. 2 หลักสูตรวิทยาศาสตรบัณฑิต สาขาวิชาการแปรรูปธุรกจิทางดิจิทัล หน้า 60 หลักสูตร ฉบับ พ.ศ. 2561 หลักสูตร ฉบับ พ.ศ. 2566 สรุปการ\nเปลี่ยนแปลง\nทัศนศิลป์ ดนตรี และ\nศิลปะการแสดง\nTU116 Man and Arts: Visual\nArt, Music and\nPerforming Arts\nมธ.117 พัฒนาการของโลก 3 (3-0-6) ยกเลิก\nสมัยใหม่\nTU117 Development of\nModern World\nดท.100 นวัตกรรมดิจิทัล 3 (3-0-6) ดท.100 นวัตกรรมดิจิทัล(3) 3 (3-0-6) คงเดิม\nDX100 Digital Innovation DX100 Digital Innovation\n2 หมวดวิชาบังคับ 2 หมวดวิชาบังคับ\nนักศึกษาต้องศึกษารายวิชาในหมวดวิชาบังคับ นักศึกษาต้องศึกษารายวิชาในหมวดวิชาบังคับ หน่วยกิตคงเดมิ\nจำนวน 78 หน่วยกิตตามรายวิชาที่กำหนดไว้ดังนี้จำนวน 78 หน่วยกิต ตามรายวิชาที่กำหนดไว้ดังนี้\nหมวดการแก้ปัญหาเชิงสร้างสรรค์ (Creative หมวดการแก้ปัญหาเชิงสร้างสรรค์ (Creative คงเดิม\nProblem Solving) Problem Solving)\nดท.200 หลักการเขียนโปรแกรม 3 (3 - 0 - 6) ด ท . 2 1 0 ห ลัก การ เขียนโปรแกรม 3 (3 - 0 - 6) เป ลี่ย น ร หัส วิชา\nDX200 Principle of DX210 Principle of\nProgramming Programming\nดท.201 คอมพิวเตอร์ซอฟต์แวร์ 3 (3-0-6) ดท.211 คอมพิวเตอร์ซอฟต์แวร์ 3 (3-0-6) เปลี่ยนรหัสวิชา\nและการประยุกต์ และการประยุกต์\nDX201 Computer Software DX211 Computer Software\nand Applications and Applications\nดท.202 การแก้ปัญหาอย่าง 3 (3-0-6) ปิดวิชา\nสร้างสรรค์และการคิด\nเชิงวิพากษ์\nDX202 Creative Problem\nSolving and Critical\nThinking\nดท.203 วิทยาการคอมพิวเตอร์ 3 (3-0-6) ดท.213 วิทยาการคอมพิวเตอร์ 3 (3-0-6) เปลี่ยนรหัสวิชา\nของการตัดสินใจ ของการตัดสินใจ\nDX203 Computer Science DX213 Computer Science\nof Human Decisions of Human Decisions\nมคอ. 2 หลักสูตรวิทยาศาสตรบัณฑิต สาขาวิชาการแปรรูปธุรก จิทางดิจิทัล หน้า 61 หลักสูตร ฉบับ พ.ศ. 2561 หลักสูตร ฉบับ พ.ศ. 2566 สรุปการ\nเปลี่ยนแปลง\nดท.204 การตัดสินใจด้วยข้อมลู 3 (3 - 0 - 6) ปิดวิชา\nData-Driven Decision\nDX204 Making\nดท.212 การเขียนโปรแกรมบน 3 (3-0-6) เพิ่มวิชาใหม่\nอุปกรณ์เคลื่อนที่\nDX212 Mobile Programming\nดท.214 การจัดการองค์กรดิจิทลั 3 (3 - 0 - 6) เพิ่ม วิชา ให ม่\nDX214 Managing Digital\nFilm\nหมวดการคิดเชิงออกแบบ Design Thinking ยกเลิกหมวดการคิด\nเชิงออกแบบ และ\nปิด/ย้ายบางรายวิชา\nไปหมวดธรุ กิจ\nนวัตกรรมและการ\nคิดเชิงออกแบบ\nและวิชาเลือกเสรี\nหมวดธุรกิจ นวัตกรรมและการคดิ เชิงออกแบบ หมวดวิชาใหม่\nBusiness, Innovation, and Design\nThinking\nดท.230 การคิดเชิงออกแบบขั้น 3 (3-0-6) ดท.330 หลักการคดิ เชิงออกแบบ 3 (3-0-6) เปลี่ยนรหัส ชื่อวิชา\nพื้นฐาน ขั้นพื้นฐาน และย้ายไปหมวด\nDX230 Design Thinking DX330 Principle of Design ธุรกิจ นวัตกรรม\nFundamentals Thinking และการคิดเชิง\nออกแบบ\nดท.231 หลักการออกแบบ 3 (3-0-6) ปิดวิชา\nสำหรับมนุษย์\nDX231 Principles of\nDesigning\nfor Humans\nดท.232 การบริหารโครงการ 3 (3 - 0 - 6) ด ท . 3 9 8 การ บ ริหารโครงการ 3 (3 - 0 - 6) เป ลี่ย น ร หัส วิชา\nDX232 Project Management DX398 Project Management และย้ายวิชา\nเลือกเสรี\nดท.233 การออกแบบการบริการ 3 (3 - 0 - 6) ปิดวิชา\nDX233 Service Design\nดท.234 โครงงานการคดิ เชิง 3 (3-0-6) ดท.334 โครงงานด้านนวัตกรรม 3 (3 - 0 - 6) เป ลี่ย น ร หัส ชื่อ วิชา\nออกแบบ D X334 Innovation Capstone คำอธิบายรายวิชา\nมคอ. 2 หลักสูตรวิทยาศาสตรบัณฑิต สาขาวิชาการแปรรูปธุรกจิทางดิจิทัล หน้า 62 หลักสูตร ฉบับ พ.ศ. 2561 หลักสูตร ฉบับ พ.ศ. 2566 สรุปการ\nเปลี่ยนแปลง\nDX234 Design Thinking Project และย้ายไปหมวด\nCapstone Project ธุรกิจ นวัตกรรม\nและการคิดเชิง\nออกแบบ\nดท.331 การจัดการนวัตกรรม 3 (3 - 0 - 6) เพิ่ม วิชา ให ม่\nDX331 Innovation\nManagement\nดท.332 การออกแบบ UX/UI 3 (3 - 0 - 6) เพิ่ม วิชา ให ม่\nDX332 UX/UI Design\nดท.333 การจัดการการเงิน 3 (3-0-6) เพิ่มวิชาใหม่\nสำหรับนวตักรรม\nDX333 Financial\nManagement for\nInnovation\nหมวดธุรกิจ นวัตกรรม และการประกอบการ ยกเลิกหมวด ปิด\nBusiness, Innovation and วิชา และกำหนด\nEntrepreneurship บางรายวิชาเปนวิชา\nเลือกเสรี\nดท.310 นวัตกรรมและ 3 (3-0-6) ดท.395 นวัตกรรมและ 3 (3-0-6) เปลี่ยนรหัสวิชา\nผู้ประกอบการ ผู้ประกอบการ และ ย้า ยวิชา\nDX310 Innovation and DX395 Innovation and เลือกเสรี\nEntrepreneurship Entrepreneurship\nดท.311 การตลาดเชิงสร้างสรรค์ 3 (3 - 0 - 6) ปิดวิชา\nDX311 Innovative Marketing\nดท.312 การเงินและบัญชี 3 (3 - 0 - 6) ด ท .3 9 9 การ เงิน และบัญชี 3 (3 - 0 - 6) เป ลี่ย น ร หัส วิชา\nDX312 Accounting and DX399 Accounting and และย้ายวิชา\nFinance Finance เลือกเสรี\nดท.313 กฎหมายธรุ กิจและ 3 (3-0-6) ดท.397 กฎหมายธรุ กิจและ 3 (3-0-6) เปลี่ยนรหัสวิชา\nเทคโนโลยีสารสนเทศ เทคโนโลยีสารสนเทศ และย้ายวิชา\nDX313 Business and Information DX397 Business and Information เลือกเสรี\nTechnology Laws Technology Laws\nดท.314 การบริหารเชิงกลยุทธ์ 3 (3 - 0 - 6) ปิดวิชา\nDX314 Strategic\nManagement\nหมวดการแปรรูปดิจิทัล Digital หมวดการแปรรูปดิจิทัล Digital คงเดิม\nTransformation Transformation\nมคอ. 2 หลักสูตรวิทยาศาสตรบัณฑิต สาขาวิชาการแปรรูปธุรกจิทางดิจิทัล หน้า 63 หลักสูตร ฉบับ พ.ศ. 2561 หลักสูตร ฉบับ พ.ศ. 2566 สรุปการ\nเปลี่ยนแปลง\nดท.320 กลยุทธ์การแปรรูปทาง 3 (3-0-6) ดท.451 กลยุทธ์การแปรรูปทาง 3 (3-0-6) เปลี่ยนรหัสวิชา\nดิจิทัล ดิจิทัล\nDX320 Digital Transformation DX451 Digital Transformation\nStrategy Strategy\nดท.321 เทคโนโลยีและโดเมน 3 (3-0-6) ปิดวิชา\nการแปรรปู ดิจิทัล\nDX321 Digital Transformation\nDomain and Technology\nดท.322 การนำในยุคดิจิทลั 3 (3 - 0 - 6) ปิดวิชา\nDX322 Digital Leadership\nดท.323 แบบจำลองธุรกิจดจิทัล 3 (3 - 0 - 6) ปิดวิชา\nDX323 Digital Business\nModel\nดท.324 โครงงานด้านการแปรรูป 3 (3-0-9) ดท.454 โครงงานด้านการแปรรูป 3 (3-0-6) เปลี่ยนรหัสวิชา\nทางดิจิทัล ทางดิจิทัล\nDX324 Digital Transformation DX454 Digital Transformation\nCapstone Project Capstone Project\nดท.450 เทคโนโลยีอุบัติใหม่และ 3 (3-0-6) เพิ่มวิชาใหม่\nแบบจำลองธุรกิจดจิทัล\nDX450 Emerging\ntechnologies and\nDigital Business\nModel\nดท.452 พฤติกรรมองค์กรในยคุ 3 (3-0-6) เพิ่มวิชาใหม่\nดิจิทัลและภาวะผู้นำ\nความเปลยี่นแปลง\nDX452 Digital Organizational\nBehavior and\nTransformational\nLeadership\nดท.453 การสัมมนาเทคโนโลยี 3 (3-0-6) เพิ่มวิชาใหม่\nดิจิทัลขั้นสูง\nDX453 Advanced Digital\nTechnology Seminar\nการฝึกปฏิบัติงาน การฝึกปฏิบัติงาน คงเดิม\nดท.380 การฝึกปฏิบัติงานด้าน (135 ชม.) ดท.380 การฝึกปฏิบัติงานด้าน (135 ชม.) คงเดิม\nมคอ. 2 หลักสูตรวิทยาศาสตรบัณฑิต สาขาวิชาการแปรรูปธุรกจิทางดิจิทัล หน้า 64 หลักสูตร ฉบับ พ.ศ. 2561 หลักสูตร ฉบับ พ.ศ. 2566 สรุปการ\nเปลี่ยนแปลง\nธุรกิจดิจิทัล ธุรกิจดิจิทัล\nDX380 Internships for (135 hrs.) DX380 Internships for (135 hrs.)\nDigital Business Digital Business\nหมวดการตลาดดิจิทัล Digital Marketing หมวดการตลาดดิจิทัล Digital Marketing ย้ายหมวดวิชา\n(วิชาเลือก) กำหนดหมวด\nวิชาเลือก\nดท.460 พฤติกรรมผู้บรโิภคในยุค 3 (3-0-6) ดท.465 พฤติกรรมผู้บรโิภคในยุค 3 (3-0-6) เปลี่ยนรหัสวิชา\nดิจิทัล ดิจิทัล ย้ายวิชาเลือก\nDX460 Digital Consumers DX465 Digital Consumers\nBehavior Behavior\nดท.461 การสร้างแบรนด์และ 3 (3-0-6) ดท.466 การสร้างแบรนด์และ 3 (3-0-6) เปลี่ยนรหัสวิชา\nการมีส่วนร่วม การมีส่วนร่วม ย้ายวิชาเลือก\nDX461 Digital Branding and DX466 Digital Branding and\nEngagement Engagement\nดท.462 การบริหารชื่อเสียงในยุค 3 (3-0-6) ดท.467 การบริหารชื่อเสียงในยุค 3 (3-0-6) เปลี่ยนรหัสวิชา\nดิจิทัล ดิจิทัล ย้า ย  วิชา เลือ ก\nDX462 Digital Reputation DX467 Digital Reputation\nManagement Management\nดท.463 กลยุทธ์การตลาด 3 (3-0-6) ดท.468 กลยุทธ์การตลาดดิจิทัล 3 (3 - 0 - 6) เป ลี่ย น ร หัส และ\nออนไลน์ Digital Marketing ชื่อวิชา\nDX463 Online Marketing DX468 Strategy ย้ายวิชาเลือก\nStrategy\nดท.464 การบริหารแบรนด์ 3 (3-0-6) ดท.469 การบริหารแบรนด์ 3 (3-0-6) เปลี่ยนรหัสวิชา\nเชิงกลยุทธ์ เชิงกลยุทธ์ ย้า ยวิชาเลือก\nDX464 Strategic Brand Management DX469 Strategic Brand Management\n9.3 วิชาเลือก 9.3 วิชาเลือก ปรับจำนวนหมวด\nนักศึกษาต้องศึกษาวิชาเลือกจำนวน 1 หมวดจาก 3 นักศึกษาต้องศึกษาวิชาเลือกจำนวน 1 หมวดจาก 2 วิชา จาก 3 หมวด\nหมวด โดยศึกษาจำนวนไม่น้อยกว่า 15 หน่วยกิต หมวด โดยศึกษาจำนวนไม่น้อยกว่า 15 หน่วยกิต เหลือ 2 หมวด\nจากรายวิชาที่กำหนดไว้ดังนี้จากรายวิชาที่กำหนดไว้ดังนี้จำนวนหน่วยกิตที่\nต้องศึกษาคงเดิม\nหมวดการวิเคราะห์ทางธุรกิจ Business หมวดการวิเคราะห์ทางธุรกิจ Business ย้ายหมวดวิชา\nAnalytics Analytics (วิชาบังคับ) กำหนดหมวด\nวิชาบังคับ\nดท.445 การสำรวจและการ 3 (3-0-6) ดท.220 การสำรวจและการ 3 (3-0-6) เปลี่ยนรหัสวิชา\nเตรียมข้อมูล เตรียมข้อมูล และย้ายวิชา\nมคอ. 2 หลักสูตรวิทยาศาสตรบัณฑิต สาขาวิชาการแปรรูปธุรกจิทางดิจิทัล หน้า 65 หลักสูตร ฉบับ พ.ศ. 2561 หลักสูตร ฉบับ พ.ศ. 2566 สรุปการ\nเปลี่ยนแปลง\nDX445 Data Exploration DX220 Data Exploration บังคับ\nand Preprocessing and Preprocessing\nดท.446 อัลกอริทึมของ 3 (3-0-6) ดท.221 อัลกอริทึมของ 3 (3-0-6) เปลี่ยนรหัสวิชา\nวิทยาศาสตร์ข้อมูล วิทยาศาสตร์ข้อมูล และ ย้ายวิชา\nDX446 Data Science DX221 Data Science บังคับ\nAlgorithms Algorithms\nดท.447 ระบบธุรกิจอัจฉริยะ 3 (3 - 0 - 6) ด ท . 2 2 2 ระ บ บ ธุร กิจอัจฉริยะ 3 (3 - 0 - 6) เป ลี่ย น ร หัส วิชา\nDX447 Business Intelligence DX222 Business Intelligence และย้ายวิชา\nบังคับ\nดท.448 การวิเคราะห์การตลาด 3 (3 - 0 - 6) ปิดวิชา\nDX448 Marketing Analytics\nดท.449 โครงงานด้านการ 3 (3-0-9) ดท.224 โครงงานด้านการ 3 (3-0-6) เปลี่ยนรหัสวิชา\nวิเคราะห์ข้อมูลสำหรับ วิเคราะห์ข้อมูลสำหรับ และย้ายวิชา\nธุรกิจ ธุรกิจ บังคับ\nDX449 Business Analytics DX224 Business Analytics\nCapstone Project Capstone Project\nดท.223 วิศวกรรมข้อมลู 3 (3 - 0 - 6) เพิ่ม วิชา ให ม่\nDX223 Data Engineering\nหมวดความมั่นคงทางไซเบอร์ประยุกต์ หมวดความมั่นคงทางไซเบอร์ประยุกต์ ย้ายหมวดวิชา\nApplied Cybersecurity Applied Cybersecurity (วิชาบังคับ) กำหนดหมวด\nวิชาบังคับ\nดท.455 พื้นฐานความปลอดภัย 3 (3-0-6) ดท.340 พื้นฐานความปลอดภัย 3 (3-0-6) เปลี่ยนรหัสวิชา\nทางไซเบอร์ ทางไซเบอร์ และย้ายวิชา\nCyber Security Cyber Security บังคับ\nDX455 Fundamental DX340 Fundamental\nดท.456 การตรวจพสิูจน์ 3 (3-0-6) ดท.341 การตรวจพสิูจน์ 3 (3-0-6) เปลี่ยนรหัสวิชา\nพยานหลักฐานทาง พยานหลักฐานทาง และย้ายวิชา\nดิจิทัล ดิจิทัล บังคับ\nDX456 Digital Forensic DX341 Digital Forensic\nดท.457 การบริหารความ 3 (3-0-6) ดท.342 การบริหารความ 3 (3-0-6) เปลี่ยนรหัสวิชา\nต่อเนื่องทางธุรกิจ ต่อเนื่องทางธุรกิจ และย้ายวิชา\nDX457 Business Continuity DX342 Business Continuity บังคับ\nManagement Management\nดท.458 ความปลอดภัยของเน็ต 3 (3-0-6) ดท.343 ความปลอดภัยของเน็ต 3 (3-0-6) เปลี่ยนรหัสวิชา\nเวิร์ก เวิร์ก และย้ายวิชา\nDX458 Network Security DX343 Network Security บังคับ\nมคอ. 2 หลักสูตรวิทยาศาสตรบัณฑิต สาขาวิชาการแปรรูปธุรกจิทางดิจิทัล หน้า 66 หลักสูตร ฉบับ พ.ศ. 2561 หลักสูตร ฉบับ พ.ศ. 2566 สรุปการ\nเปลี่ยนแปลง\nดท.459 โครงงานความมั่นคงทาง 3 (0-0-18) ปิดวิชา\nไซเบอร์ประยุกต์\nDX459 Cybersecurity\nCapstone Project\nดท.344 โครงสร้างพื้นฐานสำคญั 3 (3 - 0 - 6) เพิ่ม วิชา\nDX344 Critical Infrastructure\nหมวดสื่อสร้างสรรค์ Creative Media หมวดสื่อสร้างสรรค์ Creative Media คงเดิม\nดท.475 พื้นฐานการเขียน 3 (3-0-6) ดท.475 พื้นฐานการเขียน 3 (3-0-6) คงเดิม\nโปรแกรมสื่อสร้างสรรค์ โปรแกรมสื่อสร้างสรรค์\nDX475 Fundamental of DX475 Fundamental of\nCreative Media Creative Media\nProgramming Programming\nดท.476 เทคโนโลยีดิจิทลั เพื่อการ 3 (3-0-6) ดท.476 เทคโนโลยีดิจิทลั เพื่อการ 3 (3-0-6) คงเดิม\nสร้างสรรคสื์่อใหม่สร้างสรรคสื์่อใหม่\nDX476 Digital Technology DX476 Digital Technology\nfor New Media for New Media\nCreation Creation\nดท.477 ทฤษฎีเกมเพื่องานสื่อ 3 (3-0-6) ดท.477 ทฤษฎีเกมเพื่องานสื่อ 3 (3-0-6) คงเดิม\nสร้างสรรค์ สร้างสรรค์\nDX477 Gamification for DX477 Gamification for\nCreative Media Creative Media\nดท.478 การวิจัยเพื่องานสื่อ 3 (3-0-6) ดท.478 การวิจัยเพื่องานสื่อ 3 (3-0-6) คงเดิม\nสร้างสรรค์ สร้างสรรค์\nDX478 Research for DX478 Research for\nCreative Media Creative Media\nดท.479 โครงงานด้านสื่อ 3 (3-0-6) ดท.479 โครงงานด้านสื่อ 3 (3-0-6) คงเดิม\nสร้างสรรค์ สร้างสรรค์\nDX479 Creative Media DX479 Creative Media\nCapstone Project Capstone Project\nวิชาเลือกเสรี 6 หน่วยกิต วิชาเลือกเสรี 6 หน่วยกิต กำหนดวิชาเลือกเสรี\nนักศึกษาสามารถเลือกศึกษาวิชาใดก็ได้ที่เปดิสอน นักศึกษาสามารถเลือกศึกษาวิชาใดก็ได้ที่เปิดสอน ที่หลักสูตรเปิดสอน\nในมหาวิทยาลัยธรรมศาสตร์วชิาเลือกเสรี ในมหาวิทยาลัยธรรมศาสตร์วิชาเลือกเสรีหรือ และกำหนดเงื่อนไข\nหรือเลือกศึกษาจากวิชาที่คณะเปดิสอนจำนวนไม่ เลือกศึกษาจากวิชาที่คณะเปิดสอนจำนวนไม่น้อย วิชาเลือกเสรีเพิ่ม\nน้อยกว่า 6 หน่วยกิต ทั้งนี้ให้หมายรวมถึงวิชา กว่า 6 หน่วยกิต ทั้งนี้ให้หมายรวมถึงวิชาศึกษา เติม โดยไม่สามารถ\nศึกษาทั่วไป หมวดภาษาต่างประเทศด้วย ทั่วไปหมวดภาษาต่างประเทศด้วย นำวิชาเลือกเสรีไป\nมคอ. 2 หลักสูตรวิทยาศาสตรบัณฑิต สาขาวิชาการแปรรูปธุรกจิทางดิจิทัล หน้า 67 หลักสูตร ฉบับ พ.ศ. 2561 หลักสูตร ฉบับ พ.ศ. 2566 สรุปการ\nเปลี่ยนแปลง\nนักศึกษาไมส่ำมารถนำวิชาต่อไปนมี้านับวิชา  นักศึกษาไม่สามารถนำวิชาในหลักสูตร วิชาเลือกได้\nเลือกเสรไีด้วิชาศึกษาทั่วไปที่รหัส ระดับ 100\n-วิชาในหลักสูตรวิชาศึกษาทั่วไปทั้งส่วนที่ 1 และ ไปวิชาเลือกเสรีได้หรือวิชาเลือก\nส่วนที่ 2 ที่ใช้รหัสย่อ “มธ.” ระดบั 100 คือ มธ. หรือวิชาโท\n100 - มธ.156\n นักศึกษาไมส่ำมารถนำรายวิชาเลอืกเสรี\nที่หลักสูตรเปดิสอนไปวิชาเลือกได้\nรายวิชาที่หลักสูตรเปิดสอน มีดังนี้\nดท.395 นวัตกรรมและ 3 (3-0-6) เปลี่ยนรหัสวิชาและ\nผู้ประกอบการ ย้า ย จำ ก วิชาบังคับ\nDX395 Innovation and\nEntrepreneurship\nดท.396 เศรษฐศาสตร์และการ 3 (3-0-6) เพิ่มวิชา\nวิเคราะหส์ ภาวะทาง\nธุรกิจ\nDX396 Economics and\nBusiness Condition\nAnalysis\nดท.397 กฎหมายธรุ กิจและ 3 (3-0-6) เปลี่ยนรหัสวิชาและ\nเทคโนโลยีสารสนเทศ ย้า ย จากวิชาบังคับ\nDX397 Business and\nInformation\nTechnology Laws\nดท.398 การบริหารโครงการ 3 (3 - 0 - 6) เป ลี่ย น ร หัส วิชา และ\nDX398 Project Management ย้ายจากวิชาบังคับ\nดท.399 การเงินและบัญชี 3 (3 - 0 - 6) เป ลี่ย น ร หัส วิชา และ\nDX399 Accounting and ย้ายจากวิชาบังคับ\nFinance\nมคอ. 2 หลักสูตรวิทยาศาสตรบัณฑิต สาขาวิชาการแปรรูปธุรกจิทางดิจิทัล หน้า 68 มคอ. 2 หลักสูตรวิทยาศาสตรบัณฑิต สาขาวิชาการแปรรูปธุรกจิทางดิจิทัล หน้า 69 ภาคผนวก 3 ตารางเทียบรายวิชาในหลักสูตรวิทยาศาสตรบัณฑิต สาขาวิชาการแปรรูปธุรกิจทาง\nดิจิทัล ฉบับปรับปรุง พ.ศ. 2561 กับ ฉบับปรับปรุง พ.ศ. 2566 (ใช้สำหรับหลักสูตรปรับปรุง)\nรายวิชาในหลักสูตร พ.ศ. 2561 รายวิชาในหลักสูตร พ.ศ. 2566\nรายวิชาที่เทียบได้รายวิชาที่เทียบได้\nหมวดการแก้ปัญหาเชิงสร้างสรรค์ (Creative หมวดการแก้ปัญหาเชิงสร้างสรรค์ (Creative\nProblem Solving) Problem Solving)\nดท.200 หลักการเขียนโปรแกรม (3 ห น่ว ย กิต) ด ท . 2 10 หลักการเขียนโปรแกรม (3 ห น่ว ย กิต)\nDX200 Principle of Programming DX210 Principle of Programming\nดท.201 คอมพิวเตอร์ซอฟต์แวรแ์ ละการประยุกต์ (3 ห น่ว ย กิต) ด ท . 211 คอมพิวเตอร์ซอฟต์แวรแ์ ละการประยุกต์ (3 ห น่ว ย กิต)\nDX201 Computer Software and DX211 Computer Software and\nApplications Applications\nดท.203 วิทยาการคอมพิวเตอร์ของการตัดสินใจ (3 ห น่ว ย กิต) ดท.213 วิทยาการคอมพิวเตอร์ของการตัดสินใจ (3 ห น่ว ย กิต)\nDX203 Computer Science of Human DX213 Computer Science of Human\nDecisions Decisions\nหมวดการคิดเชิงออกแบบ Design Thinking หมวดธุรกิจ นวัตกรรมและการคดิ เชิงออกแบบ\nBusiness, Innovation, and Design\nThinking\nดท.230 การคิดเชิงออกแบบขั้นพื้นฐาน (3 ห น่ว ย กิต) ด ท . 330 การคิดเชิงออกแบบขั้นพื้นฐาน (3 ห น่ว ย กิต)\nDX230 Design Thinking Fundamentals DX330 Design Thinking Fundamentals\nดท.232 การบริหารโครงการ (3 หน่วยกิต) ดท.398 การบริหารโครงการ (3 หน่วยกิต)\nDX232 Project Management DX398 Project Management\nดท.234 โครงงานการคิดเชิงออกแบบ (3 ห น่ว ย กิต) ด ท . 3 34 โครงงานด้านนวตักรรม (3 ห น่ว ย กิต)\nDX234 Design Thinking Capstone Project DX334 Innovation Capstone Project\nหมวดธุรกิจ นวัตกรรม และการประกอบการ วิชาเลือกเสรี\nBusiness, Innovation and\nEntrepreneurship\nดท.310 นวัตกรรมและผู้ประกอบการ (3 ห น่ว ย กิต) ด ท . 395 นวัตกรรมและผู้ประกอบการ (3 ห น่ว ย กิต)\nDX310 Innovation and Entrepreneurship DX395 Innovation and Entrepreneurship\nดท.312 การเงินและบัญชี (3 ห น่ว ย กิต) ด ท .399 การเงินและบัญชี (3 ห น่ว ย กิต)\nDX312 Accounting and Finance DX399 Accounting and Finance\nดท.313 กฎหมายธุรกิจและเทคโนโลยสีารสนเทศ (3 ห น่ว ย กิต) ด ท .3 97 กฎหมายธุรกิจและเทคโนโลยสีารสนเทศ (3 ห น่ว ย กิต)\nDX313 Business and Information DX397 Business and Information\nTechnology Laws Technology Laws\nหมวดการแปรรูปดิจิทัล Digital Transformation หมวดการแปรรูปดิจิทัล Digital Transformation\nดท.320 กลยุทธ์การแปรรูปทำงดจิทัล (3 ห น่ว ย กิต) ด ท . 451 กลยุทธ์การแปรรูปทำงดจิทัล (3 ห น่ว ย กิต)\nDX320 Digital Transformation Strategy DX451 Digital Transformation Strategy\nมคอ. 2 หลักสูตรวิทยาศาสตรบัณฑิต สาขาวิชาการแปรรูปธุรกจิทางดิจิทัล หน้า 70 รายวิชาในหลักสูตร พ.ศ. 2561 รายวิชาในหลักสูตร พ.ศ. 2566\nดท.324 โครงงานด้านการแปรรูปทางดิจิทัล (3 ห น่ว ย กิต) ด ท . 454 โครงงานด้านการแปรรูปทางดิจิทัล (3 ห น่ว ย กิต)\nDX324 Digital Transformation Capstone DX454 Digital Transformation Capstone\nProject Project\nการฝึกปฏิบัติงาน การฝึกปฏิบัติงาน\nดท.380 การฝึกปฏิบัติงานด้านธุรกิจดิจิทัล (3 หน่วยกิต) ดท.380 การฝึกปฏิบัติงานด้านธุรกิจดิจิทัล (3 หน่วยกิต)\nDX380 Internships for Digital Business (135 hrs.) DX380 Internships for Digital Business (135 hrs.)\nหมวดการตลาดดิจิทัล Digital Marketing หมวดการตลาดดิจิทัล Digital Marketing\nดท.460 พฤติกรรมผู้บริโภคในยุคดิจิทัล (3 ห น่ว ย กิต) ด ท . 465 พฤติกรรมผู้บริโภคในยุคดิจิทัล (3 ห น่ว ย กิต)\nDX460 Digital Consumers Behavior DX465 Digital Consumers Behavior\nดท.461 การสร้างแบรนด์และการมีส่วนร่วม (3 ห น่ว ย กิต) ด ท .4 66 การสร้างแบรนด์และการมีส่วนร่วม (3 ห น่ว ย กิต)\nDX461 Digital Branding and Engagement DX466 Digital Branding and Engagement\nดท.462 การบรหิารชื่อเสียงในยุคดิจิทัล (3 ห น่ว ย กิต) ด ท . 467 การบรหิารชื่อเสียงในยุคดิจิทัล (3 ห น่ว ย กิต)\nDX462 Digital Reputation Management DX467 Digital Reputation Management\nดท.463 กลยุทธ์การตลาดออนไลน์ (3 ห น่ว ย กิต) ด ท .4 68 กลยุทธ์การตลาดดิจิทลั (3 ห น่ว ย กิต)\nDX463 Online Marketing Strategy DX468 Digital Marketing Strategy\nดท.464 การบรหิารแบรนด์เชิงกลยุทธ์ (3 ห น่ว ย กิต) ด ท .4 69 การบรหิารแบรนด์เชิงกลยุทธ์ (3 ห น่ว ย กิต)\nDX464 Strategic Brand Management DX469 Strategic Brand Management\nหมวดการวิเคราะห์ทางธุรกิจ Business หมวดการวิเคราะห์ทางธุรกิจ Business\nAnalytics Analytics\nดท.445 การสา รวจและการเตรียมข้อมูล (3 ห น่ว ย กิต) ด ท . 220 การสา รวจและการเตรียมข้อมูล (3 ห น่ว ย กิต)\nDX445 Data Exploration and Preprocessing DX220 Data Exploration and Preprocessing\nดท.446 อัลกอริทึมของวิทยาศาสตร์ข้อมูล (3 ห น่ว ย กิต) ด ท . 221 อัลกอริทึมของวิทยาศาสตร์ข้อมูล (3 ห น่ว ย กิต)\nDX446 Data Science Algorithms DX221 Data Science Algorithms\nดท.447 ระบบธรุ กิจอัจฉรยิะ (3 ห น่ว ย กิต) ด ท .2 22 ระบบธรุ กิจอัจฉรยิะ (3 ห น่ว ย กิต)\nDX447 Business Intelligence DX222 Business Intelligence\nดท.449 โครงงานด้านการวิเคราะห์ข้อมูลสำหรับ (3 หน่วยกิต) ดท.224 โครงงานด้านการวิเคราะห์ข้อมูลสำหรับ (3 หน่วยกิต)\nธุรกิจ ธุรกิจ\nDX449 Business Analytics Capstone DX224 Business Analytics Capstone\nProject Project\nหมวดความมั่นคงทางไซเบอร์ประยุกต์ หมวดความมั่นคงทางไซเบอร์ประยุกต์\nApplied Cybersecurity Applied Cybersecurity\nดท.455 พื้นฐานความปลอดภัยทางไซเบอร์ (3 ห น่ว ย กิต) ด ท . 340 พื้นฐานความปลอดภัยทางไซเบอร์ (3 ห น่ว ย กิต)\nDX455 Cyber Security Fundamental DX340 Cyber Security Fundamental\nดท.456 การตรวจพิสูจน์พยานหลกัฐานทางดิจิทัล (3 ห น่ว ย กิต) ด ท . 341 การตรวจพิสูจน์พยานหลกัฐานทางดิจิทัล (3 ห น่ว ย กิต)\nDX456 Digital Forensic DX341 Digital Forensic\nดท.457 การบรหิารความต่อเนื่องทางธุรกิจ (3 ห น่ว ย กิต) ด ท .3 42 การบรหิารความต่อเนื่องทางธุรกิจ (3 ห น่ว ย กิต)\nDX457 Business Continuity Management DX342 Business Continuity Management\nมคอ. 2 หลักสูตรวิทยาศาสตรบัณฑิต สาขาวิชาการแปรรูปธุรกจิทางดิจิทัล หน้า 71 รายวิชาในหลักสูตร พ.ศ. 2561 รายวิชาในหลักสูตร พ.ศ. 2566\nดท.458 ความปลอดภัยของเนต็ เวริ์ก (3 ห น่ว ย กิต) ด ท . 343 ความปลอดภัยของเนต็ เวริ์ก (3 ห น่ว ย กิต)\nDX458 Network Security DX343 Network Security\nหมวดสื่อสร้างสรรค์ Creative Media หมวดสื่อสร้างสรรค์ Creative Media\nดท.475 พื้นฐานการเขียนโปรแกรมสื่อสร้างสรรค์ (3 หน่วยกิต) ดท.475 พื้นฐานการเขียนโปรแกรมสื่อสร้างสรรค์ (3 หน่วยกิต)\nDX475 Fundamental of Creative Media DX475 Fundamental of Creative Media\nProgramming Programming\nดท.476 เทคโนโลยดีิจิทัลเพื่อการสร้างสรรคสื์่อ (3 หน่วยกิต) ดท.476 เทคโนโลยดีิจิทัลเพื่อการสร้างสรรคสื์่อ (3 หน่วยกิต)\nใหม่ ใหม่\nDX476 Digital Technology for New Media DX476 Digital Technology for New Media\nCreation Creation\nดท.477 ทฤษฎีเกมเพื่องานสื่อสร้างสรรค์ (3 หน่วยกิต) ดท.477 ทฤษฎีเกมเพื่องานสื่อสร้างสรรค์ (3 หน่วยกิต)\nDX477 Gamification for Creative Media D X 4 7 7 Gamification for Creative Media\nดท.478 การวิจัยเพื่องานสื่อสร้างสรรค์ (3 ห น่ว ย กิต) ด ท . 4 7 8 การวิจัยเพื่องานสื่อสร้างสรรค์ (3 ห น่ว ย กิต)\nDX478 Research for Creative Media DX478 Research for Creative Media\nดท.479 โครงงานด้านสื่อสร้างสรรค์ (3 ห น่ว ย กิต) ด ท .4 79 โครงงานด้านสื่อสร้างสรรค์ (3 ห น่ว ย กิต)\nDX479 Creative Media Capstone Project DX479 Creative Media Capstone Project\nรายวิชาที่เทียบไม่ได้\nดท.202 การแก้ปัญหาอย่างสร้างสรรค์และการคดิ (3 หน่วยกิต) ดท.212 การเขียนโปรแกรมบนอปุ กรณ์เคลื่อนที่ (3 หน่วยกิต)\nเชิงวิพากย์ DX212 Mobile Programming\nDX202 Creative Problem Solving and\nCritical Thinking\nดท.204 การตัดสินใจด้วยข้อมูล (3 หน่วยกิต) ดท.214 การจัดการองค์กรดจิทัล (3 หน่วยกิต)\nDX204 Data-Driven Decision Making DX214 Managing Digital Firm\nดท.231 หลักการออกแบบสำหรับมนุษย์ (3 หน่วยกิต) ดท.223 วิศวกรรมข้อมูล (3 หน่วยกิต)\nDX231 Principles of Designing for Humans DX223 Data Engineering\nดท.233 การออกแบบการบริการ (3 หน่วยกิต) ดท.331 การจัดการนวัตกรรม (3 หน่วยกิต)\nDX233 Service Design DX331 Innovation Management\nดท.311 การตลาดเชิงสร้างสรรค์ (3 หน่วยกิต) ดท.332 การออกแบบ UX/UI (3 หน่วยกิต)\nDX311 Innovative Marketing DX332 UX/UI Design\nดท.314 การบรหิารเชิงกลยุทธ์ (3 ห น่ว ย กิต) ด ท .3 33 การจัดการการเงินสำหรบันวัตกรรม (3 หน่วยกิต)\nDX314 Strategic Management DX333 Financial Management for\nInnovation\nดท.321 เทคโนโลยีและโดเมนการแปรรูปดจิทัล (3 ห น่ว ย กิต) ด ท .3 44 โครงสร้างพื้นฐานสำคัญ (3 หน่วยกิต)\nDX321 Digital Transformation Domain and DX344 Critical Infrastucture\nTechnology\nดท.322 การนำในยุคดิจิทัล (3 ห น่ว ย กิต) ด ท . 4 50 เทคโนโลยีอุบัติใหม่และแบบจำลองธุรกิจ (3 หน่วยกิต)\nDX322 Digital Leadership ดิจิทัล\nมคอ. 2 หลักสูตรวิทยาศาสตรบัณฑิต สาขาวิชาการแปรรูปธุรกจิทางดิจิทัล หน้า 72 รายวิชาในหลักสูตร พ.ศ. 2561 รายวิชาในหลักสูตร พ.ศ. 2566\nDX450 Emerging technologies and Digital\nBusiness Model\nดท.323 แบบจำลองธุรกิจดิจิทัล (3 ห น่ว ย กิต) ด ท . 452 พฤติกรรมองค์กรในยุคดจิทัลและภาวะ (3 หน่วยกิต)\nDX323 Digital Business Model ผู้นำความเปลี่ยนแปลง\nDX452 Digital Organizational Behavior and\nTransformational Leadership\nดท.448 การวิเคราะห์การตลาด (3 ห น่ว ย กิต) ด ท . 453 การสมัมนาเทคโนโลยีดจิทิัลขั้นสูง (3 หน่วยกิต)\nDX448 Marketing Analytics DX453 Advanced Digital Technology\nSeminar\nดท.459 โครงงานความมั่นคงทางไซเบอร์ประยุกต์ (3 ห น่ว ย กิต)\nDX459 Cybersecurity Capstone Project\nมคอ. 2 หลักสูตรวิทยาศาสตรบัณฑิต สาขาวิชาการแปรรูปธุรกจิทางดิจิทัล หน้า 73 ภาคผนวก 4 เอกสารที่เกี่ยวข้องกับการออกแบบหลักสูตรตามแนวทาง OBE (ถ้ามี)\nผลลัพธ์การเรียนรู้ของหลักสูตร (PLOs)\nรายวิชา ความรู้ทักษะ จริยธรรม ลักษณะส่วนบุคคล\n1 2 3 4 5 1 2 3 4 5 6 7 1 2 1 2 3 4\nวิชาศึกษาทั่วไป\nดท. 100 นวัตกรรมดิจิทัล\n/ / /\nDX 100 Digital Innovation\nมธ. 100 พลเมืองกับการลงมือแก้ปัญหา\n/ /\nTU 100 Civic Engagement\nมธ. 101 โลก อาเซียน และไทย\n/\nTU 101 Thailand, ASEAN, and the World\nมธ. 103 ชีวิตกับความยั่งยืน\n/\nTU 103 Life and Sustainability\nมธ. 106 ความคิดสร้างสรรค์และการสื่อสาร\n/\nTU 106 Creativity and Communication\nมธ. 107 ทักษะดิจิทัลกับการแก้ปัญหา\n/ /\nTU 107 Digital Skill and Problem Solving\nมธ. 109 นวัตกรรมกับกระบวนคดิผู้ประกอบการ\n/ /\nTU 109 Innovation and Entrepreneurial mindset\nมธ. 124 สังคมและเศรษฐกิจ\n/\nTU 124 Society and Economy\nมธ. 155 สถิติพื้นฐาน\n/\nTU 155 Elementary Statistics\nมคอ. 2 หลักสูตรวิทยาศาสตรบัณฑิต สาขาวิชาการแปรรูปธุรกจิทางดิจิทัล หน้า 74 ผลลัพธ์การเรียนรู้ของหลักสูตร (PLOs)\nรายวิชา ความรู้ทักษะ จริยธรรม ลักษณะส่วนบุคคล\n1 2 3 4 5 1 2 3 4 5 6 7 1 2 1 2 3 4\nมธ. 156 การเขียนโปรแกรมเชิงวิทยาศาสตร์เบื้องต้น\n/ /\nTU 156 Introduction to Scientific Programming\nมธ. 200 พลเมืองกับการลงมือแก้ปัญหาโดยออกแบบการ\nเรียนรเู้อง / /\nTU 200 Self Design Civic Engagement\nมธ. 240 เศรษฐกิจภมูิรัฐศาสตร์โลก\n/\nTU 240 World Geopolitical Economy\nมธ. 243 ทักษะดิจิตอลเพื่ออนาคต\n/\nTU 243 Digital Skills for the Future\nสษ. 105 ทักษะการสื่อสารทางภาษาอังกฤษ\n/\nEL 105 English Communication Skills\nวธ.101 การวางแผนการเงินเพื่อความมั่นคงในการดำรงชีพ\nDE 101 Financial planning for economic stability in /\nlife\nวิชาบังคับ\nหมวดการแก้ปัญหาเชิงสร้างสรรค์ Creative Problem Solving\nดท.210 หลักการเขียนโปรแกรม\n/ / /\nDX210 Principle of Programming\nดท.211 คอมพิวเตอร์ซอฟต์แวร์และการประยุกต์\n/ / /\nDX211 Computer Software and Applications\nดท.212 การเขียนโปรแกรมบนอุปกรณ์เคลอื่นที่ / / /\nมคอ. 2 หลักสูตรวิทยาศาสตรบัณฑิต สาขาวิชาการแปรรูปธุรกจิทางดิจิทัล หน้า 75 ผลลัพธ์การเรียนรู้ของหลักสูตร (PLOs)\nรายวิชา ความรู้ทักษะ จริยธรรม ลักษณะส่วนบุคคล\n1 2 3 4 5 1 2 3 4 5 6 7 1 2 1 2 3 4\nDX212 Mobile Programming\nดท.213 วิทยาการคอมพิวเตอร์ของการตัดสินใจ\n/ / /\nDX213 Computer Science of Human Decisions\nดท.214 การจัดการองค์กรดิจิทลั\n/ / /\nDX214 Managing Digital Firm\nหมวดการวิเคราะห์ทางธุรกิจ Business Analytics\nดท.220 การสำรวจและการเตรยีมข้อมูล\n/ / /\nDX220 Data Exploration and Preprocessing\nดท.221 อัลกอริทึมของวิทยาศาสตร์ข้อมลู / /\n/\nDX221 Data Science Algorithms\nดท.222 ระบบธุรกิจอัจฉริยะ / /\n/\nDX222 Business Intelligence\nดท.223 วิศวกรรมข้อมลู\n/ /\nDX223 Data Engineering\nดท.224 โครงงานด้านการวเิคราะห์ข้อมลู สา หรับธุรกิจ\n/ / / /\nDX224 Business Analytics Capstone Project\nหมวดธุรกิจ นวัตกรรมและการคดิ เชิงออกแบบ Business, Innovation, and Design Thinking\nดท.330 หลักการคดิ เชิงออกแบบ\n/ / / /\nDX330 Principles of Design Thinking\nดท.331 การจัดการนวัตกรรม\n/ / / /\nDX331 Innovation Management\nมคอ. 2 หลักสูตรวิทยาศาสตรบัณฑิต สาขาวิชาการแปรรูปธุรกจิทางดิจิทัล หน้า 76 ผลลัพธ์การเรียนรู้ของหลักสูตร (PLOs)\nรายวิชา ความรู้ทักษะ จริยธรรม ลักษณะส่วนบุคคล\n1 2 3 4 5 1 2 3 4 5 6 7 1 2 1 2 3 4\nดท.332 การออกแบบ UX/UI\n/ / / /\nDX332 UX/UI Design\nดท.333 การจัดการการเงินสำหรบันวัตกรรม\n/ / / /\nDX333 Financial Management for Innovation\nดท.334 โครงงานด้านนวัตกรรม\n/ / /\nDX334 Innovation Capstone Project\nหมวดความมั่นคงทางไซเบอร์ประยุกต์ Applied Cybersecurity\nดท.340 พื้นฐานความปลอดภัยทางไซเบอร์\n/ / /\nDX340 Cyber Security Fundamental\nดท.341 การตรวจพสิูจน์พยานหลักฐานทางดิจิทัล\n/ / /\nDX341 Digital Forensic\nดท.342 การบริหารความต่อเนื่องทางธุรกิจ\n/\nDX342 Business Continuity Management\nดท.343 ความปลอดภัยของเน็ตเวริ์ก\n/ / /\nDX343 Network Security\nดท.344 โครงสร้างพื้นฐานสำคญั\n/ / /\nDX344 Critical Infrastructure\nการฝึกปฏิบัติงาน\nดท.380 การฝึกปฏิบัติงานด้านธรุ กิจดิจิทลั\nDX380 Internships for Digital Business / / / /\nมคอ. 2 หลักสูตรวิทยาศาสตรบัณฑิต สาขาวิชาการแปรรูปธุรกจิทางดิจิทัล หน้า 77 ผลลัพธ์การเรียนรู้ของหลักสูตร (PLOs)\nรายวิชา ความรู้ทักษะ จริยธรรม ลักษณะส่วนบุคคล\n1 2 3 4 5 1 2 3 4 5 6 7 1 2 1 2 3 4\nหมวดการแปรรูปดิจิทัล Digital Transformation\nดท.450 เทคโนโลยีอุบัติใหม่และแบบจำลองธุรกิจดิจิทัล\nDX450 Emerging technologies and Digital Business / /\nModel\nดท.451 กลยุทธ์การแปรรูปทางดิจิทลั\n/ / /\nDX451 Digital Transformation Strategy\nดท.452 พฤติกรรมองค์กรในยคุ ดิจิทลั และภาวะผู้นำความ\nเปลยี่นแปลง\n/ / / /\nDX452 Digital Organizational Behavior and\nTransformational Leadership\nดท.453 การสัมมนาเทคโนโลยีดิจิทลัขั้นสูง\n/ / /\nDX453 Advanced Digital Technology Seminar\nดท.454 โครงงานด้านการแปรรูปทางดิจิทลั\n/ / / / /\nDX454 Digital Transformation Capstone Project\nวิชาเลือก\nหมวดการตลาดดิจิทัล Digital Marketing\nดท.465 พฤติกรรมผู้บรโิภคในยุคดิจิทัล\n/ /\nDX465 Digital Consumers Behavior\nดท.466 การสร้างแบรนด์และการมสี่วนร่วม\n/ /\nDX466 Digital Branding and Engagement\nมคอ. 2 หลักสูตรวิทยาศาสตรบัณฑิต สาขาวิชาการแปรรูปธุรกจิทางดิจิทัล หน้า 78 ผลลัพธ์การเรียนรู้ของหลักสูตร (PLOs)\nรายวิชา ความรู้ทักษะ จริยธรรม ลักษณะส่วนบุคคล\n1 2 3 4 5 1 2 3 4 5 6 7 1 2 1 2 3 4\nดท.467 การบริหารชื่อเสียงในยุคดิจิทัล\n/ /\nDX467 Digital Reputation Management\nดท.468 กลยุทธ์การตลาดดิจิทัล\n/ / /\nDX468 Digital Marketing Strategy\nดท.469 การบริหารแบรนด์เชิงกลยุทธ์\n/\nDX469 Strategic Brand Management\nหมวดสื่อสร้างสรรค์ Creative Media\nดท.475 พื้นฐานการเขียนโปรแกรมสื่อสร้างสรรค์\nDX475 Fundamental of Creative Media / / /\nProgramming\nดท.476 เทคโนโลยีดิจิทลั เพื่อการสร้างสรรค์สื่อใหม่\n/ / /\nDX476 Digital Technology for New Media Creation\nดท.477 ทฤษฎีเกมเพื่องานสื่อสร้างสรรค์\n/ / /\nDX477 Gamification for Creative Media\nดท.478 การวิจัยเพื่องานสื่อสร้างสรรค์\n/ /\nDX478 Research for Creative Media\nดท.479 โครงงานด้านสื่อสร้างสรรค์\n/ /\nDX479 Creative Media Capstone Project\nวิชาเลือกเสรี\nดท.395 นวัตกรรมและผู้ประกอบการ / / /\nมคอ. 2 หลักสูตรวิทยาศาสตรบัณฑิต สาขาวิชาการแปรรูปธุรกจิทางดิจิทัล หน้า 79 ผลลัพธ์การเรียนรู้ของหลักสูตร (PLOs)\nรายวิชา ความรู้ทักษะ จริยธรรม ลักษณะส่วนบุคคล\n1 2 3 4 5 1 2 3 4 5 6 7 1 2 1 2 3 4\nDX395 Innovation and Entrepreneurship\nดท.396 เศรษฐศาสตร์และการวิเคราะหส์ ภาวะทางธุรกิจ\n/ / /\nDX396 Economics and Business Condition Analysis\nดท.397 กฎหมายธรุ กิจและเทคโนโลยสีารสนเทศ\n/ /\nDX397 Business and Information Technology Laws\nดท.398 การบริหารโครงการ\n/ / / /\nDX398 Project Management\nดท.399 การเงินและบัญชี\n/ /\nDX399 Accounting and Finance\nมคอ. 2 หลักสูตรวิทยาศาสตรบัณฑิต สาขาวิชาการแปรรูปธุรกจิทางดิจิทัล หน้า 80"
}