{
    "หมวดที่ 1": "รายละเอียดของหลักสตู ร\nหลักสูตร หลักสูตรศิลปศาสตรบัณฑิต สาขาวิชานวัตกรรมการบริการ\n(หลักสูตรนานาชาติ / หลักสูตรปรับปรุง พ.ศ. 2566)\nชื่อสถาบันอดุ มศึกษา มหาวิทยาลัยธรรมศาสตร์\nคณะ/วิทยาลัย/สถาบัน วิทยาลัยนวัตกรรม\nหมวดที่ 1 ข้อมูลทวั่ ไป\n1.1 รหัสและชื่อหลักสูตร\nรหัสหลักสูตร : 25570051102405\nชื่อหลักสูตร\nภาษาไทย : หลักสูตรศิลปศาสตรบัณฑิต สาขาวิชานวัตกรรมการบริการ\n(หลักสูตรนานาชาติ)\nภาษาอังกฤษ : Bachelor of Arts Program in Service Innovation\n(International Program)\n1.2 ชื่อปริญญาและสาขาวิชา\nภาษาไทย: ชื่อเต็ม ศิลปศาสตรบัณฑิต (นวัตกรรมการบริการ)\nชื่อย่อ ศศ.บ. (นวัตกรรมการบริการ)\nภาษาอังกฤษ: ชื่อเต็ม Bachelor of Arts (Service Innovation)\nชื่อย่อ B.A. (Service Innovation)\n1.3 วิชาเอก (ถ้ามี) - ไม่มี -\n1.4 รูปแบบของหลักสูตร\n1.4.1 รูปแบบ\n\n<exclude> หลักสูตรระดับปริญญาตรี (ต่อเนื่อง)</exclude>\n\n<include> หลักสูตรระดับปริญญาตรี 4 ปี</include>\n\n<exclude> หลักสูตรระดับปริญญาตรี 5 ปี</exclude>\n\n<exclude> หลักสูตรระดับปริญญาตรี 6 ปี</exclude>\nมคอ. 2 หลักสูตรศิลปศาสตรบัณฑิต สาขาวิชานวัตกรรมการบริการ (หลักสูตรนานาชาติ) หน้า 1 1.4.2 ประเภทของหลักสูตร\n\n<include> หลักสูตรปริญญาตรีทางวิชาการ</include>\n\n<exclude> หลักสูตรปริญญาตรีแบบก้าวหน้าทางวิชาการ</exclude>\n\n<exclude> หลักสูตรปริญญาตรีทางวิชาชีพหรือปฏิบัติการ</exclude>\n\n<exclude> หลักสูตรปริญญาตรีแบบก้าวหน้าทางวิชาชีพหรือปฏิบัติการ</exclude>\n1.4.3 ภาษาที่ใช้\n\n<exclude> จัดการศึกษาภาษาไทย</exclude>\n\n<include> จัดการศึกษาภาษาอังกฤษ</include>\n\n<exclude> จัดการศึกษาทั้งภาษาไทยและภาษาอังกฤษ</exclude>\n\n<exclude> จัดการศึกษาภาษาต่างประเทศ ระบุ..</exclude>\n1.4.4 ความร่วมมือกับสถาบันอื่น\n\n<include> หลักสูตรของสถาบันโดยเฉพาะ</include>\n\n<exclude> หลักสูตรที่ได้รับความร่วมมือสนับสนุนจากสถาบันอื่น หรือ หลักสูตรร่วมกับสถาบัน</exclude>\nอื่น ระบุ (โดยต้องระบุชื่อสถาบันการศึกษา/หน่วยงานที่ทำความร่วมมือ\nพร้อมทั้งแนบ MOU)\n1.4.5 การให้ปริญญาแก่ผู้สำเร็จการศึกษา\n\n<include> ให้ปริญญาเพียงสาขาวิชาเดียว</include>\n\n<exclude> ให้ปริญญามากกว่า 1 สาขาวิชา (เช่น ทวิปริญญา) หรือปริญญาร่วมระหว่าง</exclude>\nสถาบันอุดมศึกษา)\n1.4.6 สถานภาพของหลักสูตรและการพิจารณาอนุมัติ/เห็นชอบหลักสูตร\nหลักสูตรศิลปศาสตรบัณฑิต สาขาวิชานวัตกรรมการบริการ (หลักสูตรนานาชาติ /หลักสูตร\nปรับปรุง พ.ศ. 2566) ปรับปรุงจากหลักสูตรศิลปศาสตรบัณฑิต สาขาวิชานวัตกรรมการบริการ (หลักสูตร\nนานาชาติ / หลักสูตรปรับปรุง พ.ศ.2561)\nกำหนดเปิดสอนในภาคการศึกษาที่ 1 ปีการศึกษา 2566\nได้พิจารณากลั่นกรองโดยคณะกรรมการนโยบายวิชาการ ในการประชุมครั้งที่ 1/2566\nเมื่อวันที่ 1 เดือน มีนาคม พ.ศ. 2566\nได้รับอนุมัต/ิ เห็นชอบหลักสูตรจากสภามหาวิทยาลัย ในการประชุมครั้งที่ 5/2566\nเมื่อวันที่ 25 เดือน เมษายน พ.ศ. 2566\nมคอ. 2 หลักสูตรศิลปศาสตรบัณฑิต สาขาวิชานวัตกรรมการบริการ (หลักสูตรนานาชาติ) หน้า 2 1.5 อาชีพที่สามารถประกอบได้หลังสำเร็จการศึกษา\n1.5.1 พนักงานฝ่ายลูกค้าสัมพันธ์ ฝ่ายบริการของโรงแรม สายการบิน และธุรกิจนำเที่ยว\n1.5.2 พนักงานฝ่ายบริการของโรงพยาบาล\n1.5.3 พนักงานฝ่ายบริการของธนาคาร สถาบันการเงิน\n1.5.4 พนักงานฝ่ายการวางแผนการจัดงานอีเวนท์\n1.5.5 เจ้าของธุรกิจที่เกี่ยวข้องกับการบริการ\n1.6 สถานที่จัดการเรียนการสอน\n\n<exclude> ศูนย์รังสิต</exclude>\n\n<include> ท่าพระจันทร์</include>\n\n<exclude> ศูนย์พัทยา</exclude>\n\n<exclude> ศูนย์ลำปาง</exclude>\n1.7 ค่าใช้จ่ายตลอดหลักสูตร\nประเภทโครงการ\n\n<exclude> โครงการปกติ</exclude>\n\n<include> โครงการพิเศษ</include>\n\n<exclude> โครงการปกติและโครงการพิเศษ</exclude>\nค่าใช้จ่ายตลอดหลักสูตร\n\n<include> นักศึกษาไทย 444,680 บาท</include>\n\n<include> นักศึกษาต่างชาติ 511,945 บาท</include>\nค่าใช้จ่ายต่อหัวนักศึกษาตลอดระยะเวลาหลักสูตร คือ 444,680 บาทต่อคน โดยมีการบริหาร\nจัดการโครงการบริการการศึกษา (เพื่อรับปริญญา) (โครงการพิเศษ) นักศึกษามีค่าใช้จ่ายหลักได้แก่\nค่าหน่วยกิต ๆ ละ 2,500 บาท และค่าธรรมเนียมอื่น ๆ ของวิทยาลัยนวัตกรรม รายละเอียดดังนี้\nค่าธรรมเนียมพิเศษ ภาคการศึกษาปกติภาคฤดูร้อน (ถ้ามี)\nสำหรับนักศึกษาไทย (ยกเว้นภาคฤดูร้อน) 10,000 บาท -\nสำหรับนักศึกษาต่างชาติ (ยกเว้นภาคฤดูร้อน) 10,000 บาท -\nทั้งนี้ค่าใช้จ่ายต่อหัวนักศึกษาตลอดระยะเวลาหลักสูตรนี้ยังไม่รวมค่าใช้จ่ายในการศึกษาดูงาน\nต่างประเทศ\nมคอ. 2 หลักสูตรศิลปศาสตรบัณฑิต สาขาวิชานวัตกรรมการบริการ (หลักสูตรนานาชาติ) หน้า 3",
    "หมวดที่ 2": "หมวดที่ 2 คุณสมบัติผู้เข้าศึกษา\n2.1 การรับเข้าศึกษา\n\n<exclude> รับเฉพาะนักศึกษาไทย</exclude>\n\n<exclude> รับทั้งนักศึกษาไทยและนักศึกษาต่างชาติที่สามารถใช้ภาษาไทยได้ดี</exclude>\n\n<include> รับทั้งนักศึกษาไทยและนักศึกษาต่างชาติ</include>\n2.2 คุณสมบัติของผู้เข้าศึกษา\nคุณสมบัติของผู้เข้าศึกษาต้องไปตามข้อบังคับมหาวิทยาลัยธรรมศาสตร์ ว่าด้วยการศึกษา\nชั้นปริญญาตรีพ.ศ. 2561 ข้อ 14\nการคัดเลือกผู้เข้าศึกษา\n• การคัดเลือกผู้เข้าศึกษาให้ไปตามระเบียบคัดเลือกเพื่อเข้าศึกษาในสถาบันการศึกษาขั้น\nอุดมศึกษาของส่วนราชการหรือหน่วยงานอื่นดำเนินการตามการมอบหมายของมหาวิทยาลัย\nหรือตามข้อตกลง หรือการคัดเลือกตามวิธีการที่มหาวิทยาลัยกำหนดโดยความเห็นชอบของ\nสภามหาวิทยาลัยและออกประกาศมหาวิทยาลัย\n• ต้องมีคะแนนสอบภาษาอังกฤษไปตามประกาศที่วิทยาลัยกำหนด\n• ในกรณีที่นักศึกษาต่างชาติผู้ที่มีสัญชาติและมีถิ่นฐานอยู่ในประเทศที่ใช้ภาษาอังกฤษ\nภาษาราชการ จะได้รับการพิจารณายกเว้นไม่จำต้องส่งผลทดสอบภาษาอังกฤษ ซึ่งมี\nรายชื่อประเทศดังนี้ออสเตรเลีย สหราชอาณาจักร นิวซีแลนด์ ไอร์แลนด์ แคนาดา และ\nสหรัฐอเมริกา\n2.3 แผนการรับนักศึกษาและผู้สำเร็จการศึกษาในระยะ 5 ปี\nในแต่ละปีการศึกษาจะรับนักศึกษาปีละ 60 คน\nจำนวนนักศึกษาแต่ละปีการศึกษา\nจำนวนนักศึกษา\n2566 2567 2568 2569 2570\nชั้นปีที่ 1 60 60 60 60 60\nชั้นปีที่ 2 60 60 60 60\nชั้นปีที่ 3 60 60 60\nชั้นปีที่ 4 60 60\nรวม 60 120 180 240 240\nคาดว่าจะจบการศึกษา - - - 60 60\nมคอ. 2 หลักสูตรศิลปศาสตรบัณฑิต สาขาวิชานวัตกรรมการบริการ (หลักสูตรนานาชาติ) หน้า 4",
    "หมวดที่ 3": "หมวดที่ 3 ปรัชญา วัตถปุ ระสงค์ และผลลัพธก์ารเรียนรู้ของหลักสูตร\n3.1 ความสอดคล้องของหลักสูตรกับทิศทางนโยบายและยุทธศาสตร์การพัฒนากำลังคน และ\nยุทธศาสตร์มหาวิทยาลัย\nเนื่องด้วยมหาวิทยาลัยธรรมศาสตร์ได้มีการประกาศทิศทางนโยบายและยุทธศาสตร์การพัฒนา\nกำลังคน และยุทธศาสตร์มหาวิทยาลัย หลักสูตรนวัตกรรมการบริการ (นานาชาติ) ให้ความสำคัญในการ\nพัฒนาหลักสูตรและการจัดการเรียนการสอนเพื่อให้มีความสอดคล้องกับทิศทางนโยบายการพัฒนาและ\nยุทธศาสตร์ฯ มุ่งเน้นการส่งเสริมและพัฒนาคุณภาพการศึกษาและองค์ความรู้ที่สามารถตอบสนองต่อ\nความเปลี่ยนแปลงในบริบทต่างๆ ทั้งในระดับประเทศและระดับนานาชาติ\nเมื่อพิจารณาถึงยุทธศาสตร์ที่ 1 ด้านการพัฒนากำลังคนแห่งอนาคต (Future Workforce)\nหลักสูตรนวัตกรรมการบริการ (นานาชาติ) มีการวิเคราะห์ถึงสถานการณ์ที่เกี่ยวข้องในภาคอุตสาหกรรม\nการบริการมีอัตราการขยายตัวสูงมากขึ้นเรื่อยๆ และกลายภาคอุตสาหกรรมที่มีความสำคัญที่ส่งผลต่อ\nการเจริญเติบโตทางเศรษฐกิจของประเทศต่างๆทั่วโลก (Global Community) โดยภายใต้ประชาคม\nเศรษฐกิจอาเซียน (ASEAN Economic Community – AEC) มีการกำหนดเป้าหมายในการเปิดเสรีใน\nอุตสาหกรรมการบริการประเภทต่าง ๆ 12 ประเภท คือ การบริการด้านธุรกิจ (Business Services) การ\nบริการสื่อสาร (Communication Services) การบริการด้านที่เกี่ยวเนื่องกับวิศวกรรมและการก่อสร้าง\n(Construction and related engineering Services) การกระจายสินค้าและบริการ (Distribution\nServices) การบริการการศึกษา (Educational Services) การบริการด้านสิ่งแวดล้อม (Environmental\nServices) การบริการด้านการเงิน (Financial Services) การให้บริการด้านสังคมและสุขอนามัย\n(Health-related and Social Services) การให้บริการด้านท่องเที่ยว และที่เกี่ยวเนื่องกับการเดินทาง\n(Tourism and Travel-related Services) การให้บริการด้านการกีฬา วัฒนธรรมและสันทนาการ\n(Recreational, cultural, and sporting services) การให้บริการขนส่ง (Transport Services) และการ\nให้บริการด้านอื่นๆ ที่มิได้มีกำหนดไว้ในที่ใด (Other services not included elsewhere) การเปิดเสรีนี้\nครอบคลุมทั้งการประกอบธุรกิจและแรงงานในภาคอุตสาหกรรมการบริการ ดังนั้น ประเทศต่าง ๆ จึงต้อง\nมีการพัฒนาเพื่อเพิ่มขีดความสามารถในการแข่งขันในธุรกิจการบริการบนฐานของความคิดสร้างสรรค์และ\nนวัตกรรมในการพัฒนาการให้บริการ\nจากที่กล่าวมาสถานการณ์และบริบทการพัฒนาที่เปลี่ยนแปลงไปทำให้เกิดความต้องการของ\nบุคลากรที่มีทักษะในการทำงาน โดยเฉพาะในภาคอุตสาหกรรมการบริการเพิ่มมากขึ้นเพื่อตอบสนองต่อ\nการพัฒนาประเทศ ซึ่งทางหลักสูตรฯ มุ่งเน้นการพัฒนาบุคลากรรุ่นใหม่เพื่อตอบสนองการทำงานในโลก\nอนาคตที่มีความรู้ทักษะที่จำ เช่น การคิดวิเคราะห์และการคิดเชิงสร้างสรรค์ เพื่อสร้างความเข้าใจต่อ\nวัฒนธรรมที่แตกต่างและหลากหลาย การวิเคราะห์เพื่อการวางแผนและการพัฒนาการให้บริการ\nความสามารถในการทำงานภายใต้วัฒนธรรมที่แตกต่าง ความสากล และการนำเทคโนโลยีและดิจิทัล\nมคอ. 2 หลักสูตรศิลปศาสตรบัณฑิต สาขาวิชานวัตกรรมการบริการ (หลักสูตรนานาชาติ) หน้า 5 มาใช้ในธุรกิจการบริการ ต้น เพื่อให้สามารถทำงานในอุตสาหกรรมการบริการรูปแบบต่าง ๆ ได้อย่าง\nมีประสิทธิภาพ ซึ่งองค์ความรู้และทักษะที่จำดังกล่าวนี้จัดว่าองค์ความรู้แบบพหุวิทยาการ\n(Multidisciplinary) โดยผสมผสานหลอมรวมองค์ความรู้ด้านต่าง ๆ เข้ากับศาสตร์ด้านการบริการ ไม่ว่า\nจะการบริหารจัดการ วิทยาศาสตร์ เทคโนโลยีและการสื่อสาร รวมถึงสังคมศาสตร์ เพื่อรองรับความ\nต้องการของภาคอุตสากรรมการบริการ ที่นับวันจะมีความซับซ้อนและทวีความสำคัญมากยิ่งขึ้นต่อการ\nพัฒนาเศรษฐกิจประเทศ\nสำหรับยุทธศาสตร์ที่ 2 ด้านการพัฒนาที่ทำงานแห่งอนาคต (Future Workplace) นั้น ทาง\nหลักสูตรฯ ตระหนักถึงความเปลี่ยนแปลงและผลกระทบที่เกิดขึ้นจากสถานการณ์ที่ทั่วโลกประสบภัยจาก\nโรคติดเชื้อไวรัสโคโรน่า (COVID-19) และความเปราะบางในด้านต่างๆที่เกี่ยวของกับคุณภาพชีวิตและ\nการทำงานในด้านต่างๆ ก่อให้เกิดการปรับเปลี่ยนพฤติกรรมใหม่ให้กับสังคม (New Normal Practice)\nโดยส่งผลต่อการปรับเปลี่ยน และประยุกต์ทั้งในการศึกษาและการทำงาน เช่น การทำงานจากสถานที่ตั้ง\nของตนมากกว่าการเดินทางไปทำางานในหน่วยงาน (Going Remote) การทำงานที่มุ่งเน้นการใช้\nเทคโนโลยีและดิจิทัล (Digital Technology) เข้ามาปรับใช้กับทุกภาคส่วนของธุรกิจ (Digital\nTransformation) ซึ่งไม่ใช่แค่การใช้เทคโนโลยีแทนที่กำลังคน แต่การใช้เทคโนโลยีในทุกภาคส่วน\nของการทำงาน โดยพบว่าอาชีพที่จะได้รับความนิยมในอนาคต ได้แก่อาชีพต่างๆ ดังนี้ 1) เจ้าของธุรกิจ\n2) นักบริหารมุ่งความสัมพันธ์ระหว่างประเทศ 3) ผู้เชี่ยวชาญการท่องเที่ยว 4) นักการตลาดออนไลน์\n5) นักวิเคราะห์ข้อมูล 6) ผู้เชี่ยวชาญเทคโนโลยีและดิจิทัล 7) วิศวกรรมหุ่นยนต์ 8) ธุรกิจดูแลผู้สูงอายุ\nและเพื่อสุขภาพ 9) นักออกแบบและสร้างสรรค์นวัตกรรม และ 10) นักการเงิน โดยจะเห็นได้ว่าภาค\nธุรกิจจะเข้ามามีอิทธิพลหลักในอนาคตข้างหน้านี้และมีภาคการบริการ วิศวกรรม และเทคโนโลยีดิจิทัล\nกลไกสำคัญในการขับเคลื่อนในการพัฒนาประเทศ ทางหลักสูตรฯ เล็งเห็นถึงการเปลี่ยนแปลงที่\nเกิดขึ้นนี้จึงมุ่งเน้นการสร้างศักยภาพทั้งในด้านองค์ความรู้และทักษะทางดิจิทัลเพื่อการทำงานในโลก\nอนาคตอย่างมีปะสิทธิภาพและรู้เท่าทันผลกระทบของการทำงานในโลกยุคดิจิทัล เพื่อการสร้างความ\nยืดหยุ่นในการรองรับและสร้างทักษะที่จำในการปรับตัวตามแนวทาง “Resilience”\nสำหรับยุทธศาสตร์ที่ 3 ด้านการพัฒนาคุณภาพชีวิตและสังคมแห่งอนาคต (Future Life and\nSociety) และยุทธศาสตร์ที่ 4 ด้านการพัฒนารูปแบบความร่วมมือแห่งโลกอนาคตนั้น สอง\nยุทธศาสตร์ที่สามารถบูรณาการในการพัฒนาและดำเนินการได้ เพื่อมุ่งเน้นด้านส่งเสริมคุณภาพชีวิต\nความอยู่ของคนในสังคมผ่านกระบวนการมีส่วนร่วมเพื่อสร้างเครือข่ายและความร่วมมือกันในการ\nสร้างสังคมที่มีคุณภาพ โดยทางหลักสูตรฯ คำนึงถึงการพัฒนาและดำเนินการตามแนวทาง เป้าหมายเพื่อ\nการพัฒนาที่ยั่งยืน (Sustainable Development Goals –SDGs) ทั้งหมด 17 เป้าหมาย ที่ทางองค์กร\nสหประชาชนได้ประกาศทางการในปี 2016 เพื่อแนวทางและหมุดหมายการพัฒนา โดยแบ่ง\nออก 5 มิติ ได้แก่มิติสังคม (People) มิติเศรษฐกิจ (Prosperity) มิติสิ่งแวดล้อม (Planet) มิติ\nสันติภาพและสถาบัน (Peace) และมิติหุ้นส่วนการพัฒนา (Partnership) ทั้งนี้ SDGs ทั้ง 17 เป้าหมาย\nนั้นมุ่งหวังที่จะช่วยแก้ปัญหาที่โลกกำลังเผชิญอยู่ เช่น ความยากจน ความไม่เท่าเทียม ปัญหาสุขภาพ\nมคอ. 2 หลักสูตรศิลปศาสตรบัณฑิต สาขาวิชานวัตกรรมการบริการ (หลักสูตรนานาชาติ) หน้า 6 สภาวะโลกร้อน ปัญหาด้านสิ่งแวดล้อม และการสนับสนุนให้เกิดความสงบและสันติสุข เพื่อเสริมแนวคิด\n“ไม่การทิ้งใครไว้ข้างหลัง” และคาดว่าจะทำสำเร็จได้ภายในปี 2030 ตามแผนที่วางไว้นอกจากนี้\nจากสถานการณ์การแพร่ระบาดของโรคติดเชื้อไวรัสโคโรน่า (COVID-19) ทำให้ภาพของปัญหาเชิง\nโครงสร้างของสังคมปรากฏชัดขึ้น โดยเฉพาะในประเทศไทยที่พบว่ามีปัญหาทั้งเรื่องความเหลื่อมล้ำของ\nโอกาสในการศึกษา การพัฒนาทักษะแรงงานที่มีคุณภาพ โอกาสในการเข้าถึงและใช้ประโยชน์จาก\nเทคโนโลยี โครงสร้างพื้นฐาน และบริการสาธารณะ การกระจายโอกาสทางเศรษฐกิจและสังคมที่ไม่เท่า\nเทียม ก่อให้เกิดความเหลื่อมล้ำในหลายมิติ โดยเฉพาะความเหลื่อมล้ำทางรายได้ความเหลื่อมล้ำทาง\nความมั่งคั่ง และความเหลื่อมล้ำเชิงพื้นที่ ในประเด็นเรื่อง การพัฒนาทรัพยากรมนุษย์นั้น ดังนั้น ความท้า\nทายสำคัญของการพัฒนาประเทศ คือ การพัฒนาทักษะทางวิทยาศาสตร์และเทคโนโลยี และ ทักษะที่\nเทคโนโลยีไม่อาจทดแทนได้ เช่น ทักษะมนุษย์ การคิดเชิงวิพากษ์ ความคิดสร้างสรรค์ การทำงานทีม\nการยอมรับความความแตกต่าง ซึ่งสอดคล้องกับแนวทางแผนพัฒนาเศรษฐกิจและสังคมแห่งชาติฉบับที่\n13 ที่ได้กำหนดหมุดหมายการพัฒนาไว้ 13 ข้อ หนึ่งในนั้น คือ การพัฒนากำลังคนที่มีสมรรถนะสูง มุ่ง\nเรียนรู้อย่างต่อเนื่อง ตอบโจทย์การพัฒนาแห่งอนาคต ให้คนไทยทุกช่วงวัยได้รับการพัฒนาในทุกมิติ และ\nส่งเสริมการเรียนรู้ตลอดชีวิต\nทั้งนี้ แนวความคิดเรื่องการพัฒนาสังคมแห่งการเรียนรู้และการอนุรักษ์ธรรมชาติวัฒนธรรม\nองค์ประกอบ ที่มีความสำคัญในทุกภาคส่วนไม่ว่าจะภาครัฐหรือภาคเอกชน ซึ่งองค์กรต่าง ๆ\nโดยเฉพาะภาคส่วนของอุตสาหกรรมการบริการเล็งเห็นถึงความสำคัญของแนวคิดนี้ และในหลายองค์กรมี\nการวางนโยบายที่เรียกว่า “Corporate Social Responsibility” และ ESG for Sustainability เพื่อ\nดำเนินกิจกรรมโครงการที่ตอบแทนคืนสู่สังคม อย่างไรก็ดียังมีความจำที่จะต้องสร้างความรู้ความ\nเข้าใจ ความตระหนักในเรื่องนี้ให้มากขึ้น โดยเฉพาะในภาคอุตสาหกรรมการบริการ ซึ่งจะไม่สามารถ\nประสบความสำเร็จได้ในระยะยาว หากปราศจากทรัพยากรธรรมชาติวัฒนธรรม และสังคมชุมชน\nที่ภาคอุตสาหกรรมการบริการใช้ฐานทรัพยากรในการพัฒนาธุรกิจ ดังนั้น การที่จะสร้างบัณฑิตที่จะ\nสำเร็จการศึกษาไปเพื่อขับเคลื่อนสังคมนั้น จึงมิอาจละเลยเป้าหมายการพัฒนาที่ยั่งยืนไปได้\nในขณะเดียวกัน บัณฑิตควรมีคุณสมบัติและทักษะของการเรียนรู้ในศตวรรษที่ 21 ไปพร้อมๆ กัน ทักษะ\nการเรียนรู้ในศตวรรษที่ 21 ประกอบด้วยทักษะพื้นฐานในการรู้หนังสือ ทักษะการคิด ทักษะการทำงาน\nทักษะการใช้เทคโนโลยีสารสนเทศและดิจิทัล รวมถึงทักษะการใช้ชีวิต ด้วยเหตุนี้หลักสูตรนวัตกรรมการ\nบริการ (นานาชาติ) เล็งเห็นถึงความสำคัญของประเด็นดังที่กล่าวมา จึงออกแบบเนื้อหาวิชาให้มีลักษณะ\nพหุวิทยาการ (Multidisciplinary) เพื่อให้บัณฑิตมีความสามารถในการบริหารจัดการธุรกิจการบริการ\nและยังสามารถเข้าใจและวิเคราะห์สถานการณ์ทางสังคมเพื่อมีส่วนร่วมในการแสดงความรับผิดชอบต่อ\nสังคมได้เช่นกัน\nจากที่กล่าวมาแล้ว ทางหลักสูตรนวัตกรรมการบริการ (นานาชาติ) จึงมุ่งมั่นที่จะพัฒนาหลักสูตร\nเพื่อตอบสนองต่อความต้องการของภาคอุตสาหกรรมการบริการ โดยการพัฒนาบุคลากรที่มีทักษะความรู้\nความสามารถ การคิดในเชิงสร้างสรรค์เพื่อประยุกต์ใช้ในการแก้ไขปัญหาต่าง ๆ โดยใช้องค์ความรู้แบบพหุ\nมคอ. 2 หลักสูตรศิลปศาสตรบัณฑิต สาขาวิชานวัตกรรมการบริการ (หลักสูตรนานาชาติ) หน้า 7 วิทยาการ (Multidisciplinary) แนวทางหลักของหลักสูตรเพื่อผลิตบัณฑิตที่สามารถทำงานในระดับ\nต้นได้อย่างมีประสิทธิภาพ และสามารถพัฒนาศักยภาพของตนเองเพื่อก้าวขึ้นไปทำงานในตำแหน่งระดับ\nหัวหน้างานได้ต่อไปในอนาคต อีกทั้งยังสามารถเข้าใจในเชิงสังคมศาสตร์เพื่อการบริหารจัดการภาคการ\nให้บริการอย่างเท่าทันสถานการณ์ในการพัฒนาประเทศและมีส่วนร่วมในการแสดงความรับผิดชอบต่อ\nสังคม ตามหลักแนวคิดของมหาวิทยาลัยธรรมศาสตร์ได้ดังนั้น หลักสูตรจึงเน้นการเสริมสร้างองค์ความรู้\nพัฒนาทักษะ ขีดความสามารถของบุคลากรให้มีความสามารถในการคิด วิเคราะห์ สามารถประยุกต์ใช้\nองค์ความรู้ในเรื่องนวัตกรรมการบริการในการจัดการภายใต้สถานการณ์ต่าง ๆ และมีทักษะทางเทคโนโลยี\nและดิจิทัลเพื่อนำมาประยุกต์ใช้ในการทำงาน รวมถึงการมีมุมมองการทำงานที่รอบด้านและสามารถ\nทำงานได้อย่างมีประสิทธิภาพในภาคอุตสาหกรรมการบริการซึ่งประกอบด้วยหลายภาคส่วน เช่น ภาคการ\nท่องเที่ยวและโรงแรม ภาคการบินและคมนาคม ภาคจัดการสุขภาพ และด้านธุรกิจการประชุมและ\nกิจกรรมสันทนการ โดยคำนึงการพัฒนาอย่างยั่งยื่นและการสร้างความร่วมมือในระดับต่างๆสำคัญ\n3.2 ปรัชญา\nหลักสูตรมีความมุ่งมั่นที่จะผู้นำในการพัฒนาองค์ความรู้ด้านนวัตกรรมการบริการ สร้าง\nมาตรฐานการเรียนการสอนอย่างสร้างสรรค์และผลิตผลงานวิจัยในระดับนานาชาติสร้างสังคมแห่ง\nการเรียนรู้จากความหลากหลาย (Synergy from Diversity) และการมีคุณธรรมควบคู่ (Excellence\nwith Ethics) เพื่อมุ่งสร้างนวัตกรรมการศึกษาและพัฒนาโดยคำนึงถึงองค์รวม (Educational\nInnovation with Holistic Development)\nหลักสูตรศิลปศาสตรบัณฑิต สาขาวิชานวัตกรรมการบริการ (หลักสูตรนานาชาติ) มุ่งเน้นการ\nพัฒนาบุคลากรรุ่นใหม่ให้มีความรู้ความสามารถ และทักษะที่จำ ผ่านการเรียนการสอนและองค์\nความรู้แบบพหุวิทยาการ (Multidisciplinary) โดยวิธีการคิดและทำอย่างสร้างสรรค์ เพื่อให้บัณฑิต\nสามารถทำงานในอุตสาหกรรมการบริการรูปแบบต่าง ๆ ได้อย่างมีประสิทธิภาพพร้อมด้วยคุณธรรมและ\nจริยธรรม\n3.3 วัตถุประสงค์ของหลักสูตร\nเพื่อให้บัณฑิตที่สำเร็จการศึกษาในหลักสูตรมีคุณลักษณะ ดังนี้\n1. มีความรู้ความสามารถ ด้านการใช้นวัตกรรมและความคิดสร้างสรรค์เพื่อตอบสนองต่อธุรกิจ\nในภาคอุตสาหกรรมบริการ\n2. มีทักษะ ความสามารถในการใช้ความคิดเชิงสร้างสรรค์ การแก้ไขปัญหาการทำงานให้บริการ\nรูปแบบต่าง ๆ ภายใต้การทำงานสากล\n3. มีความรู้ความเข้าใจต่อการพัฒนาธุรกิจการบริการทั้งในระดับประเทศ ระดับภูมิภาค และ\nระดับโลก\nมคอ. 2 หลักสูตรศิลปศาสตรบัณฑิต สาขาวิชานวัตกรรมการบริการ (หลักสูตรนานาชาติ) หน้า 8 4. มีความสามารถในการพัฒนางานวิจัย การใช้เทคโนโลยี เพื่อสร้างนวัตกรรมในการให้บริการที่\nมีความหลากหลาย\n3.4 ผลลพัธ์การเรียนรู้ของหลักสูตร (PLOs)\nด้านความรู้ (Knowledge)\nK 1 มีความรู้อย่างกว้างขวางในหลักการพื้นฐานและทฤษฎีองค์ความรู้ที่เกี่ยวข้อง\nK 2 สามารถนำความรู้หลักการและทฤษฏีไปประยุกต์ใช้ได้อย่างเหมาะสม\nK 3 สามารถวิเคราะห์อย่างระบบเพื่อการพัฒนาและแข่งขันในระบบชาติและ\nนานาชาติ\nK 4 สามารถบูรณาการความรู้ที่เกี่ยวข้องผ่านงานวิจัยเพื่อออกแบบนวัตกรรมการบริการ\nได้อย่างเหมาะสม\nด้านทักษะ (Skills)\nS 1 สามารถประยุกต์ใช้ทักษะทางด้านนวัตกรรมการบริการได้อย่างเหมาะสม\nS 2 สามารถออกแบบและวิเคราะห์ปัญหาโจทย์การวิจัยที่เกี่ยวกับนวัตกรรมบริการ\nและ เสนอแนะวิธีการแก้ไขและผลการตัดสินใจได้อย่างเหมาะสม\nS 3 สามารถวิเคราะห์ปัญหา ประเมินสถานการณ์ และสร้างความสามารถในการแข่งขัน\nสำหรับธุรกิจบริการ และธุรกิจลักชูรี่\nS 4 มีความสามารถในการใช้เทคโนโลยีสารสนเทศในการวิเคราะห์และออกแบบการ\nนำเสนอข้อมูลได้อย่างมีประสิทธิผล\nS 5 สามารถวิเคราะห์ข้อมูลด้านการเงินและสภาวะเศรษฐกิจเพื่อประกอบการตัดสินใจ\nได้อย่างมีประสิทธิภาพ\nS 6 สามารถประยุกต์ใช้การสื่อสารได้อย่างมืออาชีพทั้งในด้านของการเขียนและการพูด\nโดยใช้เทคโนโลยีที่เหมาะสม\nด้านจริยธรรม (Ethics)\nE 1 มีความเข้าใจและความตระหนักต่อการพัฒนาที่ยั่งยืน\nE 2 มีความรู้ความเข้าใจถึงความสำคัญของความรับผิดชอบต่อตนเองและสังคม\nด้านลักษณะบุคคล (Character)\nC 1 สร้างคุณค่าความผู้นำที่มีประสิทธิผลและมีทักษะในการทำงานทีม\nC 2 เข้าใจและตระหนักในเรื่องความแตกต่างของวัฒนธรรมที่สำคัญต่อการทำงานทีม\nC 3 มีทักษะและความรู้ในการจัดการกระบวนการทำงานกับผู้ที่มีส่วนเกี่ยวข้อง\nมคอ. 2 หลักสูตรศิลปศาสตรบัณฑิต สาขาวิชานวัตกรรมการบริการ (หลักสูตรนานาชาติ) หน้า 9 3.5 ผลลัพธ์การเรียนรู้ที่คาดหวังเมื่อสิ้นปีการศึกษา (YLOs)\nชั้นปีรายละเอียด\nปีที่ 1 1. เข้าใจรูปแบบและแยกแยะนวัตกรรมการบริการ\n2. สามารถสื่อสารด้วยภาษาอังกฤษได้\n3. สามารถวิเคราะห์ข้อมูลจากฐานข้อมูลประเภทต่างๆเพื่อเกิดความเข้าใจผู้รับบริการ\nปีที่ 2 1. เข้าใจหลักการตลาดและสามารถนำไปปฏิบัติได้ทั้งการตลาดแบบดั้งเดิมและแบบ\nดิจิทัลสำหรับธุรกิจการบริการ\n2. สามารถบริหารจัดการด้านการบัญชีการเงินและ เศรษฐศาสตร์ สำหรับธุรกิจบริการได้\n3. เข้าใจหลักการดำเนินงานในส่วนต่างๆขององค์กรในธุรกิจบริการไม่ว่าจะ การ\nบริหารทรัพยากรมนุษย์ การออกแบบกลยุทธ์การบริหารจัดการธุรกิจต่าง และการ\nบริหารโครงการ\n4. เข้าใจกฎหมายกฏระเบียบข้อบังคับและมาตรฐานต่างๆที่เกี่ยวข้องกับการบริการ\nปีที่ 3 1. สามารถวางแผนพัฒนาคุณภาพธุรกิจบริการได้\n2. วางแผนการบริหารจัดการความเสี่ยงและภาวะวิกฤตในฉุกเฉินต่อเนื่องทางธุรกิจ\nสำหรับธุรกิจบริการได้\n3. สามารถวิเคราะห์สถานการณ์ด้วยกรณีศึกษาธุรกิจต่างๆที่เกี่ยวข้องกับธุรกิจบริการ\nเช่น ธุรกิจโรงแรม ร้านอาหาร โรงพยาบาล การจัดงานอีเว้นท์ และท่องเที่ยว\n4. สามารถออกแบบและพัฒนานวัตกรรมการบริการในฐานะนวัตกรในธุรกิจบริการ\nผ่านกิจกรรม Capstone Project\n5. สามารถฝึกงานในองค์กรธุรกิจบริการตามที่กำหนดและนำความรู้ที่ได้เรียนมา\nประยุกต์ใช้ได้ในสถานการณ์จริง\n6. เข้าใจและตระหนักในเรื่องความแตกต่างของวัฒนธรรมที่สำคัญต่อการทำงานทีม\nปีที่ 4 1. เข้าใจสถานการณ์ที่ผันผวนในปัจจุบันและออกแบบนวัตกรรมการบริการเพื่อการ\nพัฒนาที่ยั่งยืนได้\n2. สามารถสร้างโครงงานที่ปรึกษาทางนวัตกรรมการบริการให้กับ ภาครัฐและเอกสารใน\nลักษณะของ Capstone project ได้\n3. มีทักษะและความรู้ในการจัดการกระบวนการทำงานกับผู้ที่มีส่วนเกี่ยวข้อง\n4. สามารถสร้างคุณค่าความผู้นำที่มีประสิทธิผลและมีทักษะในการทำงานทีม\n5. มีความรู้ความเข้าใจถึงความสำคัญของความรับผิดชอบต่อตนเองและสังคม\nมคอ. 2 หลักสูตรศิลปศาสตรบัณฑิต สาขาวิชานวัตกรรมการบริการ (หลักสูตรนานาชาติ) หน้า 10",
    "หมวดที่ 4": "หมวดที่ 4 โครงสร้างหลกัสูตร รายวิชา และหน่วยกิต\n4.1 ระบบการจัดการศึกษาและระยะเวลาการศึกษา\n4.1.1 ระบบ\nหลักสูตรแบบเต็มเวลา ใช้ระบบการศึกษาแบบทวิภาค โดย 1 ปีการศึกษาแบ่งออก 2\nภาคการศึกษาปกติ 1 ภาคการศึกษาปกติมีระยะเวลาศึกษาไม่น้อยกว่า 15 สัปดาห์\n4.1.2 ระยะเวลาการศึกษาสูงสุด\n\n<exclude> ไม่กำหนด</exclude>\n\n<include> ไมเ่กิน……16….ภาคการศึกษาปกติ</include>\n4.2 การดำเนินการหลักสูตร\n4.2.1 วัน-เวลาในการดำเนินการเรียนการสอน\n\n<include> วัน – เวลาราชการปกติ</include>\n\n<exclude> นอกวัน – เวลาราชการ</exclude>\n4.2.2 ระบบการศึกษา\n\n<include> แบบชั้นเรียน (Onsite)</include>\n\n<exclude> แบบทางไกล (Online)</exclude>\n\n<exclude> แบบประสมประสาน (Hybrid)</exclude>\n\n<include> อื่น ๆ (ระบุ)</include>\nนอกเหนือจากระบบการศึกษาแบบชั้นเรียน หลักสูตรจะใช้เทคนิคการเรียนการสอนแบบผสมผสาน\nเพื่อสร้างการเรียนรู้ที่มีประสิทธิภาพให้แก่นักศึกษา โดยเทคนิคที่จะใช้ในการสร้างการเรียนรู้\nประกอบด้วย การเรียนรู้เชิงรุก (Active learning) การเรียนรู้จากปัญหาที่เผชิญอยู่ในปัจจุบัน\n(Problem-based learning) การเรียนรู้ด้วยการทำโครงงาน (Project-based learning) การทำงาน\nกลุ่ม การทำงานวิจัย โครงการเดี่ยว การวิเคราะห์กรณีศึกษา การฝึกงานผ่านการปฏิบัติจริง รวมถึง\nการศึกษาดูงาน\n4.3 โครงสร้างหลักสูตร รายวิชา และหน่วยกิต\n4.3.1 หลักสูตร\n4.3.1.1 จำนวนหน่วยกิตรวม\nจำนวนหน่วยกิตรวมตลอดหลักสูตร 129 หน่วยกิต\nมคอ. 2 หลักสูตรศิลปศาสตรบัณฑิต สาขาวิชานวัตกรรมการบริการ (หลักสูตรนานาชาติ) หน้า 11 4.3.1.2 โครงสร้างหลักสูตร\nนักศึกษาจะต้องจดทะเบียนศึกษารายวิชา รวมไม่น้อยกว่า 129 หน่วยกิต โดยศึกษา\nรายวิชาต่างๆ ครบตามโครงสร้างองค์ประกอบ และข้อกำหนดของหลักสูตรดังนี้\n1) วิชาศึกษาทั่วไป 30 หน่วยกิต\n2) วิชาเฉพาะ 93 หน่วยกิต\n2.1) วิชาบังคับ 81 หน่วยกิต\n2.2) วิชาเลือก 12 หน่วยกิต\n3) วิชาเลือกเสรี 6 หน่วยกิต\nรวม 129 หน่วยกิต\n4.3.2 รายวิชาในหลักสูตร\n4.3.2.1 รหัสวิชา\nรายวิชาในหลักสูตรประกอบด้วย อักษรย่อ 2 หรือ 3 ตัว และเลขรหัส 3 ตัว โดยมี\nความหมายดังนี้\nอักษรย่อ นบ/SV หมายถึง สาขาวิชานวัตกรรมการบริการ\nตัวเลข มีความหมาย ดังนี้\nเลขหลักหน่วย\nเลข 0-4 หมายถึง วิชาบังคับ\nเลข 5-9 หมายถึง วิชาเลือก\nเลขหลักสิบ\nเลข 0-1 หมายถึง วิชาทฤษฎีพื้นฐาน\nเลข 2 หมายถึง วิชาด้านมนุษยศาสตร์และสังคมศาสตร์\nเลข 3 หมายถึง วิชาด้านการบริหารธุรกิจบริการ\nเลข 4-6 หมายถึง วิชาด้านการโรงแรมและการท่องเที่ยว การบิน\nการจัดการสุขภาพ การประชุมและกิจกรรมสันทนาการ\nเลข 7-8 หมายถึง วิชาในหมวดวิชาปฏิบัติการ\nเลขหลักร้อย\nเลข 1 หมายถึง รายวิชาที่จัดสอนในหลักสูตรชั้นปีที่ 1\nเลข 2 หมายถึง รายวิชาที่จัดสอนในหลักสูตรชั้นปีที่ 2\nเลข 3 หมายถึง รายวิชาที่จัดสอนในหลักสูตรชั้นปีที่ 3\nเลข 4 หมายถึง รายวิชาที่จัดสอนในหลักสูตรชั้นปีที่ 4\nมคอ. 2 หลักสูตรศิลปศาสตรบัณฑิต สาขาวิชานวัตกรรมการบริการ (หลักสูตรนานาชาติ) หน้า 12 4.3.2.2 รายวิชาและข้อกำหนดของหลักสูตร\n1) วิชาศึกษาทั่วไป 30 หน่วยกิต\nนักศึกษาทุกคนสามารถเลือกเรียนได้ทุกรายวิชาในแต่ละหมวด โดยต้องเลือกเรียนให้ครบทั้ง\n5 หมวด แต่ละหมวดจะเรียนกี่วิชาก็ได้จำนวนรวมทั้งสิ้น 30 หน่วยกิต ตามโครงสร้างและองค์ประกอบ\nของหลักสูตรวิชาศึกษาทั่วไปที่วิทยาลัยกำหนดไว้ดังนี้\nหมวดวิชา\n1) หมวดความเท่าทันโลกและสังคม\n2) หมวดสุนทรียะและทักษะการสื่อสาร\n3) หมวดคณิตศาสตร์ วิทยาศาสตร์ และเทคโนโลยี\n4) หมวดสุขภาวะและทักษะแห่งอนาคต\n5) หมวดการบริการสังคมและการเรียนรู้จากการปฏิบัติ\nรวม 30 หน่วยกิต\nจำนวนหน่วยกิต\nรหัสวิชา ชื่อวิชา\n(บรรยาย – ปฏิบัติ – ศึกษาดว้ยตนเอง)\n1. หมวดความเท่าทันโลกและสังคม\nสผ.165 เศรษฐกิจสร้างมูลค่า 3(3-0-6)\nAP165 Value Creation Economy\nมธ.109 นวัตกรรมกับกระบวนคิดผู้ประกอบการ 3(3-0-6)\nTU109 Innovation and Entrepreneurial Mindset\nปด.102 สังคมศาสตร์ในศตวรรษที่ 21 3(3-0-6)\nPD102 Social Sciences in the 21st Century\n2. หมวดสุนทรียะและทักษะการสื่อสาร\nศศ.101 การคิด อ่าน และเขียนอย่างมีวิจารณญาณ 3(3-0-6)\nLAS101 Critical Thinking, Reading, and Writing\nมธ.106 ความคิดสร้างสรรค์และการสื่อสาร 3(3-0-6)\nTU106 Creativity and Communication\nปด.103 มนุษย์ศาสตร์ในยุคแห่งการผันผวน 3(3-0-6)\nPD103 Humanities in the Age of Disruption\nปด.104 เส้นทางสู่ความสมัยใหม่และโลกาภิวัตน์ 3(3-0-6)\nPD104 The Path to Modernity and Globalization\nมคอ. 2 หลักสูตรศิลปศาสตรบัณฑิต สาขาวิชานวัตกรรมการบริการ (หลักสูตรนานาชาติ) หน้า 13 จำนวนหน่วยกิต\nรหัสวิชา ชื่อวิชา\n(บรรยาย – ปฏิบัติ – ศึกษาดว้ยตนเอง)\nจน.171 ภาษาจีน 1 3(3-0-6)\nCH171 Chinese 1\nจน.172 ภาษาจีน 2 3(3-0-6)\nCH172 Chinese 2\nอซ.171 ภาษาเกาหลี 1 3(3-0-6)\nAS171 Korean 1\nอซ.172 ภาษาเกาหลี 2 3(3-0-6)\nAS172 Korean 2\nสษ.105 ทักษะการสื่อสารทางภาษาอังกฤษ 3(3-0-6)\nEL105 English Communication Skills\n3. หมวดคณิตศาสตร์ วิทยาศาสตร์และเทคโนโลยี\nมธ.103 ชีวิตกับความยั่งยืน 3(3-0-6)\nTU103 Life and Sustainability\nมธ.107 ทักษะดิจิทัลกับการแก้ปัญหา 3(3-0-6)\nTU107 Digital Skill and Problem Solving\n4. หมวดสุขภาวะและทักษะแห่งอนาคต\nมธ.108 การพัฒนาและจัดการตนเอง 3(3-0-6)\nTU108 Self Development and Management\n5. หมวดการบริการสังคมและการเรียนรู้จากการปฏิบัติ\nมธ.100 พลเมืองกับการลงมือแก้ปัญหา 3(3-0-6)\nTU100 Civic Engagement\nมคอ. 2 หลักสูตรศิลปศาสตรบัณฑิต สาขาวิชานวัตกรรมการบริการ (หลักสูตรนานาชาติ) หน้า 14 2) วิชาเฉพาะ 93 หน่วยกิต\n2.1) วิชาบังคับ 81 หน่วยกิต\nนักศึกษาต้องศึกษารายวิชาในหมวดวิชาบังคับ จำนวน 81 หน่วยกิต ตามรายวิชาที่กำหนดไว้ดังนี้\nจำนวนหน่วยกิต\nรหัสวิชา ชื่อรายวิชา\n(บรรยาย – ปฏิบัติ – ศึกษาดว้ยตนเอง)\nนบ.180 ข้อมูลภาพนิทัศน์ 3(3-0-6)\nSV180 Data Visualization\nนบ.200 นวัตกรรมเพื่อการมุ่งเน้นลูกค้า 3(3-0-6)\nSV200 Customer-Focused Innovation\nนบ.210 เศรษฐศาสตร์และการวิเคราะห์สภาวะทางธุรกิจสำหรับการ 3(3-0-6)\nจัดการนวัตกรรมการบริการ\nSV210 Economics and Business Conditions Analysis for\nService Innovation Management\nนบ.211 บัญชีและการเงินสำหรับการจัดการนวัตกรรมการบริการ 3(3-0-6)\nSV211 Accounting and Finance for Service Innovation\nManagement\nนบ.212 การตลาดดิจิทัลสำหรับการจัดการนวัตกรรมบริการ 3(3-0-6)\nSV212 Digital Marketing for Service Innovation\nManagement\nนบ.213 การจัดการทรัพยากรมนุษย์ระหว่างประเทศ 3(3-0-6)\nSV213 International Human Resources Management\nนบ.214 กฎหมายธุรกิจสำหรับการจัดการนวัตกรรมการบริการ 3(3-0-6)\nSV214 Business Law for Service Innovation Management\nนบ.230 การสื่อสารทางธุรกิจ 3(3-0-6)\nSV230 Business Communication\nนบ.232 กลยุทธ์การสร้างแบรนด์และช่องทางการสื่อสารทางการ 3(3-0-6)\nตลาด\nSV232 Brand and Communication Management for Service\nIndustry\nนบ.241 การจัดการโรงแรมในระดับนานาชาติ 3(3-0-6)\nSV241 International Hotel Management\nนบ.243 การจัดการธุรกิจการบิน 3(3-0-6)\nSV243 Airline Business Management\nมคอ. 2 หลักสูตรศิลปศาสตรบัณฑิต สาขาวิชานวัตกรรมการบริการ (หลักสูตรนานาชาติ) หน้า 15 จำนวนหน่วยกิต\nรหัสวิชา ชื่อรายวิชา\n(บรรยาย – ปฏิบัติ – ศึกษาดว้ยตนเอง)\nนบ.244 การพัฒนาแหล่งท่องเที่ยวเชิงสุขภาวะ 3(3-0-6)\nSV244 Wellness tourism destination development\nนบ.261 การจัดการกิจกรรมพิเศษทางการตลาด 3(3-0-6)\nSV261 Special Event Management\nนบ.320 ความยั่งยืนในอุตสาหกรรมการบริการ 3(3-0-6)\nSV320 Sustainability in Service Industry\nนบ.321 สัมมนาเชิงปฏิบัติการเรื่องนวัตกรรมและการสร้างสรรค์ 3(3-0-6)\nSV321 Innovation and Creativity Workshop\nนบ.330 การบริหารข้ามวัฒนธรรมภายใต้สภาพแวดล้อมระดับโลก 3(3-0-6)\nSV330 Cross-Cultural Management in a Global\nEnvironment\nนบ.331 การวางแผนเชิงกลยุทธ์สำหรับการจัดการนวัตกรรมการ 3(3-0-6)\nบริการ\nSV331 Strategic Planning for Service Innovation\nManagement\nนบ.333 การบริหารโครงการ 3(3-0-6)\nSV333 Project Management\nนบ.340 นวัตกรรมและการออกแบบผลิตภัณฑ์ 3(3-0-6)\nSV340 Innovation and Product Development Project\nนบ.351 การจัดอาหารและเครื่องดื่ม 3(3-0-6)\nSV351 Management of Food & Beverage Operations\nนบ.430 การออกแบบงานวิจัยและระเบียบวิธีวิจัยสำหรับนวัตกรรม 3(3-0-6)\nการบริการ\nSV430 Research Design and Methodology for Service\nInnovation\nนบ.431 โครงการที่ปรึกษาทางนวัตกรรมการบริการ 3(3-0-6)\nSV431 Service Innovation Consultancy\nนบ.432 ความผู้ประกอบการดิจิทัล 3(3-0-6)\nSV432 Digital Entrepreneurship\nนบ.434 การวางแผนฉุกเฉินต่อเนื่องทางธุรกิจสำหรับธุรกิจบริการ 3(3-0-6)\nSV434 Business Continuity Management in Service Industry\nมคอ. 2 หลักสูตรศิลปศาสตรบัณฑิต สาขาวิชานวัตกรรมการบริการ (หลักสูตรนานาชาติ) หน้า 16 จำนวนหน่วยกิต\nรหัสวิชา ชื่อรายวิชา\n(บรรยาย – ปฏิบัติ – ศึกษาดว้ยตนเอง)\nนบ.460 การจัดการคุณภาพการบริการ 3(3-0-6)\nSV460 Service Quality Management\nนบ.461 การผลิตและปฏิบัติการงานอีเว้นท์ 3(3-0-6)\nSV461 Event Production and Operation\nนบ.484 การฝึกงานสำหรับอุตสาหกรรมการบริการ 3(ฝึกงาน 270 ชั่วโมง)\nSV484 Internships for Service Industry (270 hrs.)\n2.2) วิชาเลือก 12 หน่วยกิต\nนักศึกษาต้องศึกษารายวิชาในหมวดวิชาเลือก จำนวน 12 หน่วยกิต จากรายวิชาที่กำหนดไว้ดังนี้\nจำนวนหน่วยกิต\nรหัสวิชา ชื่อวิชา\n(บรรยาย – ปฏบิัติ – ศึกษาด้วยตนเอง)\nนบ.336 การบริหารรายได้และผลตอบแทน 3(3-0-6)\nSV336 Revenue and Yield Management\nนบ.346 การออกแบบและบริหารจัดการจุดหมายปลายทาง 3(3-0-6)\nSV346 Destination Design and Management\nนบ.355 การปฏิรูปด้านดิจิทัลในอุตสาหกรรมการท่องเที่ยวและการ 3(3-0-6)\nบริการ\nSV355 Digital Transformation for Tourism and Service\nIndustry\nนบ.365 นวัตกรรมสังคมสำหรับการให้บริการสาธารณะ 3(3-0-6)\nSocial Innovation for Public Service\nSV365\nนบ.366 การจัดการกิจกรรมกีฬา 3(3-0-6)\nSV366 Sport Events Management\nนบ.367 การจัดงานอีเว้นท์เชิงธุรกิจ 3(3-0-6)\nSV367 Business Event Management\nนบ.435 การจัดการห่วงโซ่อุปทานสำหรับธุรกิจอาหาร 3(3-0-6)\nSV435 Supply-Chain Management in Food Production\nProcess\nนบ.445 การบริการและการท่องเที่ยวผ่านประสบการณ์ 3(3-0-6)\nSV445 Experiential Hospitality and Tourism\nมคอ. 2 หลักสูตรศิลปศาสตรบัณฑิต สาขาวิชานวัตกรรมการบริการ (หลักสูตรนานาชาติ) หน้า 17 จำนวนหน่วยกิต\nรหัสวิชา ชื่อวิชา\n(บรรยาย – ปฏบิัติ – ศึกษาด้วยตนเอง)\nนบ.446 การสำรวจตลาดด้านการบริการและการท่องเที่ยว 3(3-0-6)\nSV446 Marketing Exploration in Hospitality and Tourism\nนบ.455 การผู้ประกอบการธุรกิจสุขภาวะ 3(3-0-6)\nSV455 Wellness Business Entrepreneurship\nนบ.456 การวิเคราะห์การแข่งขันสำหรับธุรกิจลักชูรี่ในตลาดอิ่มตัว 3(3-0-6)\n(Mature market) และตลาดเกิดใหม่ (Emerging market)\nSV456 Competitive Analysis for Luxury Business in Mature\nand Emerging Markets\nนบ.457 กลยุทธ์การตลาดและการสื่อสารลักชูรี่ 3(3-0-6)\nSV457 Luxury Marketing and Communication Strategies\nนบ.458 การออกแบบอาหารสำหรับธุรกิจจัดเลี้ยง 3(3-0-6)\nSV458 Food Design for Catering Services\nนบ.459 นวัตกรรมการบริการเพื่อสังคมสูงวัย 3(3-0-6)\nSV459 Service Innovation for Silver Aging Society\nนบ.475 ศิลปะการประกอบอาหารผ่านประสบการณ์ 3(3-0-6)\nSV475 Experiential Culinary Arts\n3) วิชาเลือกเสรี 6 หน่วยกิต\nนักศึกษาสามารถเลือกศึกษาวิชาใดก็ได้ที่เปิดสอนในมหาวิทยาลัยธรรมศาสตร์วิชาเลือก\nเสรีหรือเลือกศึกษาจากวิชาที่คณะเปิดสอนจำนวนไม่น้อยกว่า 6 หน่วยกิต\nนักศึกษาไม่สามารถนำรายวิชาในหลักสูตรวิชาศึกษาทั่วไปที่รหัสระดับ 100 ไปนับ\nวิชาเลือกเสรีหรือวิชาเลือกหรือวิชาโท\nมคอ. 2 หลักสูตรศิลปศาสตรบัณฑิต สาขาวิชานวัตกรรมการบริการ (หลักสูตรนานาชาติ) หน้า 18 4.3.2.3 แสดงแผนการศึกษา\nปีการศึกษาที่ 1 | ภาคเรียนที่ 1\nมธ.100 พลเมืองกับการลงมือแก้ปัญหา 3 หน่วยกิต\nTU100 Civic Engagement\nมธ.107 ทักษะดิจิทัลกับการแก้ปัญหา 3 หน่วยกิต\nTU107 Digital Skill and Problem Solving\nมธ.109 นวัตกรรมกับกระบวนการคิดผู้ประกอบการ 3 หน่วยกิต\nTU109 Innovation and Entrepreneurial Mindset\nสผ.165 เศรษฐกิจสร้างมูลค่า 3 หน่วยกิต\nAP165 Value Creation Economy\nศศ.101 การคิด อ่าน และเขียนอย่างมีวิจารณญาณ 3 หน่วยกิต\nLAS101 Critical Thinking, Reading, and Writing\nนบ.180 ข้อมูลภาพนิทัศน์ 3 หน่วยกิต\nSV180 Data Visualization\nรวม 18 หน่วยกิต\nปีการศึกษาที่ 1 | ภาคเรียนที่ 2\nมธ.103 ชีวิตกับความยั่งยืน 3 หน่วยกิต\nTU103 Life and Sustainability\nมธ.106 ความคิดสร้างสรรค์และการสื่อสาร 3 หน่วยกิต\nTU106 Creativity and Communication\nมธ.108 การพัฒนาและจัดการตนเอง 3 หน่วยกิต\nTU108 Self Development and Management\nนบ.200 นวัตกรรมเพื่อการมุ่งเน้นลูกค้า 3 หน่วยกิต\nSV200 Customer-Focused Innovation\nนบ.211 บัญชีและการเงินสำหรับการจัดการนวัตกรรมการบริการ 3 หน่วยกิต\nSV211 Accounting and Finance for Service Innovation Management\nนบ.212 การตลาดดิจิทัลสำหรับการจัดการนวัตกรรมบริการ 3 หน่วยกิต\nSV212 Digital Marketing for Service Innovation Management\nรวม 18 หน่วยกิต\nมคอ. 2 หลักสูตรศิลปศาสตรบัณฑิต สาขาวิชานวัตกรรมการบริการ (หลักสูตรนานาชาติ) หน้า 19 ปีการศึกษาที่ 2 | ภาคเรียนที่ 1\nจน.171 ภาษาจีน 1 3 หน่วยกิต\nCH171 Chinese 1\nหรือ\nอซ.171 ภาษาเกาหลี 1\nAS171 Korean 1\nนบ.210 เศรษฐศาสตร์และการวิเคราะห์สภาวะทางธุรกิจสำหรับการ 3 หน่วยกิต\nจัดการนวัตกรรมการบริการ\nSV210 Economics and Business Conditions Analysis for\nService Innovation Management\nนบ.213 การจัดการทรัพยากรมนุษย์ระหว่างประเทศ 3 หน่วยกิต\nSV213 International Human Resources Management\nนบ.230 การสื่อสารทางธุรกิจ 3 หน่วยกิต\nSV230 Business Communication\nนบ.432 ความผู้ประกอบการดิจิทัล 3 หน่วยกิต\nSV432 Digital Entrepreneurship\nวิชาเลือกเสรี #1 3 หน่วยกิต\nFree Elective #1\nรวม 18 หน่วยกิต\nมคอ. 2 หลักสูตรศิลปศาสตรบัณฑิต สาขาวิชานวัตกรรมการบริการ (หลักสูตรนานาชาติ) หน้า 20 ปีการศึกษาที่ 2 | ภาคเรียนที่ 2\nจน.172 ภาษาจีน 2 3 หน่วยกิต\nCH172 Chinese 2\nหรือ\nอซ.172 ภาษาเกาหลี 2\nAS172 Korean 2\nนบ.214 กฎหมายธุรกิจสำหรับการจัดการนวัตกรรมการบริการ 3 หน่วยกิต\nSV214 Business Law for Service Innovation Management\nนบ.331 การวางแผนเชิงกลยุทธ์สำหรับการจัดการนวัตกรรมการบริการ 3 หน่วยกิต\nSV331 Strategic Planning for Service Innovation Management\nนบ.232 กลยุทธ์การสร้างแบรนด์และช่องทางการสื่อสารทางการตลาด 3 หน่วยกิต\nSV232 Brand and Communication Management for Service Industry\nนบ.244 การพัฒนาแหล่งท่องเที่ยวเชิงสุขภาวะ 3 หน่วยกิต\nSV244 Wellness Tourism Destination Development\nนบ.261 การจัดการกิจกรรมพิเศษทางการตลาด 3 หน่วยกิต\nSV261 Special Event Management\nรวม 18 หน่วยกิต\nมคอ. 2 หลักสูตรศิลปศาสตรบัณฑิต สาขาวิชานวัตกรรมการบริการ (หลักสูตรนานาชาติ) หน้า 21 ปีการศึกษาที่ 3 | ภาคเรียนที่ 1\nนบ.330 การบริหารข้ามวัฒนธรรมภายใต้สภาพแวดล้อมระดับโลก 3 หน่วยกิต\nSV330 Cross-Cultural Management in a Global Environment\nนบ.351 การจัดการอาหารและเครื่องดื่ม 3 หน่วยกิต\nSV351 Management of Food & Beverage Operations\nนบ.321 สัมมนาเชิงปฏิบัติการเรื่องนวัตกรรมและการสร้างสรรค์ 3 หน่วยกิต\nSV321 Innovation and Creativity Workshop\nนบ.241 การจัดการโรงแรมในระดับนานาชาติ 3 หน่วยกิต\nSV241 International Hotel Management\nนบ.333 การบริหารโครงการ 3 หน่วยกิต\nSV333 Project Management\nนบ.243 การจัดการธุรกิจการบิน 3 หน่วยกิต\nSV243 Airline Business Management\nรวม 18 หน่วยกิต\nปีการศึกษาที่ 3 | ภาคเรียนที่ 2\nนบ.460 การจัดการคุณภาพการบริการ 3 หน่วยกิต\nSV460 Service Quality Management\nนบ.434 การวางแผนฉุกเฉินต่อเนื่องทางธุรกิจสำหรับธุรกิจบริการ 3 หน่วยกิต\nSV434 Business Continuity Management in Service Industry\nนบ.340 นวัตกรรมและการออกแบบผลิตภัณฑ์ 3 หน่วยกิต\nSV340 Innovation and Product Development Project\nนบ.430 การออกแบบงานวิจัยและระเบียบวิธีวิจัยสำหรับนวัตกรรมการบริการ 3 หน่วยกิต\nSV430 Research Design and Methodology for Service Innovation\nวิชาเลือก #1 3 หน่วยกิต\nElective Course #1\nวิชาเลือก #2 3 หน่วยกิต\nElective Course #2\nรวม 18 หน่วยกิต\nปีการศึกษาที่ 3 | ภาคเรียนที่ 3\nนบ.484 การฝึกงานสำหรับอุตสาหกรรมการบริการ 3 หน่วยกิต\nSV484 Internships for Service Industry (270 hrs.)\nรวม 3 หน่วยกิต\nมคอ. 2 หลักสูตรศิลปศาสตรบัณฑิต สาขาวิชานวัตกรรมการบริการ (หลักสูตรนานาชาติ) หน้า 22 ปีการศึกษาที่ 4 | ภาคเรียนที่ 1\nนบ.320 ความยั่งยืนในอุตสาหกรรมการบริการ 3 หน่วยกิต\nSV320 Sustainability in Service Industry\nนบ.431 โครงการที่ปรึกษาทางนวัตกรรมการบริการ 3 หน่วยกิต\nSV431 Service Innovation Consultancy\nนบ.461 การผลิตและปฏิบัติการงานอีเว้นท์ 3 หน่วยกิต\nSV461 Event Production and Operation\nวิชาเลือก #3 3 หน่วยกิต\nElective Course #3\nวิชาเลือก #4 3 หน่วยกิต\nElective Course #4\nวิชาเลือกเสรี #2 3 หน่วยกิต\nFree Elective #2\nรวม 18 หน่วยกิต\n4.3.2.4 คำอธิบายรายวิชา\nวิชาศึกษาทั่วไป\nหมวดความเท่าทันโลกและสังคม\nสผ.165 เศรษฐกิจสร้างมูลค่า 3(3-0-6)\nAP165 Value Creation Economy\nเนื้อหาของวิชานี้ครอบคลุม แนวคิดพื้นฐานทางเศรษฐศาสตร์จุลภาคและมหภาค รวมถึงการ\nประยุกต์แนวความคิดเพื่อการออกแบบ การบริหารธุรกิจและเทคโนโลยี โดยเน้นทฤษฎีเศรษฐกิจสร้าง\nมูลค่า นักศึกษาจะเรียนรู้การประยุกต์ทฤษฎีและแนวความคิดทางเศรษฐศาสตร์ เพื่อนำไปใช้ในการ\nวิเคราะห์ปัญหาทางเศรษฐกิจในปัจจุบัน ผ่านกรณีศึกษาและการอภิปราย\nThis course covers fundamental concepts of micro- and macro-economics and\ntheir applications to design, business, and technology management. The theories of value\ncreation economy are also highlighted in class. Students will learn how to apply economic\nconcepts and theories to real world problems and develop their analytical problem-\nsolving skills through case studies and discussions.\nมคอ. 2 หลักสูตรศิลปศาสตรบัณฑิต สาขาวิชานวัตกรรมการบริการ (หลักสูตรนานาชาติ) หน้า 23 มธ.109 นวัตกรรมกับกระบวนคิดผู้ประกอบการ 3(3-0-6)\nTU109 Innovation and Entrepreneurial mindset\nการประเมินความเสี่ยงและการสร้างโอกาสใหม่การคิดและการวางแผนแบบผู้ประกอบการ\nการตัดสินใจและการพัฒนาธุรกิจ การสื่อสารเชิงธุรกิจและการสร้างแรงจูงใจอย่างมีประสิทธิภาพ\nการสร้างคุณค่าร่วมเพื่อสังคม\nRisk assessment and creating new opportunities. Thinking and planning as an\nentrepreneur. Decision making and entrepreneurial venture development. Business\ncommunication for delivering concept or initiative in an efficient, effective and compelling\nmanner. Social shared value creation.\nปด.102 สังคมศาสตร์ในศตวรรษที่ 21 3(3-0-6)\nPD102 Social Science in the 21st Century\nวิชานี้แนะนำศาสตร์ต่าง ๆ ในสังคมศาสตร์ซึ่งมีบทบาทสำคัญในสังคมศตวรรษที่ 21 โดยมุ่งเน้น\nศึกษาศาสตร์ต่าง ๆ ที่พื้นฐานสำคัญ ตลอดจนมโนทัศน์และทฤษฎีที่เกี่ยวข้องกับเหตุการณ์ปัจจุบันใน\nโลกยุคโลกาภิวัตน์และนวัตกรรม ทบทวนประเด็นและปรากฏการณ์ทางสังคม รวมถึงประเด็นความรู้ที่ว่า\nสังคมนั้นผลผลิตของปัจเจก ในขณะที่โครงสร้างทางสังคมมีส่วนในการกำหนดพฤติกรรมของปัจเจก\nเช่นกัน\nThis course introduces the social sciences which play an important role in 21st-\ncentury society. It focuses on important and fundamental disciplines, concepts and major\ntheories concerning contemporary issues in an increasingly globalized and innovative\nworld. In doing so, the course reconsiders social phenomena and issues and the extent to\nwhich society is the product of individual agency and the extent to which social structure\ndetermines individual behavior.\nหมวดสุนทรียะและทักษะการสื่อสาร\nศศ.101 การคิด อ่าน และเขียนอย่างมีวิจารณญาณ 3(3-0-6)\nLAS101 Critical Thinking, Reading, and Writing\nพัฒนาทักษะการคิดอย่างมีวิจารณญาณผ่านการตั้งคำถาม การวิเคราะห์ การสังเคราะห์ และ\nการประเมินค่า พัฒนาทักษะการอ่านเพื่อจับสาระสำคัญ เข้าใจจุดมุ่งหมาย ทัศนคติสมมติฐาน หลักฐาน\nสนับสนุน การใช้ เหตุผลที่นำไปสู่ข้อสรุปของงานเขียน พัฒนาทักษะการเขียนแสดงความคิดเห็นอย่างมี\nเหตุผลและการเขียนเชิงวิชาการ รู้จักถ่ายทอดความคิดและเชื่อมโยงข้อมูลเข้ากับมุมมองของตนเอง\nรวมถึงสามารถอ้างอิงหลักฐาน และข้อมลู มาใช้ในการสร้างสรรค์งานเขียนได้อย่างมีประสิทธิภาพ\nมคอ. 2 หลักสูตรศิลปศาสตรบัณฑิต สาขาวิชานวัตกรรมการบริการ (หลักสูตรนานาชาติ) หน้า 24 Development of critical thinking through questioning, analytical, synthetic and\nevaluation skills. Students learn how to read without necessarily accepting all the\ninformation presented in the text, but rather consider the content in depth, taking into\naccount the objectives, perspectives, assumptions, bias and supporting evidence, as well\nas logic or strategies leading to the author’s conclusion. The purpose is to apply these\nmethods to students’ own persuasive writing based on information researched from\nvarious sources, using effective presentation techniques.\nมธ.106 ความคิดสร้างสรรค์และการสื่อสาร 3(3-0-6)\nTU106 Creativity and Communication\nกระบวนการคิดอย่างสร้างสรรค์ โดยมีการคิดเชิงวิพากษ์องค์ประกอบสำคัญ และ\nการสื่อสารความคิดดังกล่าวให้เกิดผลสัมฤทธิ์อย่างเหมาะสมตามบริบทสังคม วัฒนธรรม สภาพแวดล้อม\nทั้งในระดับบุคคล องค์กร และสังคม\nCreative thought processes, with critical thinking as an important part, as well as\ncommunication of these thoughts that lead to suitable results in social, cultural and\nenvironmental contexts, at personal, organisational and social levels\nปด.103 มนุษยศาสตร์ในยุคแห่งการผันผวน 3(3-0-6)\nPD103 Humanities in the Age of Disruption\nวิชานี้แนะนำความรู้ทางด้านมนุษยศาสตร์ ผ่านการทบทวนพัฒนาการที่สำคัญทางวัฒนธรรม มี\nเป้าหมายให้นักศึกษามีความเข้าใจเกี่ยวกับมนุษย์ยุคปัจจุบัน ผ่านความรู้ทางศิลปศาสตร์ ดนตรีศาสนา\nปรัชญา และประวัติศาสตร์ โดยกลับมาพิจารณาสมมติฐานพื้นฐานของการดำรงอยู่ของมนุษย์ที่ก่อร่างขึ้น\nในยุคแห่งเทคโนโลยีดิจิทัล\nAn introduction to the humanities, through a review of some of the major\ndevelopments in culture. The goal is for students to understand how contemporary\nhuman issues can be understood through the arts, literature, music, religion, philosophy\nand history. In doing so, the course reconsiders the underlying assumptions of our human\nexistence, formed in the age of digital technology.\nมคอ. 2 หลักสูตรศิลปศาสตรบัณฑิต สาขาวิชานวัตกรรมการบริการ (หลักสูตรนานาชาติ) หน้า 25 ปด.104 เส้นทางสู่ความสมัยใหม่และโลกาภิวัตน์ 3(3-0-6)\nPD104 The Path to Modernity and Globalization\nวิชานี้ศึกษาปัจจัยต่าง ๆ ที่นำไปสู่การก่อร่างสร้างโลกสมัยใหม่ตั้งแต่ศตวรรษที่ 16 จนถึง\nปัจจุบัน สำรวจจุดเชื่อมต่อที่สำคัญที่ทำให้สังคมมนุษย์ดำเนินมาสู่ความสมัยใหม่ และตรวจสอบความ\nเชื่อมโยงระหว่างสังคม เศรษฐกิจ การเมือง การปกครอง วัฒนธรรม วิทยาศาสตร์ และเทคโนโลยีในฐานะ\nพื้นฐานของโลกาภิวัตน์\nThe course introduces students to forces that shaped the modern world and the\ndevelopment of a modern global society, from the sixteenth century to the present. It\nexplores the major critical junctures that placed human society on a path towards\nmodernity. It examines the linkages between society, economics, politics, administration,\nculture, and science and technology as the foundation for globalization. Tuxxx\nUnderstanding yourself and personal development for healthcare professional\nจน.171 ภาษาจีน 1 3(3-0-6)\nCH171 Chinese 1\nทักษะพื้นฐานภาษาจีนด้านการออกเสียง วิธีการเขียนตัวอักษรจีน โครงสร้างประโยค ตลอดจน\nวงศัพท์ประมาณ 450 คำ\nBasic skills of Chinese language including phonetics, Chinese characters, grammar\nand a vocabulary of 450 words.\nจน.172 ภาษาจีน 2 3(3-0-6)\nCH172 Chinese 2\nวิชาบังคับก่อน : สอบได้จน.171 หรือผ่านการทดสอบ หรือได้รับอนุมัติจากผู้บรรยาย\nรูปประโยคที่ซับซ้อนขึ้น คำศัพท์ภาษาจีนที่เพิ่มขึ้นจาก จน.171 อีกไม่น้อยกว่า 450 คำ\nPrerequisite: have earned credits of CH171, pass the screening test or with\napproval from the lecturer\nA continuation of CH171 with more complex sentences and a vocabulary of 450\nmore words.\nมคอ. 2 หลักสูตรศิลปศาสตรบัณฑิต สาขาวิชานวัตกรรมการบริการ (หลักสูตรนานาชาติ) หน้า 26 อซ.171 ภาษาเกาหลี 1 3(3-0-6)\nAS171 Korean 1\nภาษาเกาหลีเบื้องต้นเพื่อสร้างทักษะด้านการฟัง พูด อ่าน เขียน และโครงสร้างพื้นฐานของ\nภาษาเกาหลี\nIntroduction to elementary Korean language to provide usage skills to listening,\nspeaking, reading, writing and fundamental structures of Korean language\nอซ.172 ภาษาเกาหลี 2 3(3-0-6)\nAS172 Korean 2\nวิชาบังคับก่อน : สอบได้วิชา อซ. 171 หรือ กล.171\nภาษาเกาหลีเบื้องต้นต่อเนื่องจากภาษาเกาหลี 1 เพื่อให้สามารถนำมาใช้ในชีวิตประจำวันได้\nPre-requisite: have earned credits of AS171 or KO171\nStudying elementary Korean language in continuation from Korean 1 to acquire\nbasic usage skills of the language in daily life.\nสษ.105 ทักษะการสื่อสารทางภาษาอังกฤษ 3(3-0-6)\nEL105 English Communication Skills\nพัฒนาทักษะการสื่อสารทางภาษาอังกฤษด้านการฟัง พูด อ่าน และเขียน ฝึกการใช้ภาษา\nคำศัพท์ และสำนวนในบริบททางวิชาการและสังคม\nDevelopment of English communication skills, including listening, speaking,\nreading and writing. Practice of language, vocabulary and expressions used in academic\nand social contexts.\nหมวดคณิตศาสตร์ วิทยาศาสตร์และเทคโนโลยี\nมธ.103 ชีวิตกับความยั่งยืน 3(3-0-6)\nTU103 Life and Sustainability\nการดำเนินชีวิตอย่างเท่าทันกับการเปลี่ยนแปลงของโลก เข้าใจความสัมพันธ์ระหว่างพลวัตของ\nธรรมชาติมนุษย์ และสรรพสิ่ง ทั้งสิ่งแวดล้อมสรรสร้าง การใช้พลังงาน เศรษฐกิจ สังคมในความขัดแย้ง\nและการแปรเปลี่ยน ตลอดจนองค์ความรู้ทางวิทยาศาสตร์สิ่งแวดล้อม ที่นำไปสู่การปรับเปลี่ยนวิถีชีวติสู่\nความยั่งยืน\nThis course provides an introduction to the importance of life-cycle systems\nperspectives in understanding major challenges and solutions to achieving more\nsustainable societies in this changing world. Students will learn about the relationship\nมคอ. 2 หลักสูตรศิลปศาสตรบัณฑิต สาขาวิชานวัตกรรมการบริการ (หลักสูตรนานาชาติ) หน้า 27 between mankind and the environment in the context of energy and resource use,\nconsumption and development, and environmental constraints. Furthermore, an\nexamination of social conflict and change from the life-cycle perspective will be used to\ndevelop an understanding of potential solution pathways for sustainable lifestyle\nmodifications.\nมธ.107 ทักษะดิจิทัลกับการแก้ปัญหา 3(3-0-6)\nTU107 Digital Skill and Problem Solving\nทักษะการคิดเชิงคำนวณเพื่อการแก้ปัญหาและการพัฒนาโอกาสใหม่ด้านสังคมและเศรษฐกิจ\nความสามารถในค้นหาและการเข้าถึงสารสนเทศได้อย่างมีประสิทธิภาพ การประเมินความน่าเชื่อถือของ\nสารสนเทศ การกลั่นกรองและจัดการสารสนเทศอย่างระบบ การใช้และจรรยาบรรณด้านดิจิทัล\nการสื่อสารออนไลน์อย่างมืออาชีพ\nBasic computational thinking skill for solving problems and developing new social\nand economic opportunities. Efficient access and search for information. Information\nreliability evaluation. Filtering and managing information systematically. Ethical digital\nusage and professional online communication.\nหมวดสุขภาวะและทักษะแห่งอนาคต\nมธ.108 การพัฒนาและจัดการตนเอง 3(3-0-6)\nTU108 Self Development and Management\nการจัดการและการปรับเข้ากับชีวิตในรั้วมหาวิทยาลัยท่ามกลางความหลากหลายและเสรีภาพ\nการพัฒนาทักษะทางสังคมและความฉลาดทางอารมณ์ การเข้าใจตนเองและการวางแผนอนาคต\nการพัฒนาการเรียนรู้ตลอดชีวิต และการอยู่ร่วมกับผู้อื่นอย่างสงบสุขและเคารพซึ่งกันและกัน\nCoping with and adaptation to university life. Development of social skill and\nemotional intelligence. Self understanding and planning for the future. Personality and\nsocial etiquette. Learning to live harmoniously and respectfully with others and the\nsociety.\nมคอ. 2 หลักสูตรศิลปศาสตรบัณฑิต สาขาวิชานวัตกรรมการบริการ (หลักสูตรนานาชาติ) หน้า 28 หมวดการบริการสังคมและการเรียนรู้จากการปฏิบัติ\nมธ.100 พลเมืองกับการลงมือแก้ปัญหา 3(3-0-6)\nTU100 Civic Engagement\nปลูกฝังจิตสำนึก บทบาท และหน้าที่ความรับผิดชอบของการสมาชิกที่ดีของสังคมในฐานะ\nพลเมืองโลก ผ่านกระบวนการหลากหลายวิธี เช่น การบรรยาย การอภิปรายกรณีศึกษาต่าง ๆ ดูงาน\nต้น โดยนักศึกษาจะต้องจัดทำโครงการรณรงค์ เพื่อให้เกิดการรับรู้หรือเกิดการเปลี่ยนแปลงใน\nประเด็นที่สนใจ\nInstillation of social conscience and awareness of one’s role and duties as a good\nglobal citizen. This is done through a variety of methods such as lectures, discussion of\nvarious case studies and field study outings. Students are required to organize a campaign\nto raise awareness or bring about change in an area of their interest.\nมคอ. 2 หลักสูตรศิลปศาสตรบัณฑิต สาขาวิชานวัตกรรมการบริการ (หลักสูตรนานาชาติ) หน้า 29 วิชาเฉพาะ\nวิชาบังคับ\nนบ.180 ข้อมูลภาพนิทัศน์ 3(3-0-6)\nSV180 Data Visualization\nข้อมูลภาพนิทัศน์ในภาพรวม การวิเคราะห์กลุ่มเป้าหมาย แผนภาพสรุปข้อมูลและการเล่า\nเรื่องราวด้วยข้อมูล การออกแบบข้อมูลภาพนิทัศน์ทางธุรกิจ ธุรกิจอัจริยะ\nOverview of data visualization; target analyzing; dashboard and storytelling with\ndata; data visualization design for business; business intelligence\nนบ.200 นวัตกรรมเพื่อการมุ่งเน้นลูกค้า 3(3-0-6)\nSV200 Customer-Focused Innovation\nการเก็บและวิเคราะห์ข้อมูลเชิงลึกที่ทันสมัยเกี่ยวกับความต้องการของลูกค้า การพัฒนาต้นแบบ\nและทดสอบกับลูกค้า การสร้างธุรกิจที่เน้นลูกค้าศูนย์กลางโดยใช้การคิดเชิงออกแบบ\nCollecting and analyzing cutting-edge insights about the needs of customers;\ndeveloping prototypes and test with customers; creating a customer-centric business using\ndesign thinking\nนบ.210 เศรษฐศาสตร์และการวิเคราะห์สภาวะทางธุรกิจสำหรับ 3(3-0-6)\nการจัดการนวัตกรรมการบริการ\nSV210 Economics and Business Conditions Analysis for Service Innovation\nManagement\nหลักการเบื้องต้นเกี่ยวกับเศรษฐศาสตร์ ทฤษฏี และการประยุกต์ใช้ในนวัตกรรมการบริการ รวมถึง\nหน้าที่ของเศรษฐกิจในตลาดสมัยใหม่ เศรษฐศาสตร์จุลภาคที่วิเคราะห์พฤติกรรมของผู้บริโภคและธุรกิจ\nวิเคราะห์ตลาดสำหรับการบริการและทางเลือกนโยบายที่เกี่ยวข้อง และเศรษฐศาสตร์มหภาคที่เกี่ยวเนื่อง\nกับสภาวะการณ์ทางเศรษฐกิจระดับประเทศ รวมทั้งการคาดการณ์ผลกระทบต่อโครงสร้างธุรกิจ และ\nองค์กร\nPrinciples of economics; concepts and its application for service innovation;\nfunctioning of the modern market economy; microeconomics that analyzing the behavior\nof consumers and firms; analyzing markets for services and policy choices that affect these\nmarkets and macroeconomics that concern the national economic conditions which also\nencapsulate the impact to business conditions and organization\nมคอ. 2 หลักสูตรศิลปศาสตรบัณฑิต สาขาวิชานวัตกรรมการบริการ (หลักสูตรนานาชาติ) หน้า 30 นบ.211 บัญชีและการเงินสำหรับการจัดการนวัตกรรมการบริการ 3(3-0-6)\nSV211 Accounting and Finance for Service Innovation Management\nหลักการพื้นฐานของบัญชีองค์ประกอบด้านการบัญชีรูปแบบโครงสร้างทางธุรกิจต่าง ๆ\nการออกแบบ เนื้อหาและองค์ประกอบของรายงานทางการเงินประกอบด้วย รายงานงบแสดงสถานะทาง\nการเงิน งบกำไรขาดทุน งบกระแสเงินสดและกำไรสะสม รวมทั้งความเข้าใจด้านเนื้อหาของงบการเงิน\nความหมายของคำศัพท์เฉพาะทางด้านการเงิน การแปลงผลการดำเนินงานขององค์กรจากข้อมูลที่ปรากฏ\nในงบการเงิน การใช้แนวคิดด้านการเงิน การจัดการทางการเงิน มูลค่าเงินตามเวลา วิธีการวิเคราะห์ทาง\nการเงิน และจัดการทางการเงินเพื่อสนับสนุนการตัดสินใจในการบริหารและการลงทุนเบื้องต้น\nThe objectives of the course cover the fundamentals of accounting principles; the\nvarious branches of accounting; the different service business structures; the construction\nand content of the financial statements; the balance sheet; the income statement; the\nstatement of cash flows; the statement of retained earnings; the analysis and interpreting\nthe financial statements; terminology used in finance; time value of money; various\nmethods of financial management; making basic managerial and investment decisions\nนบ.212 การตลาดดิจิทัลสำหรับการจัดการนวัตกรรมบริการ 3(3-0-6)\nSV212 Digital Marketing for Service Innovation Management\nการพัฒนากลยุทธ์การตลาดดิจิทัลที่มีผลกระทบสูง การเพิ่มประสิทธิภาพการเติบโตของธุรกิจโดย\nใช้กลยุทธ์การตลาดดิจิทัลและการได้มาซึ่งลูกค้า เช่น Metaverse, Podcast, Google Search Engine\nOptimization (SEO) และการตลาดโซเชียลมีเดีย\nDeveloping high-impact digital marketing strategies; optimizing business growth\nusing digital marketing; customer acquisition strategies such as the metaverse; podcast,\nGoogle search engine optimization (SEO); social media marketing\nนบ.213 การจัดการทรัพยากรมนุษย์ระหว่างประเทศ 3(3-0-6)\nSV213 International Human Resources Management\nภาพรวมของการจัดการทรัพยากรมนุษย์ นโยบายและระเบียบปฏิบัติการสรรหาและการ\nคัดเลือก การปฐมนิเทศและการมอบหมายหน้าที่การประเมินประสิทธิภาพการทำงาน หลักสูตรฝึกอบรม\nการจัดการค่าตอบแทนและรางวัล แรงงานสัมพันธ์ ความปลอดภัยและสวัสดิการ การออกแบบองค์กร\nสำหรับองค์กรระหว่างประเทศ การจัดการทรัพยากรมนุษย์สำหรับคู่ความร่วมมือระหว่างประเทศ กลยุทธ์\nการจัดการทรัพยากรมนุษย์ระหว่างประเทศ แรงจูงใจ ความผู้นำและการสื่อสารสำหรับองค์กร\nระหว่างประเทศ จริยธรรมสำหรับธุรกิจระหว่างประเทศ\nมคอ. 2 หลักสูตรศิลปศาสตรบัณฑิต สาขาวิชานวัตกรรมการบริการ (หลักสูตรนานาชาติ) หน้า 31 Overview of human resource management; policies and procedure; recruitment\nand selection; orientation and induction; performance evaluation; training program;\ncompensation and reward management; labor relation; safety and welfare; organizational\ndesign for international organization; human resource management for international\npartnership; international human resource management strategy; motivation; leadership;\ncommunication for international organization; ethics for international business\nนบ.214 กฎหมายธุรกิจสำหรับการจัดการนวัตกรรมการบริการ 3(3-0-6)\nSV214 Business Law for Service Innovation Management\nความรู้ด้านกฎหมายเกี่ยวกับอุตสาหกรรมการบริการ การระบุและวิเคราะห์ประเด็นเพื่อ\nประยุกต์ใช้กฏหมายเกี่ยวกับโครงสร้างธุรกิจการบริการ ความเข้าใจกฏหมายการทำธุรกิจ กฎหมาย\nการจ้างงาน กฏหมายองค์กรธุรกิจ การตระหนัก วิเคราะห์ และประเมินประเด็นต่าง ๆ ที่เกี่ยวข้องกับ\nกฏหมายเพื่อนำมาใช้ในการตัดสินใจอย่างเหมาะสม\nIntroduction to legal aspects of the service industry; identifying and analysis issues\nby applying legal principles to service business structures; understanding business law;\nemployment law; and business organizations; recognizing; analysis; evaluating legal issues\nfor making and articulating appropriate decisions\nนบ.230 การสื่อสารทางธุรกิจ 3(3-0-6)\nSV230 Business Communication\nการติดต่อสื่อสารในธุรกิจอย่างมีประสิทธิภาพ การเขียนจดหมายธุรกิจ เรียงความ รายงาน\nบันทึกการประชุม การจดบันทึกการประชุม การนำเสนอแผนธุรกิจ ประวัติส่วนตัว จดหมายสมัครงาน\nการสัมภาษณ์และรับฟังลูกค้า\nEffective communication skills in business professional; business letters; essays;\nreporting; memoranda; minute taking; business pitching; resume and cover letter;\ninterviewing and listening\nนบ.232 กลยุทธ์การสร้างแบรนด์และช่องทางการสื่อสารทางการตลาด 3(3-0-6)\nSV232 Brand and Communication Management for Service Industry\nแนวคิดและความสำคัญของการจัดการตราสินค้าในธุรกิจบริการ ความแตกต่างระหว่างการตลาด\nและตราสินค้า หน้าที่และความรับผิดชอบของผู้จัดการตราสินค้า กระบวนการวาแผนเพื่อออกแบบตรา\nสินค้า การกำหนดตำแหน่งตราสินค้า อัตลักษณ์ของตราสินค้า คุณค่าตราสินค้า การกำหนดกลยุทธ์\nการตลาดของตราสินค้า ตัวอย่างธุรกิจที่ประสบความสำเร็จในการจัดการตราสินค้าในธุรกิจการบริการ\nมคอ. 2 หลักสูตรศิลปศาสตรบัณฑิต สาขาวิชานวัตกรรมการบริการ (หลักสูตรนานาชาติ) หน้า 32 Concepts and the importance of brand for service industry; differences between\nmarketing and branding; roles and responsibilities of a brand manager; planning process\nfor brand design; brand positioning; brand identity; brand equity; brand management\nstrategy; examples of successful branding in service industry\nนบ.241 การจัดการโรงแรมในระดับนานาชาติ 3(3-0-6)\nSV241 International Hotel Management\nบทนำสู่อุตสาหกรรมโรงแรมระดับนานาชาติบทบาทและหน้าที่หลักของแผนกโรงแรมต่าง ๆ\nพร้อมด้วยหลักการจัดการขั้นพื้นฐานที่เกี่ยวข้อง แผนกต้อนรับในบทบาทหลักของโรงแรม วัฏจักรแขก\nตั้งแต่การจองจนถึงออกจากโรงแรม การทำงานร่วมกันระหว่างหน่วยงาน\nAn introduction to an international hotel industry; role and function of all major\nhotel departments along with the basic management principles involved; front office as\nthe central role of a hotel; guest cycle from reservations to departure; collaboration\nbetween departments\nนบ.243 การจัดการธุรกิจการบิน 3(3-0-6)\nSV243 Airline Business Management\nความมาและวิวัฒนาการของธุรกิจการบิน การบริหารจัดการธุรกิจการบินต่าง ๆ การ\nดำเนินงานในธุรกิจการบิน การจัดตารางเวลาการบิน การสำรองที่นั่ง การคำนวณค่าบัตรโดยสารและการ\nสร้างรายได้ของสายการบินในรูปแบบต่าง ๆ การให้บริการผู้โดยสารทั่วไป ระเบียบพิธีการเข้า-ออก\nระหว่างประเทศ ระเบียบและข้อตกลงระหว่างประเทศที่เกี่ยวข้องกับธุรกิจสายการบิน และแนวโน้มใน\nอนาคตของธุรกิจการบิน\nA study of the history and development of the airline business; characteristics of\nairline industry; airline operations; airline network; reservation system; air fare pricing and\nrevenue management; passenger service; rules and regulations of immigration and\nemigration; international agreements related to the airline business; future trends of the\nairline industry\nนบ.244 การพัฒนาแหล่งท่องเที่ยวเชิงสุขภาวะ 3(3-0-6)\nSV244 Wellness tourism destination development\nสุขภาวะทางร่างกายและจิตใจ นักท่องเที่ยวเชิงสุขภาวะกลุ่ม Millennials การออกแบบ\nประสบการณ์เชิงสุขภาวะสำหรับวัยสูงอายุ การพัฒนากิจกรรมเพื่อสุขภาพ เช่น สปาเพื่อสุขภาพ และ\nการฟื้นฟูสมรรถภาพทางกีฬา\nมคอ. 2 หลักสูตรศิลปศาสตรบัณฑิต สาขาวิชานวัตกรรมการบริการ (หลักสูตรนานาชาติ) หน้า 33 Physical and mental well-being; millennial wellness tourists; wellness experience\ndesign for active aging; developing wellness activities such as spa for health, and sport\nrecovery\nนบ.261 การจัดการกิจกรรมพิเศษทางการตลาด 3(3-0-6)\nSV261 Special Event Management\nแนวคิดและทฤษฎีพื้นฐานด้านการจัดการกิจกรรมพิเศษทางการตลาด ซึ่งจะครอบคลุมไปถึงงาน\nเปิดตัวสินค้า นิทรรศการ งานเสดงสินค้า การจัดเลี้ยงทั้งในและนอกสถานที่การวางแผนการจัดงาน การ\nประสานงานกับผู้ที่เกี่ยวข้อง การจัดโปรแกรมและกิจกรรม ประเด็นด้านบริหารจัดการที่ส่งผลกระทบต่อ\nอุตสาหกรรมและแนวโน้มในอนาคต\nBasic concepts and theories of special event management including product\nlaunch and exhibition; catering on-premises and off-premises; event planning; stakeholders\ncoordinating; events programming and activities; managerial issues that effect on the\nindustry; future trends of the industry\nนบ.320 ความยั่งยืนในอุตสาหกรรมการบริการ 3(3-0-6)\nSV320 Sustainability in Service Industry\nความสำคัญ แนวคิด และหลักการพัฒนาอย่างยั่งยืนในภาคอุตสาหกรรมการบริการ การประกอบ\nธุรกิจบริการที่มีความรับผิดชอบต่อสังคม การประเมินผลกระทบจากภาคอุตสาหกรรมการบริการ การมี\nส่วนร่วมเพื่อการพัฒนาอุตสาหกรรมการบริการอย่างยั่งยืน การบริหารจัดการอุตสาหกรรมการบริการเพื่อ\nความยั่งยืน\nImportance of sustainability in service industry; principles and foundations of\nsustainable development in service industry; responsible business concepts and practices;\ncorporate social responsibility; service industry impacts assessment; participatory approach\nfor sustainable service industry development; sustainable management and solutions for\nservice industry\nนบ.321 สัมมนาเชิงปฏิบัติการเรื่องนวัตกรรมและการสร้างสรรค์ 3(3-0-6)\nSV321 Innovation and Creativity Workshop\nการพัฒนาการคิดเชิงการออกแบบเพื่อส่งเสริมความคิดสร้างสรรค์ ความยืดหยุ่น ความเห็นอก\nเห็นใจ และความคิดสร้างสรรค์ทีม การฝึกฝนทักษะทางสังคมเพื่อผู้นำที่เน้นผลลัพธ์มากกว่า\nขั้นตอน เทคนิคการแก้ปัญหาด้วยนวัตกรรมสำหรับการสัมมนาเชิงปฏิบัติการในรูปแบบออนไลน์และใน\nสถานที่\nมคอ. 2 หลักสูตรศิลปศาสตรบัณฑิต สาขาวิชานวัตกรรมการบริการ (หลักสูตรนานาชาติ) หน้า 34 Developing a design thinking mindset to enhance creativity; flexibility; empathy as\na team; sharpening “soft skills” to become a more agile leader; innovative problem-solving\ntechniques for online and on-site workshops\nนบ.330 การบริหารข้ามวัฒนธรรมภายใต้สภาพแวดล้อมระดับโลก 3(3-0-6)\nSV330 Cross-Cultural Management in a Global Environment\nการสำรวจบริบททางวัฒนธรรมต่อการประกอบธุรกิจในระดับนานาชาติ แนวปฏิบัติและแนวทาง\nในการบริหารจัดการข้ามวัฒนธรรมอย่างมีประสิทธิภาพ มารยาทในการบริหารธุรกิจข้ามวัฒนธรรม\nการตระหนักถึงความหลากหลายทางวัฒนธรรมเพื่อการแข่งขันทางธุรกิจ ทักษะการสื่อสารและการเจรจา\nทางธุรกิจข้ามวัฒนธรรม\nIntroduction and exploration of the cross-cultural contexts in international\nbusiness; approaches and guidelines for cross-cultural management with effectiveness;\nawareness and understanding of diversity for competitive advantage; etiquette in cross-\ncultural business management; cross-cultural communication and business negotiation\nนบ.331 การวางแผนเชิงกลยุทธ์สำหรับการจัดการนวัตกรรมการบริการ 3(3-0-6)\nSV331 Strategic Planning for Service Innovation Management\nการพัฒนาทักษะการคิดเชิงกลยุทธ์สำหรับอุตสาหกรรมการบริการ ความสามารถในการมอง\nภาพรวมขององค์กร การวิเคราะห์แนวโน้มและสถานการณ์การแข่งขันทางธุรกิจ สิ่งที่จำใน\nการประกอบธุรกิจที่จะนำพาไปสู่ความสำเร็จในอนาคต ทักษะการคิดอย่างสร้างสรรค์และการคิดเชิง\nออกแบบในกระบวนการตัดสินใจ การแก้ปัญหา และการบริการลูกค้า\nStrategic thinking development for the service industry; capacity building for holistic\nunderstanding of business organization; trends; situations and competitive landscape\nidentification and analysis; creative thinking and design thinking for decision-making;\nproblem-solving; customer service\nนบ.333 การบริหารโครงการ 3(3-0-6)\nSV333 Project Management\nศึกษาการจัดทำโครงการ การบริหารโครงการในรูปแบบต่าง ๆ การกำหนดวัตถุประสงค์ของ\nโครงการ การวิเคราะห์สภาพแวดล้อมของโครงการ การวิเคราะห์ความไปได้ของโครงการ การวางแผน\nการดำเนินงาน การบริหารทีมงานในโครงการ การบริหารทรัพยากรที่นำมาใช้ในโครงการ กลยุทธ์การ\nสื่อสารภายในโครงการ การติดตามและประเมินผลโครงการ และยุติโครงการ\nมคอ. 2 หลักสูตรศิลปศาสตรบัณฑิต สาขาวิชานวัตกรรมการบริการ (หลักสูตรนานาชาติ) หน้า 35 A study of project management; setting project objectives; understanding project\ncontext; project feasibility analysis; project planning; matrix model organization; allocation\nof resources; internal strategy communication; work break down structure; project\ntimeline; technique and operation procedures; implementation and evaluation; closing\nproject.\nนบ.340 นวัตกรรมและการออกแบบผลิตภัณฑ์ 3(3-0-6)\nSV340 Innovation and Product Development Project\nการประยุกต์ใช้ทฤษฎีหลักแนวคิดและทักษะต่าง ๆ ที่ได้เรียนรู้ในหลักสูตร เพื่อผลิตนวัตกรรม\nและสินค้าในธุรกิจการบริการ การส่งเสริมให้เกิดการคิดวิเคราะห์และแก้ปัญหาที่มักจะเกิดขึ้นในการผลิต\nนวัตกรรมและสินค้า\nThe course focuses on issues central to innovation and the development of new\nproducts in the services industry; business issues in service industry; developing product\nprototypes; demonstrating and showcasing innovation and products\nนบ.351 การจัดการอาหารและเครื่องดื่ม 3(3-0-6)\nSV351 Management of Food & Beverage Operations\nแนวคิดต่าง ๆ ที่เกี่ยวข้องกับการวางแผนธุรกิจอาหารและเครื่องดื่ม การออกแบบและวางแผน\nเมนูอาหารและเครื่องดื่ม เทคนิคการบริการ องค์ความรู้ด้านการจัดซื้อ การรับสินค้า การกักเก็บสินค้า\nการนำมาใช้และการขายสินค้า การคิดต้นทุน ระบบต่าง ๆ ที่เกี่ยวข้องกับการบริหารและการจัดการ\nบุคลากร ความรู้เบื้องต้นเกี่ยวกับ ชา กาแฟ ไวน์ และแอลกอฮอล์ประเภทต่าง ๆ รวมถึงความปลอดภัย\nทางอาหารและสุขลักษณะอาหาร การพัฒนานวัตกรรมต่าง ๆ เพื่อส่งเสริมความยั่งยืนในธุรกิจอาหารและ\nเครื่องดื่ม\nThe course covers topics in food and beverage concept development; menu\ndesign and planning; service styles; purchasing; receiving; storing; cooking and selling food\nand beverage products and services; administrative and human resource management.\nBasic knowledge on beverage specialist such as tea, coffee, wine, cocktail mixologist; food\nsafety and hygiene; innovation for business sustainability\nมคอ. 2 หลักสูตรศิลปศาสตรบัณฑิต สาขาวิชานวัตกรรมการบริการ (หลักสูตรนานาชาติ) หน้า 36 นบ.430 การออกแบบงานวิจัยและระเบียบวิธีวิจัยสำหรับนวัตกรรม 3(3-0-6)\nการบริการ\nSV430 Research Design and Methodology for Service\nInnovation\nทักษะด้านการทำวิจัย ความสำคัญของการวิจัยเพื่อใช้วิเคราะห์และตัดสินใจ รูปแบบงานวิจัย\nองค์ความรู้ในการค้นคว้า การตั้งประเด็นงานวิจัย การเก็บข้อมูลและวิเคราะห์ การเขียนรายงานวิจัย\nการนำเสนอผลงานวิจัย พัฒนาความสามารถด้านการทำวิจัย ความพร้อมด้านการทำงานวิจัยด้าน\nนวัตกรรมการบริการ\nResearch skills for critical thinking and decision-making; importance of different\nresearch methods and approaches; research issues identification; data collection and\nanalysis; academic research writing; professional research result presentation skill;\nreadiness of academic research applying to real-world practice in service industry\nนบ.431 โครงการที่ปรึกษาทางนวัตกรรมการบริการ 3(3-0-6)\nSV431 Service Innovation Consultancy\nการประยุกต์ใช้ทฤษฎีหลักแนวคิดและทักษะต่าง ๆ ที่ได้เรียนรู้ในหลักสูตร การทำโครงการด้าน\nการบริการและนวัตกรรมที่แสดงถึงความสามารถในการจัดการโดยรวม การส่งเสริมให้เกิดการคิดแบบ\nพหุวิทยาการแบบองค์รวม\nThis course is designed to serve as the capstone experience to provide students\nwith an opportunity to bring together the various theories, concepts and skills that they\nhave been introduced to in the program. Students will work on a major project that\nprovides them with an opportunity to demonstrate and showcase their capacity to manage\nthe overall management process where multidisciplinary thinking will be stressed.\nนบ432 ความผู้ประกอบการดิจิทัล 3(3-0-6)\nSV432 Digital Entrepreneurship\nภาพรวมของผู้ประกอบการดิจิทัล การสร้างสถานะความผู้ประกอบการดิจิทัล กลยุทธ์ธุรกิจ\nดิจิทัล การการตลาดและการโฆษณาเชิงดิจิทัล การตลาดดิจิทัลเพื่อการท่องเที่ยวและการโรงแรม\nการตลาดสำหรับเครือข่ายสังคมและการตลาดบนโทรศัพท์เคลื่อนที่\nOverview of digital entrepreneurship; building the digital entrepreneurship\npresence; digital business strategy; digital marketing and advertising; digital marketing for\ntourism and hotel; social network and mobile marketing\nนบ.434 การวางแผนฉุกเฉินต่อเนื่องทางธุรกิจสำหรับธุรกิจบริการ 3(3-0-6)\nมคอ. 2 หลักสูตรศิลปศาสตรบัณฑิต สาขาวิชานวัตกรรมการบริการ (หลักสูตรนานาชาติ) หน้า 37 SV434 Business Continuity Management in Service Industry\nองค์ความรู้เกี่ยวกับการวางแผนฉุกเฉินต่อเนื่องทางธุรกิจ ความรู้และเข้าใจสภาพขององค์กร\nการวิเคราะห์ผลกระทบทางธุรกิจ การวิเคราะห์ความเสี่ยง การจำแนกความเสี่ยง การประเมินความเส่ยีง\nการจัดการความเสี่ยง การควบคุมความเสี่ยง การกำหนดแนวทางในการตอบสนองต่อการหยุดชะงักของ\nการดำเนินงานขององค์กร การพัฒนาและจัดเตรียมวิธีการตอบสนองต่อเหตุการณ์ในภาวะฉุกเฉิน\nThe course focuses on the principle of Business Continuity Plan (BCP);\nunderstanding organization context; business impact analysis; risk analysis; risk\nidentification; risk assessment; risk management; risk control; business continuity\nmanagement strategy; developing and Implementing BCM response\nนบ.460 การจัดการคุณภาพการบริการ 3(3-0-6)\nSV460 Service Quality Management\nกลยุทธ์การบริหารคุณภาพการบริการในธุรกิจบริการ การพัฒนามาตรการและมาตรฐานคุณภาพ\nการบริการที่สอดคล้องกับความคาดหวังของลูกค้าภายในและภายนอก การตัดสินใจเชิงกลยุทธ์เกี่ยวกับ\nผลกระทบต่อประสิทธิภาพขององค์กร\nService quality management strategies in service businesses; developing measures\nand standards of service quality that are consistent with the expectations of internal and\nexternal customers; making strategic decisions to their impact on organizational\nperformance\nนบ.461 การผลิตและปฏิบัติการงานอีเว้นท์ 3(3-0-6)\nSV461 Event Production and Operation\nการฝึกปฏิบัติการจัดงานอีเว้นท์จริง โดยวางแผนดำเนินงานตามมาตรฐานการจัดงานอีเว้นท์ การ\nออกองค์ประกอบต่าง ๆ ในงานอีเว้นท์ การตลาดและโปรโมทอีเว้นท์ การสนับสนุน การบริหาร\nงบประมาณ การบริหารทรัพยากรมนุษย์ การจัดการความเสี่ยง การจัดการสถานที่จัดงาน การจัดการงาน\nอีเว้นท์อย่างยั่งยืน การใช้เทคโนโลยีที่เกี่ยวข้อง การประเมินการจัดงาน\nProduce an actual event through the application of event management; event\ndesign; event marketing and promotion; event sponsorship; event budgeting; human\nresource management; risk management; venue management; sustainability practices;\ntechnology application; event evaluation\nนบ.484 การฝึกงานสำหรับอุตสาหกรรมการบริการ 3 (ฝึกงาน 270 ชั่วโมง)\nมคอ. 2 หลักสูตรศิลปศาสตรบัณฑิต สาขาวิชานวัตกรรมการบริการ (หลักสูตรนานาชาติ) หน้า 38 SV484 Internships for Service Industry (270 hrs.) 3 (Training 270 hrs.)\nการฝึกปฏิบัติในสถานที่ประกอบการธุรกิจการบริการในสาขาต่าง ๆ การพัฒนาความรู้และทักษะ\nด้านการให้บริการ ทักษะการแก้ปัญหาและการวางแผน การจัดทำรายงานผลการฝึกปฏิบัติงานหลังจาก\nเสร็จสิ้นการฝึกงาน การวัดผลแบ่งออก 2 ระดับ คือ S (ใช้ได้) และระดับ U (ใช้ไม่ได้)\nThe internship is designed as an opportunity to experience another work\nenvironment. The students are expected to develop knowledge and skills of observation,\nreflection, and planning. The students will also be expected to present a ‘reflective\npractitioner’ report at the end of the internship. Assessment for field training is graded into\n2 grades: S (Satisfactory) and U (Unsatisfactory).\nวิชาเลือก\nนบ.336 การบริหารรายได้และผลตอบแทน 3(3-0-6)\nSV336 Revenue and Yield Management\nวิธีการและกลยุทธ์สำหรับการบริหารจัดการโรงแรม ศูนย์การประชุมฯ และธุรกิจบริการที่\nเกี่ยวข้องอย่างมีประสิทธิภาพ การจัดการรายรับจากการดำเนินงานครอบคลุมทุกด้าน การบริหารจัดการ\nผลตอบแทนโดยคำนึงถึงการเพิ่มประสิทธิภาพ (Optimization) ในการจัดการรายได้จากการคาดการณ์\nความต้องการ และการใช้กลยุทธ์ดำนราคาที่มีพลวัตร เพื่อให้ได้ประโยชน์สูงสุดกับธุรกิจ\nThe objectives of this course is to enable the students to understand the strategies\nfor effectively managing the hotel, conference center capacity and service related facilities;\nrevenue management cover all areas of operations; yield management; forecasting and\ndemand management; strategic pricing; revenue optimizing design.\nนบ.346 การออกแบบและบริหารจัดการจุดหมายปลายทาง 3(3-0-6)\nSV346 Destination Design and Management\nความรู้เบื้องต้นด้านการพัฒนาท่องเที่ยว ความสำคัญของการออกแบบและบริหารจัดการ\nจุดหมายปลายทาง แนวโน้มภาคอุตสาหกรรมการท่องเที่ยว การออกแบบโปรแกรมนำเที่ยวอย่าง\nสร้างสรรค์ นวัตกรรมการพัฒนาการท่องเที่ยว\nIntroduction to tourism development; importance of destination design and\nmanagement; trends of potentials of tourism industry; creative design for tour program;\ninnovative tourism development\nนบ.355 การปฏิรูปด้านดิจิทัลในอุตสาหกรรมการท่องเที่ยวและการบริการ 3(3-0-6)\nมคอ. 2 หลักสูตรศิลปศาสตรบัณฑิต สาขาวิชานวัตกรรมการบริการ (หลักสูตรนานาชาติ) หน้า 39 SV355 Digital Transformation for Tourism and Service Industry\nความรู้เบื้องต้นเกี่ยวกับเทคโนโลยีในอุตสาหกรรมการท่องเที่ยวและการบริการ ภูมิทัศน์ การ\nท่องเที่ยวในรูปแบบดิจิทัล การยอมรับและการเผยแพร่นวัตกรรมในอุตสาหกรรมการท่องเที่ยวและการ\nบริการ ผู้ให้บริการด้านการท่องเที่ยวออนไลน์ นักท่องเที่ยวดิจิทัล สื่อสังคมออนไลน์ เทคโนโลยีสำหรับ\nการปฏิบัติการธุรกิจ เศรษฐกิจแบบแบ่งปัน และแนวโน้มเทคโนโลยีของอุตสาหกรรมในอนาคต\nIntroduction of digital technology in tourism and tourism and service industry;\ndigital tourism landscape; technology acceptance and diffusion of innovation in tourism\nand service industry; online travel intermediaries; digital tourists; social media; technology\nfor business operations; sharing economy; and future trends in digital tourism\nนบ.365 นวัตกรรมสังคมสำหรับการให้บริการสาธารณะ 3(3-0-6)\nSV365 Social Innovation for Public Service\nความเข้าใจเบื้องต้นเกี่ยวกับการให้บริการสาธารณะ บทบาทและหน้าที่รับผิดชอบขององค์การ\nภาครัฐและองค์การสาธารณะประเภทต่าง ๆ ความแตกต่างของผู้รับบริการและความต้องการ การจัดการ\nเพื่อตอบสนองความต้องการที่เผชิญการเปลี่ยนแปลงอย่างรวดเร็ว การใช้เทคโนโลยีและการจัดการ\nสมัยใหม่เพื่อตอบสนองการบริการที่มีประสิทธิภาพ ความเข้าใจเบื้องต้นเกี่ยวกับนวัตกรรมสังคมสำหรับ\nการให้บริการสาธารณะ\nUnderstanding of public goods and services; roles and responsibilities of\ngovernment agencies and public sectors; differences in service customers and needs;\nmanaging rapid change in public services; digitalization in public services for effectiveness;\nintroduction to social innovation for public services\nนบ.366 การจัดการกิจกรรมกีฬา 3(3-0-6)\nSV366 Sport Events Management\nความเข้าใจในการจัดการกิจกรรมกีฬา ประเภทของกิจกรรมกีฬา ผลกระทบของการจัดกิจกรรม\nกีฬา องค์กรทางด้านกีฬา การวางแผนกิจกรรมกีฬา การตลาด การสนับสนุนกิจกรรมกีฬา การจัดการ\nทรัพยากรมนุษย์และอาสาสมัคร การจัดการฝูงชน การจัดการความเสี่ยงในกิจกรรมกีฬา นวัตกรรมและ\nเทคโนโลยีในการจัดการกิจกรรมกีฬา ประเด็นด้านบริหารจัดการที่ส่งผลกระทบต่ออุตสาหกรรมและ\nแนวโน้มในอนาคต\nBasic concepts and theories of sport event management; types of sport events;\nsport events organizations impact of sports events; sport events planning; sport event\nmarketing; event sponsorship; event workforces and volunteer; crowd management; risk\nมคอ. 2 หลักสูตรศิลปศาสตรบัณฑิต สาขาวิชานวัตกรรมการบริการ (หลักสูตรนานาชาติ) หน้า 40 management in sport events; managerial issues that effect on the industry; future trends\nof the industry\nนบ.367 การจัดงานอีเว้นท์เชิงธุรกิจ 3(3-0-6)\nSV367 Business Event Management\nแนวคิดและทฤษฎีพื้นฐานด้านการจัดงานอีเว้นท์เชิงธุรกิจ ซึ่งจะครอบคลุมไปถึงงานประชุม\nการท่องเที่ยวเพื่อรางวัล การประชุมวิชาชีพ และการจัดแสดงสินค้าหรือนิทรรศการ การวางแผนการ\nจัดงาน การประสานงานกับผู้ที่เกี่ยวข้อง การจัดโปรแกรมและกิจกรรม ประเด็นด้านบริหารจัดการที่ส่งผล\nกระทบต่ออุตสาหกรรมและแนวโน้มในอนาคต\nBasic concepts and theories of business event management which covers Meeting,\nIncentives, Conference and Exhibition; business event planning; stakeholders coordinating;\nevents programming and activities; managerial issues that effect on the industry; future\ntrends of the industry\nนบ.435 การจัดการห่วงโซ่อุปทานสำหรับธุรกิจอาหาร 3(3-0-6)\nSV435 Supply-Chain Management in Food Production Process\nองค์รวมของกระบวนการจัดการห่วงโซ่อุปทานสำหรับธุรกิจอาหาร การเปลี่ยนแปลงกระบวนการ\nผลิตอาหารที่นำมาซึ่งความต้องการในการใช้วิธีการใหม่นวัตกรรมในการจัดการเพื่อให้ได้ประสิทธิภาพ\nประสิทธิผลที่ดียิ่งขึ้น แนวโน้มด้านการตลาด เทคโนโลยีใหม่ ฤดูกาล การคาดการณ์ความต้องการ การ\nวางแผนการผลิต ข้อจำกัดในด้านขีดความสามารถ การควบคุมคุณภาพ การดำเนินงานด้านสิ่งแวดล้อม\nทรัพยากรบุคคล ความปลอดภัยทางอาหาร และการเชื่อมโยงการขายและการวางแผน การผลิต\nOverall process of food production supply chain management; trends in the\nmarket; new technologies; seasonality; predicting demand; production planning; capacity\nconstraints; quality control; environmental practices; human resources; food safety and\nlinking sales to operations planning\nนบ.445 การบริการและการท่องเที่ยวผ่านประสบการณ์ 3(3-0-6)\nSV445 Experiential Hospitality and Tourism 3(3-0-6)\nประสบการณ์ในการบริการและการท่องเที่ยวระดับนานาชาติการเรียนรู้ผ่านประสบการณ์ตรง\nเพื่อเปิดโลกทัศน์ให้กว้างขึ้นในด้านการบริการและการท่องเที่ยว การสะท้อนผลการเรียนรู้ระหว่างและ\nหลังประสบการณ์ของผู้เรียน\nมคอ. 2 หลักสูตรศิลปศาสตรบัณฑิต สาขาวิชานวัตกรรมการบริการ (หลักสูตรนานาชาติ) หน้า 41 International hospitality and tourism experience. Learning through hands-on\nexperiences in order to expand their global mindset in hospitality and tourism. Reflection\non learning during and after the students’ experiences.\nนบ.446 การสำรวจตลาดด้านการบริการและการท่องเที่ยว 3(3-0-6)\nSV446 Marketing Exploration in Hospitality and Tourism 3(3-0-6)\nการสำรวจตลาดระดับนานาชาติดานการบริการและการทองเที่ยวการเรียนรูทักษะดานการตลาด\nขั้นสูงและการดูงานในตางประเทศกับองคกรชั้นนำการสะทอนผลการเรียนรูระหวางและหลังประสบการณ\nของผูเรียน\nInternational marketing exploration in hospitality and tourism. Learning through\nadvanced marketing skills and international site visits to leading organization. Reflection\non learning during and after the students’ experiences.\nนบ.455 การผู้ประกอบการธุรกิจสุขภาวะ 3(3-0-6)\nSV455 Wellness Business Entrepreneurship\nธุรกิจด้านสุขภาพ การบูรณาการภูมิปัญญาท้องถิ่นกับผลิตภัณฑ์และบริการเพื่อสุขภาวะ\nการพัฒนาผลิตภัณฑ์ SDG ชุมชนเพื่อสุขภาวะ\nWellness business integrating local wisdom into wellness products and services;\nSDG (Sustainable Development Goals) product development; wellness community\nนบ.456 การวิเคราะห์การแข่งขันสำหรับธุรกิจลักชูรี่ในตลาดอิ่มตัว 3(3-0-6)\n(Mature market) และตลาดเกิดใหม่ (Emerging market)\nSV456 Competitive Analysis for Luxury Business in Mature\nand Emerging Markets\nการทบทวนรูปแบบธุรกิจลักชูรี่ในตลาดอิ่มตัว การรักษาความผู้นำของธุรกิจลักชูรี่ด้วย\nนวัตกรรม การขยายธุรกิจหรูหราสู่ตลาดเกิดใหม่การวิเคราะห์ปัจจัยขับเคลื่อนคุณค่าหลักสำหรับ\nสภาพแวดล้อมทางธุรกิจที่มีเอกลักษณ์และหลากหลายเพื่อการเติบโตทางธุรกิจ\nRethinking luxury business models in the mature market; maintaining leading edge\nin luxury business through innovation; expanding luxury business into emerging markets;\nanalyzing the key value drivers for unique and diverse business environments in order to\ngrow business\nมคอ. 2 หลักสูตรศิลปศาสตรบัณฑิต สาขาวิชานวัตกรรมการบริการ (หลักสูตรนานาชาติ) หน้า 42 นบ.457 กลยุทธ์การตลาดและการสื่อสารลักชูรี่ 3(3-0-6)\nSV457 Luxury Marketing and Communication Strategies\nกระบวนการจัดการการตลาดสำหรับธุรกิจลักชูรี่ในบริบทระดับโลก บทบาทของการตลาดภายใน\nบริษัทลักชูรี่การพัฒนากลยุทธ์การตลาดและการสื่อสารลักชูรี่\nLuxury business marketing management processes in a global context; the role of\nmarketing within luxury companies; developing luxury marketing and communication\nstrategies.\nนบ.458 การออกแบบอาหารสำหรับธุรกิจจัดเลี้ยง 3(3-0-6)\nSV458 Food Design for Catering Services\nความรู้เบื้องต้นของธุรกิจจัดเลี้ยง ประเภทของธุรกิจจัดเลี้ยง กระบวนการวางแผนเพื่อ\nการจัดเลี้ยง การเลือกสถานที่จัดเลี้ยง การวางแผนรายการอาหารและเครื่องดื่มเพื่อการจัดเลี้ยง\nการออกแบบอาหารสำหรับธุรกิจการจัดเลี้ยง การบริการในงานจัดเลี้ยง การเลือกอุปกรณ์และวางแผน\nบุคลากรในการจัดเลี้ยง การคำนวณต้นทุนและกำหนดราคา\nIntroduction to catering services; on-premises and off-premises services; catering\nplanning process; site selection; menu planning; food design for catering services; service\noperations in catering services; equipment and staff arrangement; cost control and pricing\nstrategy\nนบ.459 นวัตกรรมการบริการเพื่อสังคมสูงวัย 3(3-0-6)\nSV459 Service Innovation for Silver Aging Society\nศึกษาด้านสภาพแวดล้อมที่เหมาะสมกับผู้สูงวัย การวางแผนออกแบบสินค้าและบริการเพื่อ\nตอบสนองความต้องการของผู้สูงวัย ไม่ว่าจะการจัดการที่พักอาศัย การออกแบบอาหารและเครื่องดื่ม\nสำหรับผู้สูงวัย และการออกแบบกิจกรรมสันทนาการ ประเด็นด้านบริหารจัดการที่ส่งผลกระทบต่อธุรกิจที่\nเกี่ยวข้องกับผู้สูงวัยและแนวโน้มในอนาคต\nUnderstanding of social gerontology; product and service development for silver\naging; senior living facilities; menu planning; leisure activities design; managerial issues that\neffect on the business related to silver aging society; future trends of the industry\nมคอ. 2 หลักสูตรศิลปศาสตรบัณฑิต สาขาวิชานวัตกรรมการบริการ (หลักสูตรนานาชาติ) หน้า 43 นบ.475 ศิลปะการประกอบอาหารผ่านประสบการณ์ 3(3-0-6)\nSV475 Experiential Culinary Arts 3(3-0-6)\nประสบการณ์ศิลปะการประกอบอาหารระดับนานาชาติการเรียนรู้ทักษะเชิงเทคนิคและเรียนรู้\nผ่านประสบการณ์ตรงด้านศิลปะการประกอบอาหาร การสะท้อนผลการเรียนรู้ระหว่างและหลัง\nประสบการณ์ของผู้เรียน\nInternational culinary arts experience. Learning through technical skill and hands-\non experiences in culinary arts. Reflection on learning outcome during and after the\nstudents’ culinary arts experiences.\nมคอ. 2 หลักสูตรศิลปศาสตรบัณฑิต สาขาวิชานวัตกรรมการบริการ (หลักสูตรนานาชาติ) หน้า 44",
    "หมวดที่ 5": "หมวดที่ 5 การจัดกระบวนการเรียนรู้\nลำดับ ผลลัพธ์การเรียนรู้ของหลักสูตร (PLOs) การจัดกระบวนการเรียนรู้วิธีการวัดและประเมินผล\nด้านความรู้ (Knowledge)\nK 1 มีความรู้อย่างกว้างขวางในหลักการพื้นฐานและทฤษฎีองค์ 1. การบรรยาย อภิปรายในการให้ 1. การประเมินผลสัมฤทธิ์โดย\nความรู้ที่เกี่ยวข้อง ความรู้ในทฤษฏีความรู้การสอบ\nK 2 มสีามารถนำความรู้หลักการและทฤษฏีไปประยุกต์ใช้ได้ 2. การสอนแบบบูรณการความรู้ของ 2. การค้นคว้าและทำรายงาน\nอย่างเหมาะสม ศาสตร์ต่าง ๆ ที่เกี่ยวข้องสัมพันธ์กัน 3. แบบฝึกหัด\nK 3 สามารถวิเคราะห์อย่างระบบเพื่อการพัฒนาและแข่งขัน 3. การสอนโดยใช้เทคโนโลยีการศึกษา 4. การนำเสนอรายงานโครงงาน\nในระบบชาติและนานาชาติ และงานวิจัย 5. การประเมินผลสัมฤทธิ์ โดย\nK 4 สามารถบูรณาการความรู้ที่เกี่ยวข้องผ่านงานวิจัยเพื่อ 4. การทำรายงาน โครงงาน การสอบการทำรายงาน\nออกแบบนวัตกรรมการบริการได้อย่างเหมาะสม 5. การศึกษาด้วยตนเองเกี่ยวกับ\nความสัมพันธ์ของศาสตร์ต่าง ๆ\nด้านทักษะ (Skills)\nS 1 สามารถประยุกต์ใช้ทักษะทางด้านนวัตกรรมการบริการได้ 1. การใช้กรณีศึกษาต่าง ๆ ในการฝึก 1. ประเมินจากคุณภาพของ\nอย่างเหมาะสม ทักษะการวิเคราะห์ การสังเคราะห์ ผลงานที่ได้รับมอบหมาย ทั้ง\nS 2 สามารถออกแบบและวิเคราะห์ปัญหาโจทย์การวิจัยที่ข้อมูล งานกลุ่มและงานเดี่ยว\nเกี่ยวกับนวัตกรรมบริการ และ เสนอแนะวิธีการแก้ไขและ 2. การศึกษาดูงานเพื่อเรียนรู้จากผู้ที่มีรายบุคคล\nผลการตัดสินใจได้อย่างเหมาะสม ประสบการณ์\nมคอ. 2 หลักสูตรศิลปศาสตรบัณฑิต สาขาวิชานวัตกรรมการบริการ (หลักสูตรนานาชาติ) หน้า 45 ลำดับ ผลลัพธ์การเรียนรู้ของหลักสูตร (PLOs) การจัดกระบวนการเรียนรู้วิธีการวัดและประเมินผล\nS 3 สามารถวิเคราะห์ปัญหา ประเมินสถานการณ์ และสร้าง 3. การมอบหมายงานวิจัยรายบุคคล 2. ประเมินจากการปฏิสัมพันธ์\nความสามารถในการแข่งขันสำหรับธุรกิจบริการ และธุรกิจ และรายกลุ่ม การแลกเปลี่ยนความคิดเห็น\nลักชูรี่ 4. การเรียนรู้จากการเล่มเกมส์ หรือ การแสดงความคิดของ\nS 4 มีความสามารถในการใช้เทคโนโลยีสารสนเทศในการ การแสดงบทบาทสมมตินักศึกษาระหว่างการเรียน\nวิเคราะห์และออกแบบการนำเสนอข้อมูลได้อย่างมี 5. กระบวนการเรียนการสอนแบบให้ 3. ประเมินจากผลการสอบ\nประสิทธิผล สัมผัสปัญหา (Problem-based ข้อเขียนโจทย์ที่ต้องใช้ทักษะ\nS 5 สามารถวิเคราะห์ข้อมูลด้านการเงินและสภาวะเศรษฐกิจ Learning) ทางปัญญาในการวิเคราะห์\nเพื่อประกอบการตัดสินใจได้อย่างมีประสิทธิภาพ 6. ลงมือปฏิบัติในการแก้ปัญหาด้วยการ 4. การประเมินทักษะการ\nS 6 สามารถประยุกต์ใช้การสื่อสารได้อย่างมืออาชีพทั้งในด้าน ให้ทำโครงงาน (Project-based สื่อสารด้วยภาษาเขียนและ\nของการเขียนและการพูดโดยใช้เทคโนโลยีที่เหมาะสม Learning) ภาษาพูดจากการนำเสนอผล\n7. บรรยาย/อภิปราย การทำงานกลุ่มและการ\n8. ปัญหาและเสนอแนวทางในการ ทำงานเดี่ยวรายบุคคล\nแก้ปัญหาอย่างน้อย1กิจกรรมต่อวิชา 5. ทดสอบทักษะการวิเคราะห์\n9. การศึกษาด้วยตนเอง ข้อมูลเชิงตัวเลขโดยการทำ\nรายงาน หรือการทำข้อสอบ\n6. ประเมินจากผลการสอบ\nด้านจริยธรรม (Ethic)\nE 1 มีความเข้าใจและความตระหนักต่อการพัฒนาที่ยั่งยืน\nมคอ. 2 หลักสูตรศิลปศาสตรบัณฑิต สาขาวิชานวัตกรรมการบริการ (หลักสูตรนานาชาติ) หน้า 46 ลำดับ ผลลัพธ์การเรียนรู้ของหลักสูตร (PLOs) การจัดกระบวนการเรียนรู้วิธีการวัดและประเมินผล\nE 2 มีความรู้ความเข้าใจถึงความสำคัญของความรับผิดชอบต่อ 1. การบรรยายและการอภิปรายกลุ่ม 1. ประเมินจากความรับผิดชอบ\nตนเองและสังคม โดยจะทอดแทรกแนวคิดที่เกี่ยวกับ ในงานที่ได้รับมอบหมายทั้ง\nการพัฒนาที่ยั่งยืน งานกลุ่มและงานเดี่ยว\n2. การศึกษาดูงานเพื่อเรียนรู้จาก 2. ประเมินจากผลงานที่ได้รับ\nหน่วยงานหรือผู้ที่มีประสบการณ์ มอบหมาย\n3. การมอบหมายงานกลุ่มหรืองานเดี่ยว 3. สังเกตจากแนวความคิดของ\nนักศึกษาที่สะท้อนให้เห็นจาก\nงานที่ได้รับมอบหมายและ\nการอภิปรายในชั้นเรียน\n4. ประเมินจากผลการสอบ\nด้านลักษณะบุคคล (Character)\nC1 สร้างคุณค่าความผู้นำที่มีประสิทธิผลและมีทักษะในการ 1. การศึกษาดูงานเพื่อเรียนรู้จากผู้ที่มี 1. ประเมินจากความรับผิดชอบ\nทำงานทีม ประสบการณ์ ในงานที่ได้รับมอบหมายทั้ง\nC2 เข้าใจและตระหนักในเรื่องความแตกต่างของวัฒนธรรมทสี่ำคญั 2. การเรียนรู้จากการเล่มเกมส์ หรือ งานกลุ่มและงานเดี่ยว\nต่อการทำงานทีม การแสดงบทบาทสมมติรายบุคคล\nC3 มีทักษะและความรู้ในการจัดการกระบวนการทำงานกับผทูี่มี 3. การมอบหมายงานกลุ่มเพื่อฝึกการ 2. สังเกตจากการทำงานร่วมกัน\nส่วนเกี่ยวข้อง\nทำงานทีม ทีม และการแสดงความ\n4. การมอบหมายให้อ่านเอกสาร คิดเห็น การอภิปรายในชั้น\nประกอบการเรียนการสอน เรียน\nมคอ. 2 หลักสูตรศิลปศาสตรบัณฑิต สาขาวิชานวัตกรรมการบริการ (หลักสูตรนานาชาติ) หน้า 47 ลำดับ ผลลัพธ์การเรียนรู้ของหลักสูตร (PLOs) การจัดกระบวนการเรียนรู้วิธีการวัดและประเมินผล\n(Journal/ Article) ล่วงหน้าเพื่อ 3. ประเมินสภาพจริงจาก\nอภิปรายร่วมกันในชั้นเรียน ผลงาน รายงานที่ได้รับ\n5. การเปิดโอกาสให้แสดงความคิดเห็น มอบหมาย\n6. สอนและฝึกปฏิบัติเกี่ยวกับการ 4. นักศึกษาประเมินตัวเองและ\nเคารพสิทธิของผู้อื่นความแตกต่าง เพื่อนในกลุ่ม\nของบุคคลเคารพหลักความเสมอ 5. ประเมินจากการมีส่วนร่วม\nภาคการเคารพกติกา การยอมรับการแสดงออกใน\nเรื่องความแตกต่างทาง\nวัฒนธรรม\nมคอ. 2 หลักสูตรศิลปศาสตรบัณฑิต สาขาวิชานวัตกรรมการบริการ (หลักสูตรนานาชาติ) หน้า 48",
    "หมวดที่ 6": "หมวดที่ 6 ความพร้อมและศักยภาพในการบริหารจัดการหลักสตู ร\nหลักสูตรมีความพร้อมในด้านต่าง ๆ ตามกฎกระทรวงมาตรฐานการจัดการศึกษาระดับอุดมศึกษา\nพ.ศ.2565 ข้อ 6 ที่ประกอบด้วย 4 ด้าน ได้แก่\n6.1 ด้านกายภาพ\nวิทยาลัยนวัตกรรมมีความพร้อมด้านกายภาพ โดยประกอบด้วยห้องเรียน ห้องอเนกประสงค์ ห้อง\nCommon Room สำหรับนักศึกษา ตามรายละเอียดดังนี้\nรายละเอียด จำนวน\n1. ห้องเรียน ขนาด 60 ที่นั่ง 4 ห้อง\n2. ห้องเรียน ขนาด 100 ที่นั่ง 3 ห้อง\n3. ห้องเรียน ขนาด 170 ที่นั่ง 1 ห้อง\n4. ห้องอเนกประสงค์ Innovative 1 ห้อง\n5. ห้อง Common Room 4 ห้อง\n6. ห้องพักอาจารย์ 9 ห้อง\n7. กล้องวงจรปิด CCTV 38 ตำแหน่ง\n8. แม่บ้านดูแลความสะอาด 3 คน\n9. เจ้าหน้าที่รักษาความปลอดภัย 2 คน\nสำหรับสิ่งอำนวยความสะดวกเพื่อการเรียนรู้นักศึกษาสามารถใช้บริการจากสำนักหอสมุด และ\nห้องสมุดคณะต่าง ๆ ทั้งที่ศูนย์ท่าพระจันทร์และศูนย์รังสิต ซึ่งมีตำรา หนังสือทั้งภาษาไทยและภาษาอังกฤษ\nวารสารภาษาไทยและภาษาอังกฤษ รวมถึงสื่ออิเล็กทรอนิกส์ต่าง ๆ อย่างพอเพียง ดังนี้\nหนังสือภาษาไทย จำนวน 20,994 เล่ม\nหนังสือภาษาอังกฤษ จำนวน 8,323 เล่ม\nวารสาร จำนวน 82 ชื่อ\n- ภาษาไทย จำนวน 40 ชื่อ\n- ภาษาอังกฤษ จำนวน 42 ชื่อ\nโสตทัศนวัสดุประเภทต่าง ๆ จำนวน 700 ชิ้น\nหนังสือพิมพ์ จำนวน 16 ชื่อ\n- ภาษาไทย จำนวน 14 ชื่อ\n- ภาษาอังกฤษ จำนวน 2 ชื่อ\nฐานข้อมูลออนไลน์ จำนวน 19 ฐาน\nวิทยานิพนธ์อิเล็กทรอนิกส์ของ มธ. จำนวน 13,476 เล่ม\nหนังสือหายากอิเล็กทรอนิกส์ จำนวน 361 เล่ม\nมคอ. 2 หลักสูตรศิลปศาสตรบัณฑิต สาขาวิชานวัตกรรมการบริการ (หลักสูตรนานาชาติ) หน้า 49 นักศึกษาสามารถขอใช้บริการได้ที่หอสมุดแห่งชาติสำนักหอสมุดของมหาวิทยาลัยทุกแห่งใน\nส่วนกลาง ห้องสมุดหรือศูนย์เอกสารของหน่วยงานราชการและเอกชน\n6.2 ด้านวิชาการ\n(จำนวนผลงานวิชาการ สิ่งประดิษฐ์ ผลงานอื่น ๆ ของอาจารย์ประจำหลักสูตร ในรอบ 5 ปีย้อนหลัง)\nสัดส่วนอาจารย์ :\nจำนวนผลงานทางวิชาการ\nผลงาน\nจำนวนอาจารย์\nงานวิจัยหรือ ผลงานทางวิชาการอื่น ๆ รวมผลงาน\nประจำหลักสูตร\nบทความวิจัย (ชิ้น) เช่น ตำรา หนังสือ/ ทาง วิชาการ\n(คน) วิจัย อื่น ๆ\nบทความวิชาการอื่น ๆ ทงั้หมด (ชิ้น)\nสิ่งประดิษฐ์ ต้น (ชิ้น)\n24 1 25 5 1 : 4.8 1 : 0.2\nรวม 1 : 5\n6.3 ด้านการเงินและการบัญชี\n6.3.1 งบอุดหนุนจากคณะ/มหาวิทยาลัย\nวิทยาลัยนวัตกรรมหน่วยงานเงินรายได้การจัดสรรงบประมาณสำหรับหลักสูตรในการบริหาร\nจัดการมาจากเงินรายได้ 100%\n6.3.2 ทุนสนับสนุนการศึกษาอาจารย์และนักศึกษา\nวิทยาลัยนวัตกรรมมีการสนับสนุนทุนประเภทต่าง ๆ สำหรับอาจารย์และนักศึกษา จากกองทุน\n3 ประเภท ดังนี้\n1) กองทุนค่าธรรมเนียมเพื่อการพัฒนาการศึกษา\n2) กองทุนการศึกษาวิทยาลัยนวัตกรรม\n3) กองทุนวิจัยวิทยาลัยนวัตกรรม\n6.3.3 ประมาณการรายได้และค่าใช้จ่ายนักศึกษาของหลักสูตร\nการประมาณการรายได้ของวิทยาลัยกำหนดตามจำนวนเป้ารับนักศึกษาที่กำหนดใน มคอ.2 โดย\nค่าใช้จ่ายแบ่ง ค่าใช้จ่ายคงที่ และค่าใช้จ่ายผันแปร ตามรายละเอียดดังนี้\nปี 2567 ปี 2568 ปี 2569 ปี 2570 ปี 2571\nงบประมาณรายรับ\nต.ค. 66 - ก.ย. 67 ต.ค. 67 - ก.ย. 68 ต.ค. 68 - ก.ย. 69 ต.ค. 69 - ก.ย. 70 ต.ค. 70 - ก.ย. 71\n1 ค่าสมัครสอบ 80,000 80,000 80,000 80,000 80,000\n2 ค่าหน่วยกิต 4,950,000 9,405,000 13,860,000 18,315,000 18,315,000\n3 ค่าธรรมเนียมพิเศษ 2,400,000 4,560,000 6,720,000 8,880,000 8,880,000\n4 ค่าธรรมเนียมการศึกษา 353,100 649,290 945,480 1,241,670 1,241,670\nรวมรายรับทั้งสิ้น 7,783,100 14,694,290 21,605,480 28,516,670 28,516,670\nมคอ. 2 หลักสูตรศิลปศาสตรบัณฑิต สาขาวิชานวัตกรรมการบริการ (หลักสูตรนานาชาติ) หน้า 50 งบประมาณรายจ่าย ปี 2567 ปี 2568 ปี 2569 ปี 2570 ปี 2571\nค่าใช้จ่ายคงที่ต.ค. 66 - ก.ย. 67 ต.ค. 67 - ก.ย. 68 ต.ค. 68 - ก.ย. 69 ต.ค. 69 - ก.ย. 70 ต.ค. 70 - ก.ย. 71\n1. ค่าตอบแทนบุคลากร 1,962,900 3,224,800 4,487,150 5,636,073 5,646,491\n2. ค่าใช้สอย 1,400,000 1,400,000 2,150,000 2,250,000 2,250,000\n3. ค่าวัสดุ 200,000 200,000 200,000 200,000 200,000\n4. ค่าใช้จ่ายเบ็ดเตลด็ 60,000 60,000 60,000 60,000 60,000\nรวมค่าใช้จ่ายคงที่ทั้งสิ้น 3,622,900 4,884,800 6,897,150 8,146,073 8,156,491\nงบประมาณรายจ่าย ปี 2567 ปี 2558 ปี 2569 ปี 2570 ปี 2571\nค่าใช้จ่ายผันแปร ต.ค. 66 - ก.ย. 67 ต.ค. 67 - ก.ย. 68 ต.ค. 68 - ก.ย. 69 ต.ค. 69 - ก.ย. 70 ต.ค. 70 - ก.ย. 71\n1. ค่าบำรุงมหาวิทยาลัย\n- ค่าหน่วยกิต (นำส่ง 15%) 742,500 1,410,750 2,079,000 2,747,250 2,747,250\n- ค่าธรรมเนยีมพิเศษ (นำส่ง\n360,000 684,000 1,008,000 1,332,000 1,332,000\n15%)\n2. ค่าธรรมเนียมการศึกษา\n353,100 649,290 945,480 1,241,670 1,241,670\nนำส่ง 100%\n3. ค่าใช้จ่ายในการ\n210,000 210,000 210,000 210,000 210,000\nปฐมนิเทศ\n4. ค่าจัดทำเอกสาร\n66,000 132,000 198,000 258,000 258,000\nประกอบการสอน\n5. ค่าใช้จ่ายในการปัจฉิม\n- - - - 120,000\nนิเทศ\nรวมค่าใช้จ่ายผันแปรทั้งสิ้น 1,731,600 3,086,040 4,440,480 5,788,920 5,908,920\nค่าใช้จ่ายต่อหัวนักศึกษาตลอดระยะเวลาหลักสูตร คือ 444,680 บาทต่อคน โดยมีการบริหาร\nจัดการโครงการบริการการศึกษา (เพื่อรับปริญญา) (โครงการพิเศษ) นักศึกษามีค่าใช้จ่ายหลักได้แก่\nค่าหน่วยกิต ๆ ละ 2,500 บาท และค่าธรรมเนียมอื่น ๆ ของวิทยาลัยนวัตกรรม รายละเอียดดังนี้\nค่าธรรมเนียมพิเศษ ภาคการศึกษาปกติภาคฤดูร้อน (ถ้ามี)\nสำหรับนักศึกษาไทย (ยกเว้นภาคฤดูร้อน) 10,000 บาท -\nสำหรับนักศึกษาต่างชาติ (ยกเว้นภาคฤดูร้อน) 10,000 บาท -\nทั้งนี้ค่าใช้จ่ายต่อหัวนักศึกษาตลอดระยะเวลาหลักสูตรนี้ยังไม่รวมค่าใช้จ่ายในการศึกษาดูงาน\nต่างประเทศ\nมคอ. 2 หลักสูตรศิลปศาสตรบัณฑิต สาขาวิชานวัตกรรมการบริการ (หลักสูตรนานาชาติ) หน้า 51 6.4 ด้านการบริหารจัดการ\nปัจจุบันวิทยาลัยนวัตกรรมมีบุคลากรสายวิชาการ สายสนับสนุนวิชาการ จำนวน 59 คน ตาม\nรายละเอียดดังนี้\n6.4.1 จำนวนอาจารย์ (ประจำ/พิเศษ)\nพนักงานมหาวิทยาลัย (ส่วนงาน) พนักงานเงินรายได้\n22 คน 8 คน\n6.4.2 จำนวนเจ้าหน้าที่\nพนักงานมหาวิทยาลัย (ส่วนงาน) พนักงานเงินรายได้\n27 คน 2 คน\n6.4.3 กำกับดูแลและประเมินผล\nหลักสูตรมีการกำกับดูแลและประเมินผลของการดำเนินงานโดยคณะกรรมการบริหารหลักสูตร\nประกอบด้วย ผู้อำนวยการหลักสูตร และอาจารย์ประจำหลักสูตร โดยจะมีการประชุมร่วมกันเพื่อหารือ\nประเด็นต่าง ๆ และประเมินผลการดำเนินงานที่ผ่านมา อย่างน้อยภาคการศึกษาละ 2 ครั้ง นอกจากนั้น\nวิทยาลัยนวัตกรรมมีคณะกรรมการบริหารวิชาการ และทำนุบำรุงศิลปะวัฒนธรรม ซึ่งกรรมการ\nประกอบด้วย คณบดีรองคณบดีผู้อำนวยการหลักสูตรทุกหลักสูตร ประชุมหารือในเรื่องต่าง ๆ ประจำ\nทุก ๆ 2 เดือน ซึ่งการติดตามประเมินผลการดำเนินงานของแต่ละหลักสูตร และเปิดโอกาสให้มีเวทีใน\nการหารือนโยบาย แนวปฏิบัติ และประเด็นร่วมต่าง ๆ ระหว่างหลักสูตร\nมคอ. 2 หลักสูตรศิลปศาสตรบัณฑิต สาขาวิชานวัตกรรมการบริการ (หลักสูตรนานาชาติ) หน้า 52 6.5 อาจารย์ผู้รับผิดชอบหลักสูตรและอาจารยป์ ระจำหลักสูตร\nตำแหน่งทาง สำเร็จการศึกษาจาก\nลำดับที่ชื่อ - สกุล คุณวุฒิสาขาวิชา\nวิชาการ สถาบัน ปีพ.ศ.\n1. ผู้ช่วย กาญจน์นภา พงศ์พนรัตน์ เชี่ยวชาญ Ph.D. Regional and Rural Asian Institute of 2550\nศาสตราจารย์ Development Planning Technology, Thailand\nM.A. Development Western Michigan University, 2544\nAdministration USA\nร.บ. การระหว่างประเทศ มหาวิทยาลยัธรรมศาสตร์ 2540\n2. รองศาสตราจารย์ คม คัมภิรานนท์ Ph.D Tourism Management University of Queensland, 2550\nAustralia\nM.S. Hospitality & Tourism University of Wisconsin- 2545\nStout, USA\nศศ.บ. สังคมวิทยาและมานุษยวิทยา มหาวิทยาลยั เกษตรศาสตร์ 2542\n3. อาจารย์ ดร. ปุริมปรัชญ์ แสงแก้ว Ph.D Hospitality and Tourism University of Surrey, UK 2562\nManagement\nMS.c. International Event University of Surrey, UK 2557\nManagement\nB.B.A. Hospitality and Tourism Mahidol University 2550\nManagement International College\nมคอ. 2 หลักสูตรศิลปศาสตรบัณฑิต สาขาวิชานวัตกรรมการบริการ (หลักสูตรนานาชาติ) หน้า 53 ตำแหน่งทาง สำเร็จการศึกษาจาก\nลำดับที่ชื่อ - สกุล คุณวุฒิสาขาวิชา\nวิชาการ สถาบัน ปีพ.ศ.\n4. ผู้ช่วย เวฬุรีย์ เมธาวีวินิจ Ph.D. Film Studies University of London, UK 2558\nศาสตราจารย์ ศศ.ม. การบริหารงานวฒันธรรม มหาวิทยาลยัธรรมศาสตร์ 2545\nB.S. Accounting Thammasat University 2542\n5. อาจารย์ ปรีชญา ชวลิตธำรง M.P.S Real Estate Cornell University, USA 2552\nสถ.บ. สถาปัตยกรรม จุฬาลงกรณ์มหาวทิยาลัย 2549\n(ระบุอาจารย์ผู้รับผิดชอบหลักสูตรและอาจารย์ประจำหลักสูตรอย่างน้อย 5 คน กรณีจบการศึกษาต่างประเทศให้ใช้ภาษาอังกฤษ และระบุประเทศในช่องสถาบันด้วย อาจารย์ประจำหลักสูตรต้องมีคุณวุฒิตรงหรือสัมพันธ์กับสาขาวิชาที่เปิดสอนโดยให้มีคุณวุฒิและจำนวนสอดคล้องกับเกณฑ์มาตรฐานหลักสูตร)\nมคอ. 2 หลักสูตรศิลปศาสตรบัณฑิต สาขาวิชานวัตกรรมการบริการ (หลักสูตรนานาชาติ) หน้า 54",
    "หมวดที่ 7": "หมวดที่ 7 การประเมินผลการเรียนและเกณฑ์การสำเร็จการศึกษา\n7.1 การประเมินผลการเรียนของนักศึกษา\nการประเมินผลการเรียน ให้ไปตามข้อบังคับมหาวิทยาลัยธรรมศาสตร์ ว่าด้วยการศึกษาระดับ\nปริญญาตรีพ.ศ. 2561 หมวดที่ 8 และหมวดที่ 9\n7.1.1 การวัดผลการศึกษา แบ่ง 8 ระดับ มีชื่อและค่าระดับต่อหนึ่งหน่วยกิตดังต่อไปนี้\nระดับ A B+ B C+ C D+ D F\nค่าระดับ 4.00 3.50 3.00 2.50 2.00 1.50 1.00 0.00\n7.1.2 การวัดผลการศึกษาวิชา นบ.484 การฝึกงานสำหรับอุตสาหกรรมการบริการ แบ่งออก\n2 ระดับ คือ S (ใช้ได้) และระดับ U (ใช้ไม่ได้)\n7.2 เกณฑ์การสำเร็จการศึกษาตามหลักสูตร\n7.2.1 สอบผ่านและได้รับหน่วยกิตสะสมรายวิชาครบตามโครงสร้างหลักสูตร และมีหน่วยกิตสะสมไม่\nน้อยกว่า 129 หน่วยกิต\n7.2.2 ได้ค่าระดับเฉลี่ยสะสมไม่ต่ำกว่า 2.00 (จากระบบ 4 ระดับคะแนน)\n7.2.3 ได้ค่าระดับ S (ใช้ได้) ในรายวิชา นบ.484 การฝึกงานสำหรับอุตสาหกรรมการบริการ\n7.2.4 ตอ้งปฏิบัติตามเงื่อนไขอื่น ๆ ที่วิทยาลัยและมหาวิทยาลัยธรรมศาสตร์กำหนด\nมคอ. 2 หลักสูตรศิลปศาสตรบัณฑิต สาขาวิชานวัตกรรมการบริการ (หลักสูตรนานาชาติ) หน้า 55",
    "หมวดที่ 8": "หมวดที่ 8 การประกันคุณภาพหลักสูตร\nหลักสูตรใช้ระบบประกันคุณภาพการศึกษาตามที่สภามหาวิทยาลัยกำหนด\nหมวดที่ 9 ระบบและกลไกในการพัฒนาหลักสูตร\n9.1 ผลการรับฟังความคิดเห็นจากผู้ใช้บัณฑิต ผู้เรียน และนักเรียนที่ต้องการเข้าศึกษาในหลักสูตร\nหลักสูตรให้ความสำคัญกับการรับฟังความคิดเห็นจากผู้เรียนและลูกค้ากลุ่มอื่น ๆ โดยผลที่ได้จาก\nการรับฟังเสียงจากภาคส่วนต่าง ๆ ทำให้ได้ข้อมูลที่นำไปสู่การพัฒนาหลักสูตร การปรับปรุงกระบวนการ\nเรียนการสอน การพัฒนาบริการด้านการศึกษา การกำหนดนโยบายการสนับสนุนการวิจัย และการ\nจัดบริการวิชาการแก่สังคมและชุมชน โดยในแต่ละปีจะดำเนินการสำรวจความคิดเห็นจากผู้ที่เกี่ยวข้องต่าง ๆ\nดังนี้\nแหล่งข้อมูล ประเภทข้อมูล วิธีการได้มาซึ่งข้อมูล การใช้ประโยชน์\nนักศึกษา ความพึงพอใจ ไม่พึงพอใจและ - แบบประเมินรายวิชา ใช้เพื่อการปรับปรุงหลักสูตร\nข้อคิดเห็นต่อหลักสูตร การจัดการ - แบบประเมินการสอน และจัดการเรียนการสอน\nเรียนการสอน สภาพแวดล้อม - นักศึกษาพบผู้บริหาร\nทางการศึกษา อาจารย์ผู้สอน - ช่องทางการสื่อสารอื่นๆ\nรูปแบบการสอนของผู้สอน สิ่ง เช่น เพจ facebook\nสนับสนุนการเรียนรู้ระบบการ คณะกรรมการนักศึกษา\nพัฒนานักศึกษา ต้น\nผู้ใช้บัณฑิต ความพึงพอใจต่อคุณภาพบัณฑิต - แบบประเมินผลการใช้หลักสูตรใช้ข้อมูลเพื่อการ\nงานบัณฑิต ปรับปรุงหลักสูตร และการ\nจัดกระบวนการเรียนการ\nสอน\nศิษย์เก่า ข้อเสนอแนะการจัดการเรียนการ - แบบสำรวจข้อมูลสำหรับ หลักสูตรใช้ข้อมูลเพื่อการ\nสอนแหล่งฝึกประสบการณ์ ศิษย์เก่า ปรับปรุงหลักสูตร และการ\nทุนการศึกษาและความต้องการ จัดกระบวนการเรียนการ\nพัฒนาตนเอง สอนแหล่งฝึกงาน\nทุนการศึกษา และการ\nพัฒนาศิษย์เก่าตลอดชีพ\nผู้ปกครอง ข้อเสนอแนะการจัดการเรียนการ - แบบประเมิน/สำรวจ เพื่อการปรับปรุงหลักสูตร\nสอน ความพึงพอใจผู้ปกครอง และการจัดกระบวนการ\nเรียนการสอน\nมคอ. 2 หลักสูตรศิลปศาสตรบัณฑิต สาขาวิชานวัตกรรมการบริการ (หลักสูตรนานาชาติ) หน้า 56",
    "หมวดที่ 9": "หมวดที่ 8 การประกันคุณภาพหลักสูตร\nหลักสูตรใช้ระบบประกันคุณภาพการศึกษาตามที่สภามหาวิทยาลัยกำหนด\nหมวดที่ 9 ระบบและกลไกในการพัฒนาหลักสูตร\n9.1 ผลการรับฟังความคิดเห็นจากผู้ใช้บัณฑิต ผู้เรียน และนักเรียนที่ต้องการเข้าศึกษาในหลักสูตร\nหลักสูตรให้ความสำคัญกับการรับฟังความคิดเห็นจากผู้เรียนและลูกค้ากลุ่มอื่น ๆ โดยผลที่ได้จาก\nการรับฟังเสียงจากภาคส่วนต่าง ๆ ทำให้ได้ข้อมูลที่นำไปสู่การพัฒนาหลักสูตร การปรับปรุงกระบวนการ\nเรียนการสอน การพัฒนาบริการด้านการศึกษา การกำหนดนโยบายการสนับสนุนการวิจัย และการ\nจัดบริการวิชาการแก่สังคมและชุมชน โดยในแต่ละปีจะดำเนินการสำรวจความคิดเห็นจากผู้ที่เกี่ยวข้องต่าง ๆ\nดังนี้\nแหล่งข้อมูล ประเภทข้อมูล วิธีการได้มาซึ่งข้อมูล การใช้ประโยชน์\nนักศึกษา ความพึงพอใจ ไม่พึงพอใจและ - แบบประเมินรายวิชา ใช้เพื่อการปรับปรุงหลักสูตร\nข้อคิดเห็นต่อหลักสูตร การจัดการ - แบบประเมินการสอน และจัดการเรียนการสอน\nเรียนการสอน สภาพแวดล้อม - นักศึกษาพบผู้บริหาร\nทางการศึกษา อาจารย์ผู้สอน - ช่องทางการสื่อสารอื่นๆ\nรูปแบบการสอนของผู้สอน สิ่ง เช่น เพจ facebook\nสนับสนุนการเรียนรู้ระบบการ คณะกรรมการนักศึกษา\nพัฒนานักศึกษา ต้น\nผู้ใช้บัณฑิต ความพึงพอใจต่อคุณภาพบัณฑิต - แบบประเมินผลการใช้หลักสูตรใช้ข้อมูลเพื่อการ\nงานบัณฑิต ปรับปรุงหลักสูตร และการ\nจัดกระบวนการเรียนการ\nสอน\nศิษย์เก่า ข้อเสนอแนะการจัดการเรียนการ - แบบสำรวจข้อมูลสำหรับ หลักสูตรใช้ข้อมูลเพื่อการ\nสอนแหล่งฝึกประสบการณ์ ศิษย์เก่า ปรับปรุงหลักสูตร และการ\nทุนการศึกษาและความต้องการ จัดกระบวนการเรียนการ\nพัฒนาตนเอง สอนแหล่งฝึกงาน\nทุนการศึกษา และการ\nพัฒนาศิษย์เก่าตลอดชีพ\nผู้ปกครอง ข้อเสนอแนะการจัดการเรียนการ - แบบประเมิน/สำรวจ เพื่อการปรับปรุงหลักสูตร\nสอน ความพึงพอใจผู้ปกครอง และการจัดกระบวนการ\nเรียนการสอน\nมคอ. 2 หลักสูตรศิลปศาสตรบัณฑิต สาขาวิชานวัตกรรมการบริการ (หลักสูตรนานาชาติ) หน้า 56 แหล่งข้อมูล ประเภทข้อมูล วิธีการได้มาซึ่งข้อมูล การใช้ประโยชน์\nการวิจัย ความต้องการของแหล่งทุนภายนอก - แบบสำรวจ เพื่อวางแผนและมอบหมาย\nโดยสอดคล้องต่อองค์ความรู้ใน - การประชุมร่วม งานที่สอดคล้องกับความ\nลักษณะพหุวิทยาการของแต่ละ เชี่ยวชาญของหลักสูตร\nหลักสูตร\nการบริการ ความต้องการของผู้ขอรับบริการ - แบบสำรวจ เพื่อวางแผนและมอบหมาย\nวิชาการ โดยสอดคล้องกับองค์ความรู้ใน - การประชุมร่วม งานที่สอดคล้องกับความ\nลักษณะพหุวิทยาการของแต่ละ เชี่ยวชาญของหลักสูตร\nหลักสูตร\nผลการสำรวจความคิดเห็นของภาคส่วนต่าง ๆ มีข้อสังเกต ข้อเสนอแนะ ดังนี้\n- หลักสูตรมีความหลากหลายและสอดคล้องกับทักษะที่จะสำหรับอุตสาหกรรมการบริการ ทั้ง\nการจัดการด้านธุรกิจ และนวัตกรรม โดยไม่ได้มุ่งเน้นไปที่ด้านการโรงแรมและการท่องเที่ยวเพียง\nอย่างเดียว แต่หลักสูตรควรเพิ่มกิจกรรมที่ช่วยให้นักศึกษาได้ค้นพบว่าตัวเองนั้นมีความถนัด และ\nความชื่นชอบในด้านใดในอุตสาหกรรมการบริการ\n- หลักสูตรอาจจะพิจารณาเพิ่มเติมด้านอุตสาหกรรมสร้างสรรค์ (Creative Industry) ในหลักสูตร\nเพื่อให้มีความครอบคลุมกับความต้องการในปัจจุบัน\n- แนะนำให้หลักสูตรปรับรูปแบบการเรียนการสอนแบบบูรณาการ เช่น Heutagogy\n(ประสบการณ์การเรียนรู้ด้วยตนเอง) Paragogy (การเรียนรู้ร่วมกันแบบเพื่อนกับเพื่อน) และ\nCybergogy (การเรียนรู้ออนไลน์หรือเสมือนจริง)\n- หลักสูตรควรเพิ่มการพัฒนาองค์ความรู้ทางการเงินให้นักศึกษามีความเข้าใจการจัดการทาง\nการเงินเพื่อธุรกิจการบริการ\n- หลักสูตรควรส่งเสริมทักษะทางดิจิทัลเพื่อการบริการ โดยผสมผสานกับทักษะการคิดเชิง\nสร้างสรรค์\n9.2 การวิเคราะห์ความเสี่ยง และผลกระทบภายนอก\nหลักสูตรนวัตกรรมการบริการ เผชิญกับปัจจัยภายนอกที่ก่อให้เกิดผลกระทบต่อการบริหาร\nหลักสูตร ประกอบไปด้วย อัตราการเกิดในประเทศไทยไทยต่ำลง การก้าวเข้าสู่สังคมผู้สูงอายุ ความนิยมใน\nการเรียนเพื่อรับปริญญาลดลง ความนิยมในการเรียนหลักสูตรระยะสั้นและหลักสูตรแบบไม่รับปริญญา\nเพิ่มขึ้น ความนิยมในการเรียนผ่านช่องทางออนไลน์เพิ่มขึ้นโดยเฉพาะหลักสูตรจากมหาวิทยาลัยใน\nต่างประเทศ แม้ว่าหลักสูตรนวัตกรรมการบริการ ยังคงสามารถรับนักศึกษาไปตามเป้าหมายส่งผลให้ยัง\nสามารถจัดการหลักสูตรได้คุ้มกับต้นทุน อย่างไรก็ตาม หลักสูตรนวัตกรรมการบริการกลับเผชิญกับสภาวะ\nที่มีจำนวนผู้สมัครจำนวนลดลงส่งผลให้หลักสูตรนวัตกรรมการบริการ ขาดโอกาสในการคัดเลือกผู้เรียนที่\nมคอ. 2 หลักสูตรศิลปศาสตรบัณฑิต สาขาวิชานวัตกรรมการบริการ (หลักสูตรนานาชาติ) หน้า 57 เหมาะสมกับปรัชญาของหลักสูตร หลักสูตร ฯ จึงต้องทำการแสวงหาตลาดใหม่ประกอบไปด้วย การ\nคัดเลือกนักศึกษาต่างชาติเพื่อควบคุมความเสี่ยงเกี่ยวกับอัตราการเกิดที่ลดลงและการก้าวเข้าสู่สังคม\nผู้สูงอายุโดยทำการขยายส่วนตลาด (Market Segmentation) ไปยังผู้เรียนในนานาชาติการจัดการเรียน\nการสอนในลักษณะ Accredited ทั้งในรูปแบบ Offline และรูปแบบ Online เพื่อควบคุมความเสี่ยงใน\nเรื่องของความนิยมในการเรียนหลักสูตรระยะสั้นและหลักสูตรแบบไม่รับปริญญา\n9.3 ผลการดำเนินงานของหลักสูตร / ผลการประกันคุณภาพการศึกษา\nหลักสูตรศิลปศาสตรบัณฑิต สาขาวิชานวัตกรรมการบริการ (หลักสูตรนานาชาติ) มีวัตถุประสงค์\nเพื่อผลิตบัณฑิตให้มีคุณภาพภายใต้การควบคุมกำกับมาตรฐานตามประกาศคณะกรรมการมาตรฐานการ\nอุดมศึกษา เรื่อง เกณฑ์มาตรฐานหลักสูตรระดับปริญญาตรีพ.ศ. 2565 โดยในแต่ละปีวิทยาลัยมีการ\nแต่งตั้งคณะกรรมการประเมินคุณภาพการศึกษาภายในระดับหลักสูตร เพื่อตรวจสอบผลการดำเนินงาน\nของหลักสูตรในแต่ละปีตามเกณฑ์ AUN-QA โดยผลการดำเนินงานของหลักสูตรในปีการศึกษา 2564 มี\nดังนี้\nNo. Criteria Score\n1 ELO 2\n2 PS 2\n3 T&L 3\n4 SA 3\n5 AS 3\n6 SS 3\n7 FI 3\n8 O 2\n9.4 แผนปรับปรุงและพัฒนาหลักสูตร\nการพัฒนาหลักสูตร วิธีการดำเนินการ\nจุดเด่น\n1. การพัฒนาองค์ความรู้ เนื้อหาการเรียนการสอนที่ 1. การพัฒนางานวิจัยของคณาจารย์ที่เกี่ยวข้องกับ\nทันสมัยต่อสถานการณ์การเปลี่ยนแปลงของ อุตสาหกรรมบริการ เพื่อใช้ฐานในการเรียน\nอุตสาหกรรมบริการ การสอน\n2. การสนับสนุนทุนการศึกษาสำหรับนักศึกษาไทยและ\nต่างชาติ\nมคอ. 2 หลักสูตรศิลปศาสตรบัณฑิต สาขาวิชานวัตกรรมการบริการ (หลักสูตรนานาชาติ) หน้า 58 การพัฒนาหลักสูตร วิธีการดำเนินการ\n3. การพัฒนาศักยภาพของคณาจารย์ในหลักสูตรเพื่อ 2. การประสานความร่วมมือกับภาคเอกชนธุรกิจและ\nเพิ่มพูนความรู้และประสบการณ์ การบริการประเภทต่าง ๆ ในด้านการเรียนการ\nสอนและการทำงานวิจัย\n3. การจัดสัมมนาวิชาการ การฝึกอบรม หรือการ\nประชุมเชิงปฏิบัติการในเรื่องที่เกี่ยวข้องกับ\nนวัตกรรมการบริการ\n4. การประเมินเนื้อหาหลักสูตรและวิธีการสอน\nประจำทุกปี\n5. การพัฒนาโครงการแลกเปลี่ยนนักศึกษาและ\nคณาจารย์กับสถาบันการศึกษาต่างประเทศ\n6. การแสวงหาความร่วมมือกับหน่วยงานภายนอกใน\nการสนับสนุนทุนการศึกษา\n7. การสนับสนุนคณาจารย์ในหลักสูตรเพื่อเข้ารับการ\nอบรมหรือเข้าร่วมงานสัมมนา Conference ต่าง ๆ\n8. การเขียนบทความ เอกสารทางวิชาการในหัวข้อที่\nเกี่ยวข้องกับนวัตกรรมการบริการ\nจุดด้อย\n1. การทำการตลาดและการประชาสัมพันธ์เชิงรุก 1. การศึกษากลุ่มเป้าหมายของหลักสูตร การเจาะ\n2. การส่งเสริมการแลกเปลี่ยนนักศึกษา ขาเข้า - ขา ตลาดกลุ่มเป้าหมายโดยใช้เทคนิคการตลาดเชิงรุก\nออก และการแข่งขันในระดับชาติและนานาชาติเพื่อ การจัดการประชาสัมพันธ์ที่มีประสิทธิภาพ\nเพิ่มพูนความรู้และประสบการณ์ของนักศึกษา สอดคล้องกับกลุ่มเป้าหมาย การจัดสัมมนาวิชาการ\nการฝึกอบรม\n2. การสนับสนุนให้ให้นักศึกษาเข้าร่วมโครงการ\nแลกเปลี่ยนนักศึกษา ขาเข้า - ขาออก และการ\nแข่งขันในระดับชาติและนานาชาติ\nมคอ. 2 หลักสูตรศิลปศาสตรบัณฑิต สาขาวิชานวัตกรรมการบริการ (หลักสูตรนานาชาติ) หน้า 59 ภาคผนวก\nภาคผนวก 1 ผลงานทางวิชาการ (ย้อนหลัง 5 ปี) ของอาจารย์ผู้รับผิดชอบหลักสูตรและอาจารย์\nประจำหลักสูตร (ถ้ามี)\n1. ผู้ช่วยศาสตราจารย์ ดร.กาญจน์นภา พงศ์พนรัตน์ เชี่ยวชาญ\nบทความวิจัยหรือบทความวิชาการฉบับสมบูรณ์ที่ตีพิมพ์ในวารสารวิชาการระดับนานาชาติที่\nปรำกฎในฐานข้อมูลระดับนานาชาติตามประกาศ ก.พ.อ. หรือระเบียบคณะกรรมการการอุดมศึกษา\nว่าด้วยหลักเกณฑ์การพิจารณาวารสารทางวิชาการสำหรับการเผยแพร่ผลงานทางวิชาการ พ.ศ.2556\n: 1.00 (SCOPUS)\nPongponrat K. (2022).Stakeholder Engagement Process in Water Saving Initiatives for\nSustainable Tourist Destination in Samui Island, Thailand. Pertanika Journal of\nSocial Sciences and Humanities Volume 30, Issue 3, September 2022 Pages 1341 -\n1363\nPongponrat K. (2021). “University volunteer programs for post-disaster recovery: The case\nof post-tsunami Japan”, Kasetsart Journal of Social Sciences Volume 42, Issue 1,\nJanuary-March 2021, pp.31-36\nPongponrat K. (2018). “Social vulnerability of marginalized people in times of disaster:\nCase of Thai women in Japan Tsunami 2011”, International Journal of Disaster\nRisk Reduction Volume 27, March 2018, pp.133-141\nบทความวิจัยหรือบทความวิชาการฉบับสมบูรณ์ที่ตีพิมพ์ในวารสารวิชาการระดับนานาชาติที่ไม่\nอยู่ในฐานข้อมูล ตามประกาศ ก.พ.อ. หรือระเบียบคณะกรรมการการอุดมศึกษาว่าด้วย หลักเกณฑ์การ\nพิจารณาวารสารทางวิชาการสำหรับการเผยแพร่ผลงานทางวิชาการ พ.ศ.2556 แต่สถาบันนำเสนอสภา\nสถาบันอนุมัติและจัดทำประกาศให้ทราบการทั่วไป และแจ้งให้ก.พ.อ./กกอ. ทราบภายใน 30\nวันนับแต่วันที่ออกประกาศ (ซึ่งไม่อยู่ใน Beall’s list) หรือตีพิมพ์ในวารสารวิชาการที่ปรำกฎใน\nฐานข้อมูล TCI กลุ่มที่ 1 : 0.80\nอัจจนา ธราพร, กาญจน์นภา พงศ์พนรัตน์. (2021). “ทุนทางวัฒนธรรมประเภทของที่ระลึกเพื่อส่งเสริม\nการท่องเที่ยวเชิงเศรษฐกิจสร้างสรรค์ กรณีศึกษาแบรนด์ \"โฮเล่น (HOLEN)”. สักทอง: วารสาร\nมนุษยศาสตร์และสังคมศาสตร์ ปีที่ 27 ฉบับที่ 2 เดือน เมษายน-มิถุนายน 2564 p.152\nมคอ. 2 หลักสูตรศิลปศาสตรบัณฑิต สาขาวิชานวัตกรรมการบริการ (หลักสูตรนานาชาติ) หน้า 60 กาญจน์นภา พงศ์พนรัตน์. (2019). “ปัจจัยเสี่ยงและความเปราะบางทางสังคมของเยาวชนต่อการติดพนัน\nRisks and Social Vulnerability of Youth on Gambling”. Veridian E-Journal, Silpakorn\nUniversity Humanities, Social Sciences and arts. Volume 12 Number 4 July - August\n2019\nPongponrat K. (2018). ‘Community Participatory Project for Regbilitation after Tsunami\nDisaster 2011’, Veridian E-Journal, Silpakorn University International (Humanities,\nSocial Sciences and Arts) (January-June 2018) pp.790-805\nบทความวิจัยหรือบทความวิชาการฉบับสมบูรณ์ที่ตีพิมพ์ในวารสารวิชาการที่ปรำกฎใน\nฐานข้อมูล TCI กลุ่มที่ 2 : 0.60\nParichat Jantori, Kanapa Pongponrat. (2022). The Intangible Impacts of Mass Running Events\non Communities-Evidence from Thailand. Human Behavior, Development and\nSociety Vol.23 (1), April\nปาริฉัตร จันโทริ, กาญจน์นภา พงศ์พนารัตน์ เชี่ยวชาญ. (2565). Critical Success Factors in Marathon\nRunning Event Management in Thailand-A Resource-based Perspective. Nida\nBusiness Journal, Vol.30, May 2022\nภูมิฐวัศ สัมพันธ์พานิช, กาญจน์นภา พงศ์พนรัตน์. (2020). การส่งเสริมการปลูกเฮมพ์ในพื้นที่บนเปื้อน\nแคดเมียมเพื่อพัฒนาผลิตภัณฑ์ชุมชน : กรณีศึกษาตำบลแม่ตาว อำเภอแม่สอด จังหวัดตาก.\nวารสารสังคมศาสตร์ มหาวิทยาลัยศรีนครินทรวิโรฒ ปีที่ 23 ฉบับที่ 1 (มกราคม-มิถุนายน\n2563)\nประเมศฐ์ พิชญ์พันธ์เดชา, กาญจน์นภา พงศ์พนรัตน์. (2019). การจัดการการท่องเที่ยวเชิงศาสนาของเกาะ\nฮ่องกงที่มีอิทธิพลต่อนักท่องเที่ยวชาวไทย. วารสารทีทัศน์วัฒนธรรม ปีที่ 18 ฉบับที่ 2\n(กรกฎาคม-ธันวาคม 2562) ของสำนักศิลปะและวัฒนธรรม มหาวิทยาลัยราชภัฎบ้านสมเด็จ\nเจ้าพระยา วันที่ 27 พฤษภาคม 2562\n2. รองศาสตราจารย์ ดร.คม คัมภิรานนท์\nผลงานวิจัยที่หน่วยงานหรือองค์กรระดับชาติว่าจ้างให้ดำเนินการ : 1.00\nคม คัมภิรานนท์. (2563). โครงการวิจัยเรื่อง จัดทำแผนแม่บทด้านนวัตกรรม. (ทุนสำนักงานธนานุเคราะห์\nกรมพัฒนาสังคมและสวัสดิการ)\nคม คัมภิรานนท์. (2562). โครงการวิจัยเรื่อง การวิจัยเชิงนโยบายเพื่อสร้างการเติมโตให้กับเศรษฐกิจไทย\nด้วย Smart Tourism. (ทุนสำนักงานกองทุนสนับสนุนการวิจัย)\nมคอ. 2 หลักสูตรศิลปศาสตรบัณฑิต สาขาวิชานวัตกรรมการบริการ (หลักสูตรนานาชาติ) หน้า 61 บทความวิจัยหรือบทความวิชาการฉบับสมบูรณ์ที่ตีพิมพ์ในวารสารวิชาการระดับนานาชาติที่\nปรำกฎในฐานข้อมูลระดับนานาชาติตามประกาศ ก.พ.อ. หรือระเบียบคณะกรรมการการอุดมศึกษา\nว่าด้วยหลักเกณฑ์การพิจารณาวารสารทางวิชาการสำหรับการเผยแพร่ผลงานทางวิชาการ พ.ศ.2556\n: 1.00 (SCOPUS)\nCampiranon, K. (2022). Enhancing the Customer Journey during COVID-19 through Service\nDesign: A Case Study of Pawnshops in Bangkok. Thammasat Review Volume 25,\nIssue 1, Pages 124 - 144 January-June 2022\nRamjan, S., Campiranon, K. (2021) . Customer journey mapping of a public mobile\napplication: The case study of a state electricity enterprise, ACM International\nConference Proceeding Series PartF168985, pp. 39-46 15 January 2021\nบทความวิจัยหรือบทความวิชาการฉบับสมบูรณ์ที่ตีพิมพ์ในวารสารวิชาการระดับนานาชาติที่ไม่\nอยู่ในฐานข้อมูล ตามประกาศ ก.พ.อ. หรือระเบียบคณะกรรมการการอุดมศึกษาว่าด้วย หลักเกณฑ์การ\nพิจารณาวารสารทางวิชาการสำหรับการเผยแพร่ผลงานทางวิชาการ พ.ศ.2556 แต่สถาบันนำเสนอสภา\nสถาบันอนุมัติและจัดทำประกาศให้ทราบการทั่วไป และแจ้งให้ก.พ.อ./กกอ. ทราบภายใน 30\nวันนับแต่วันที่ออกประกาศ (ซึ่งไม่อยู่ใน Beall’s list) หรือตีพิมพ์ในวารสารวิชาการที่ปรำกฎใน\nฐานข้อมูล TCI กลุ่มที่ 1 : 0.80\nคม คัมภิรานนท์. (2561). การเสริมความได้เปรียบทางการแข่งขันด้วยนวัตกรรมการบริการ : กรณีศึกษา\nบริษัทจัดการโรงแรมไทย. วารสารสุทธิปริทัศน์ ปีที่ 32 ฉบับที่พิเศษ 1 พ.ศ. 2561, หน้า : 1-14\nบทความวิจัยหรือบทความวิชาการฉบับสมบูรณ์ที่ตีพิมพ์ในวารสารวิชาการที่ปรำกฎใน\nฐานข้อมูล TCI กลุ่มที่ 2 : 0.60\nเบญจมาภรณ์ พึ่งรุ่ง, คม คัมภิรานนท์. (2021). หัวข้อ: การรับรู้ภาพลักษณ์สุขสยาม ณ ไอคอนสยามที่\nส่งผลต่อทัศนคติของลูกค้าชาวไทย. วารสาร: “อินทนิลทักษิณสาร” (Inthaninthaksin Journal)\nปีที่ 16 ฉบับที่ 1 (มกราคม – มิถุนายน 2564)\nโยษิตา นันทิภาค, คม คัมภิรานนท์. (2020). “ปัจจัยที่ส่งผลต่อการตัดสินใจซื้อสินค้าในร้านค้ามัลติแบรนด์\nผ่านสื่อสังคมออนไลน์ประเภท Instagram ของผู้บริโภคเจนเนอเรชั่นวาย”. วารสารรัชต์ภาคย์ ปี\nที่ 14 ฉบับที่ 36 กันยายน-ตุลาคม 2563 มนุษยศาสตร์และสังคมศาสตร์ ปี 2563-2567\nมคอ. 2 หลักสูตรศิลปศาสตรบัณฑิต สาขาวิชานวัตกรรมการบริการ (หลักสูตรนานาชาติ) หน้า 62 บทความวิจัยหรือบทความวิชาการฉบับสมบูรณ์ที่ตีพิมพ์ในรายงานสืบเนื่องจากการประชุม\nวิชาการระดับนานาชาติหรือในวารสารทางวิชาการระดับชาติที่ไม่อยู่ในฐานข้อมูล ตามประกาศ\nก.พ.อ. หรือระเบียบคณะกรรมการการอุดมศึกษาว่าด้วย หลักเกณฑ์การพิจารณาวารสารทางวิชาการ\nสำหรับการเผยแพร่ผลงานทางวิชาการ พ.ศ.2556 แต่สถาบันนำเสนอสภาสถาบันอนุมัติและจัดทำ\nประกาศให้ทราบการทั่วไป และแจ้งให้ก.พ.อ./กกอ. ทราบภายใน 30 วันนับแต่วันที่ออกประกาศ\n: 0.40\nCampiranon, K. (2022). Developing a Metaverse Business Model Canvas for Smart Tourism.\nAsia-Pacific Council on Hotel, Restaurant and Institutional Education (Asia-Pacific\nCHRIE 2022) 23-25 May 2022\nRamjan, S., Campiranon, K. (2021). “Customer Journey Mapping of a Public Mobile\nApplication : The Cast Study of A state Electricity Enterprise”. 2021 3rd Asia Pacific\nInformation Technology Conference (APIT 2021) Singapore Institute of Electronics.\n24-26 February 2021\n\\Ngelambong A, Campiranon K, Chendra Wibawa S. (2021). “The emergence of robot,\nartificial intelligence and service automation in Southeast Asia hospitality industry\n; A sequential exploratory study”. The International Joint Conference on Hospitality\n& Tourism 2021 (IJCHT-21) Beyond Smart Tourism Inspired by People, balanced by\nNature, Driven by Technology. University Technologic MARA, Cawangan Pulau\nPinang, Malaysia. 13-15 September 2021\nCampiranon K. (2021). “Applying a travel tech business model canvas for smart tourism in\nThailand”. The International Joint Conference on Hospitality & Tourism 2021 (IJCHT-\n21) Beyond Smart Tourism Inspired by People, balanced by Nature, Driven by\nTechnology. University Teknologi MARA, Cawangan Pulau Pinang, Malaysia. 13-15\nSeptember 2021\nCampiranon K. (2020). “Factors influencing Thailand as a Smart Tourism Destination”. 30th\nAnnual Council for Australasian Tourism and Hospitality Education Conference 2020\n(CAUTHE 2020). 10 - 13 Feb 2020\nCampiranon K. (2019). “Understanding the Concept of Smart Tourism in The Context to\nThailand”. 2019 APaCHREE & EuroCHRIE Joint Conference, Hong Kong, 22-25 MAY\n2019\nมคอ. 2 หลักสูตรศิลปศาสตรบัณฑิต สาขาวิชานวัตกรรมการบริการ (หลักสูตรนานาชาติ) หน้า 63 Campiranon K, RAMJAN,S. (2018). “key Success Factors of MICE Electronic Request for\nProposal (eRFP) : A Case Study of Bangkok Hotels”.The 1st International MICE\nConference & Forum, Thailand Convention & Exhibition Bureau (TCEB), Bangkok, 29\nAugust 2018, pp.115-125\n3. อาจารย์ ดร.ปุริมปรัชญ์ แสงแก้ว\nบทความวิจัยหรือบทความวิชาการฉบับสมบูรณ์ที่ตีพิมพ์ในวารสารวิชาการระดับนานาชาติที่\nปรำกฎในฐานข้อมูลระดับนานาชาติตามประกาศ ก.พ.อ. หรือระเบียบคณะกรรมการการอุดมศึกษา\nว่าด้วยหลักเกณฑ์การพิจารณาวารสารทางวิชาการสำหรับการเผยแพร่ผลงานทางวิชาการ พ.ศ.2556\n: 1.00 (SCOPUS)\nRamjan, Sarawut Sangkaew, Purimprach. (2022). Understanding the adoption of\nautonomous vehicles in Thailand: an extended TAM approach. Engineering\nManagement in Production and Services Volume 14, Issue 1, Pages 49 - 62\nSangkaew, P., Jago, L. and Gkritzali, A. (2019). “Adapting the technology acceptance model\n(tam) for business events: The event organizer perspective”. Event Management,\nVolume 23, Issue 6, 2019, pp.773-788\nบทความวิจัยหรือบทความวิชาการฉบับสมบูรณ์ที่ตีพิมพ์ในรายงานสืบเนื่องจากการประชุม\nวิชาการระดับนานาชาติหรือในวารสารทางวิชาการระดับชาติที่ไม่อยู่ในฐานข้อมูล ตามประกาศ\nก.พ.อ. หรือระเบียบคณะกรรมการการอุดมศึกษาว่าด้วย หลักเกณฑ์การพิจารณาวารสารทางวิชาการ\nสำหรับการเผยแพร่ผลงานทางวิชาการ พ.ศ.2556 แต่สถาบันนำเสนอสภาสถาบันอนุมัติและจัดทำ\nประกาศให้ทราบการทั่วไป และแจ้งให้ก.พ.อ./กกอ. ทราบภายใน 30 วันนับแต่วันที่ออกประกาศ\n: 0.40\nSangkaew P. (2022). Aconceptual Framework to Explain the Virtual Events Adoption\nBehaviors of Conference Attendees. The 32nd Annual Cauthe Conference, CAUTHE\n2022 Hybrid Conference, Brisbane, Australia. 7-9 February 2022\nSangkaew P. (2021). An Application of Design Thinking for Virtual Event Design Attendee\nExperience. The International Joint Conference on Hospitality & Tourism 2021\n(IJCHT-21) Beyond Smart Tourism Inspired by People, balanced by Nature, Driven\nby Technology. 13-15 September 2021 University Teknologi MARA, Cawangan Pulau\nPinang, Malaysia\nมคอ. 2 หลักสูตรศิลปศาสตรบัณฑิต สาขาวิชานวัตกรรมการบริการ (หลักสูตรนานาชาติ) หน้า 64 Sangkaew, P., Jago, L. and Gkritzali, A. (2018). Factor influencing intention to use mobile\napplications in business events. The conference attendee perspectives. The 28th\nAnnual CAUTHE conference, Newcastle, Australia, 5 – 8 February 2018, p.97.\n4. ผู้ช่วยศาสตราจารย์ ดร.เวฬุรีย์ เมธาวีวินิจ\nบทความวิจัยหรือบทความวิชาการฉบับสมบูรณ์ที่ตีพิมพ์ในวารสารวิชาการระดับนานาชาติที่\nปรำกฎในฐานข้อมูลระดับนานาชาติตามประกาศ ก.พ.อ. หรือระเบียบคณะกรรมการการอุดมศึกษา\nว่าด้วยหลักเกณฑ์การพิจารณาวารสารทางวิชาการสำหรับการเผยแพร่ผลงานทางวิชาการ พ.ศ.2556\n: 1.00 (SCOPUS)\nVeluree Metaveerinij. (2019). Negotiating representation: gender, city and nation in South\nEast Asian transnational cinema. South East Asia Research Volume 27, Issue 2, 2019,\nPages 133-149\nVeluree Metaveerinij. (2019). Consuming modernity and nostalgia: A case study of cross\nborder representations and fandom of Thailand-Myanmar transnational cinema.\nPlaridel Volume 16, Issue 2, 1 July 2019, Pages 1-23\nบทความวิจัยหรือบทความวิชาการฉบับสมบูรณ์ที่ตีพิมพ์ในวารสารวิชาการที่ปรำกฎใน\nฐานข้อมูล TCI กลุ่มที่ 2 : 0.60\nVeluree Metaveevinij. (2019). Representation and Relationship of Girls in Song Lyrics of Girl\nGroups and Duos: From Sao Sao Sao to BNK48’. Dhurakij Punbit Communication\nArts Journal. 13(1): 80-129.\nบทความวิจัยหรือบทความวิชาการฉบับสมบูรณ์ที่ตีพิมพ์ในรายงานสืบเนื่องจากการประชุม\nวิชาการระดับชาติ : 0.20\nพิมพกานต์ ศรีสวัสดิ์, เวฬุรีย์ เมธาวีวินิจ. (2564). ภาพตัวแทนความอีสานที่ปรำกฎในภาพยนตรไ์ ทบ้าน\nเดอะซีรีส์, การประชุมวิชาการระดับชาติครั้งที่ 10 ประจำปีพ.ศ.2564 \"Reshaping Thailand\nTourism and Service through New Paradigm\", วันที่ 10 กันยายน 2564, หน้า 53-66\nธนาภา รัตนวรรณ, เวฬุรีย์ เมธาวีวินิจ. (2564). อิทธิพลของวัฒนธรรมกระแสนิยมผ่านอำนาจละมุนในซีรีส์\nจีนย้อนยุค, การประชุมวิชาการระดับชาติครั้งที่ 10 ประจำปีพ.ศ.2564 \"Reshaping Thailand\nTourism and Service through New Paradigm\", วันที่ 10 กันยายน 2564, หน้า 255-267\nปิณจุฑา รัชตเมธาวิน และ เวฬุรีย์ เมธาวีวินิจ. (2564). อุดมการณ์เศรษฐกิจแบบชาตินิยมผ่านละครท่อง\nเวลากรณีศึกษา รักแลกภพ (2563). การประชุมวิชาการระดับชาติและนานาชาติ (HUSOC14)\nครั้งที่ 14, มหาวิทยาลัยนเรศวร. วันที่ 15-16 กรกฎาคม 2564. หน้า 907-921\nมคอ. 2 หลักสูตรศิลปศาสตรบัณฑิต สาขาวิชานวัตกรรมการบริการ (หลักสูตรนานาชาติ) หน้า 65 พลสิทธิ์ ลีลาอภินันท์ และ เวฬุรีย์ เมธาวีวินิจ. (2564). การศึกษาภาพแทนความชายในภาพยนตร์ชุด\nเจมส์ บอนด์. การประชุมวิชาการระดับชาติและนานาชาติ (HUSOC14) ครั้งที่ 14, มหาวิทยาลัย\nนเรศวร. วันที่ 15-16 กรกฎาคม 2564. หน้า 335-349\nอมรดา ยุตาคม และ เวฬุรีย์ เมธาวีวินิจ. (2564). ปัจจัยการเลือกรับชมพิพิธภัณฑ์เสมือนจริง (Virtual\nMuseum) ระหว่างสถานการณ์โควิด19 ของเจเนเรชั่นวายและ เจเนอเรชั่นแซด. การประชุม\nวิชาการระดับชาติและนานาชาติ (HUSOC14) ครั้งที่ 14, มหาวิทยาลัยนเรศวร. วันที่ 15-16\nกรกฎาคม 2564. หน้า 611-628\nชูพงษ์ แสงเพชร และ เวฬุรีย์ เมธาวีวินิจ. (2562). ทวิภพ (2547) และ พี่มาก..พระโขนง (2556):\nสุนทรียภาพแบบหลังสมัยใหม่ในภาพยนตร์รีเมกแนวทบทวนวิพากษ์. งานประชุมวิชาการ\nระดับชาติอุตสาหกรรมประสานศิลป์: วรรณกรรม วัฒนธรรมสกรีน และการเดินทางข้ามสื่อ,\nมหาวิทยาลัยเกษตรศาสตร์. กองทุนส่งเสริมศิลปะร่วมสมัย สำนักงานศิลปวัฒนธรรมร่วมสมัย.\nวันที่ 2 กันยายน 2562 หน้า 151-185\nอนินทยา ประสิทธิมี, เวฬุรีย์ เมธาวีวินิจ. (2562). พฤติกรรมและอัตลักษณ์บนสื่อออนไลน์ของแฟนคลับ\nศิลปินเกาหลีวง WANNA ONE ในประเทศไทย, การประชุมหาดใหญ่วิชาการระดับชาติและ\nนานาชาติครั้งที่ 10 มหาวิทยาลัยหาดใหญ่ (นำเสนอภาคโปสเตอร์). วันที่ 12-13 กรกฎาคม 2562,\nมหาวิทยาลัยหาดใหญ่. หน้า 196-197\nผลงานสร้างสรรค์ (นวนิยาย)\nเวฬุรีย์ เมธาวีวินิจ. (2564). แอปซ่อนรัก.กรุงทพฯ : กู๊ดเฮด พริ้นท์ติ้ง แอนด์ แพคเกจจิ้ง\nเวฬุรีย์ เมธาวีวินิจ. (2565) คดีรักร้าง. กรุงทพฯ : กรู๊ฟ พับลิชชิ่ง\n5. อาจารย์ ปรีชญา ชวลิตธำรง\nผลงานวิจัยที่หน่วยงานหรือองค์กรระดับชาติว่าจ้างให้ดำเนินการ : 1.00\nปรีชญา ชวลิตธำรง (2564). โครงการวิจัยเรื่อง โครงการติดตามและประเมินผลตามนโยบายที่สำคัญ : กรณี\nการจัดให้มีคลื่นความถี่เพื่อประโยชน์สาธารณะหรือสำหรับภาคประชาชน คณะกรรมการติดตาม\nและผลการปฏิบัติงาน. (ทุนสำนักงานคณะกรรมการกิจการกระจายเสียง กิจการโทรทัศน์และ\nกิจการโทรคมนาคมแห่งชาติ)\nปรีชญา ชวลิตธำรง (2562). โครงการวิจัยเรื่อง โครงการติดตามประเมินผล นโยบายรัฐบาลมิติบูรณาการ.\n(ทุนสำนักงบประมาณ)\nมคอ. 2 หลักสูตรศิลปศาสตรบัณฑิต สาขาวิชานวัตกรรมการบริการ (หลักสูตรนานาชาติ) หน้า 66 ภาคผนวก 2 ตารางเปรียบเทียบโครงสร้างและองค์ประกอบของหลักสูตร ฉบับ พ.ศ. 2566 กับ\nฉบับ พ.ศ. 2561 (ใช้สำหรับหลักสูตรปรับปรุง) ขอให้เปรียบเทียบรายละเอียดของ\nหลักสูตร ดังนี้\nหลักสูตร ฉบบัพ.ศ. 2561 หลักสูตร ฉบบัพ.ศ. 2566 สรุปการ\nเปลี่ยนแปลง\n1) ชื่อหลักสูตร\nชื่อภาษาไทย: ชื่อภาษาไทย: คงเดิม\nหลักสตู รศลิปศาสตรบัณฑติสาขาวิชานวัตกรรม หลักสตู รศลิปศาสตรบัณฑติสาขาวิชานวัตกรรม\nการบริการ (หลักสตู รนานาชาติ) การบริการ (หลักสตู รนานาชาติ)\nชื่อภาษาอังกฤษ: Bachelor of Arts Program ชื่อภาษาอังกฤษ: Bachelor of Arts Program\nin Service Innovation in Service Innovation\n(International Program) (International Program)\nชื่อปริญญาและสาขาวิชา ชื่อปริญญาและสาขาวิชา\nภาษาไทย: ภาษาไทย:\nชื่อเต็ม ศิลปศาสตรบณัฑติ (นวัตกรรมการ ชื่อเต็ม ศิลปศาสตรบณัฑติ (นวัตกรรมการ\nบริการ) บริการ)\nชื่อย่อ ศศ.บ. (นวัตกรรมการบริการ) ชื่อย่อ ศศ.บ. (นวัตกรรมการบริการ)\nภาษาอังกฤษ: ภาษาอังกฤษ:\nชื่อเต็ม Bachelor of Arts (Service ชื่อเต็ม Bachelor of Arts (Service\nInnovation) Innovation)\nชื่อย่อ B.A. (Service Innovation) ชื่อย่อ B.A. (Service Innovation)\n2) ปรัชญาและ/หรือวัตถุประสงค์ของหลักสูตร\nปรัชญา ปรัชญา คงเดิม\nหลักสูตรมีความมุ่งมั่นที่จะผู้นำในการพัฒนา หลักสูตรมีความมุ่งมั่นที่จะผู้นำในการพฒันำ\nองค์ความรู้ด้านนวัตกรรมการบริการ โดยเน้น องค์ความรู้ด้านนวัตกรรมการบริการ สร้าง\nการสร้างมาตรฐานการเรียนการสอนอย่าง มาตรฐานการเรียนการสอนอย่างสร้างสรรคแ์ ละ\nสร้างสรรค์และผลิตผลงานวิจัยในระดับนานาชาติผลิตผลงานวิจัยในระดับนานาชาติสร้างสังคม\nโดยมีปรัชญาในการสร้างสังคมแห่งการเรียนรู้จาก แห่งการเรียนรู้จากความหลากหลาย (Synergy\nความหลากหลาย (Synergy from Diversity) from Diversity) และการมีคุณธรรมควบคู่\nและการมีคุณธรรมควบคู่ (Excellence with (Excellence with Ethics) เพื่อมุ่งสร้าง\nEthics) เพื่อมุ่งสร้างนวัตกรรมการศึกษาและ นวัตกรรมการศึกษาและพัฒนาโดยคำนึงถึงองค์\nพัฒนาโดยคำนึงถึงองค์รวม (Educational รวม (Educational Innovation with Holistic\nInnovation with Holistic Development) Development)\nหลักสูตรศิลปศาสตรบัณฑิต สาขาวิชานวัตกรรม หลักสูตรศิลปศาสตรบัณฑิต สาขาวิชานวัตกรรม\nการบริการ มุ่งเน้นการพัฒนาบุคลากรรุ่นใหม่ใหมี้การบริการ (นานาชาติ) มุ่งเน้นการพัฒนา\nความรู้ความสามารถ และทักษะที่จำ ผ่าน บุคลากรรุ่นใหม่ให้มีความรู้ความสามารถ และ\nมคอ. 2 หลักสูตรศิลปศาสตรบัณฑิต สาขาวิชานวัตกรรมการบริการ (หลักสูตรนานาชาติ) หน้า 67 หลักสูตร ฉบบัพ.ศ. 2561 หลักสูตร ฉบบัพ.ศ. 2566 สรุปการ\nเปลี่ยนแปลง\nการเรียนการสอนและองค์ความรู้แบบพหุ ทักษะที่จำ ผ่านการเรียนการสอนและองค์\nวิทยาการ โดยวิธีการคิดและทำอย่างสร้างสรรค์ ความรู้แบบพหุวิทยาการ (Multidisciplinary)\nเพื่อให้บัณฑิตสามารถทำงานในอุตสาหกรรมการ โดยวิธีการคิดและทำอย่างสร้างสรรค์ เพื่อให้\nบริการรูปแบบต่าง ๆ ได้อย่างมีประสิทธิภาพ บัณฑิตสามารถทำงานในอุตสาหกรรมการบริการ\nพร้อมด้วยคุณธรรมและจริยธรรม รูปแบบต่าง ๆ ได้อย่างมีประสิทธิภาพพร้อมด้วย\nคุณธรรมและจริยธรรม\nวัตถุประสงค์ของหลักสูตร วัตถุประสงค์ของหลักสูตร คงเดิม\nเพื่อให้บัณฑิตทสี่ำเร็จการศึกษาในหลักสตู รมี เพื่อให้บัณฑิตทสี่ำเร็จการศึกษาในหลักสตู รมี\nลักษณะ ดังนี้ลักษณะ ดังนี้\n1. มีความรู้ความสามารถ ด้านการใช้ 1. มีความรู้ความสามารถ ด้านการใช้\nนวัตกรรมและความคิดสร้างสรรคเ์พื่อ นวัตกรรมและความคิดสร้างสรรคเ์พื่อ\nตอบสนองต่อธุรกิจในภาคอุตสาหกรรม ตอบสนองต่อธุรกิจในภาคอุตสาหกรรม\nบริการ บริการ\n2. มีทักษะ ความสามารถในการใช้ความคิดเชิง 2. มีทักษะ ความสามารถในการใช้ความคิด\nสร้างสรรค์ การแก้ไขปัญหาการทำงาน เชิงสร้างสรรค์ การแก้ไขปัญหาการทำงาน\nให้บริการรูปแบบต่าง ๆ ภายใต้การทำงาน ให้บริการรูปแบบต่าง ๆ ภายใต้การทำงาน\nสากล สากล\n3. มีความรู้ความเข้าใจต่อการพัฒนาธุรกิจ 3. มีความรู้ความเข้าใจต่อการพัฒนาธุรกิจ\nการบริการทั้งในระดับประเทศ ระดับ การบริการทั้งในระดับประเทศ ระดับ\nภูมิภาค และระดับโลก ภูมิภาค และระดับโลก\n4. มีความสามารถในการพัฒนางานวิจัย การ 4. มีความสามารถในการพัฒนางานวิจัย การ\nใช้เทคโนโลยี เพื่อสร้างนวัตกรรมในการ ใช้เทคโนโลยี เพื่อสร้างนวัตกรรมในการ\nให้บริการที่มีความหลากหลาย ให้บริการที่มีความหลากหลาย\n3) คุณสมบัติของผู้เข้าศึกษา\nคุณสมบัติของผู้เข้าศึกษาต้องไปตามข้อบังคับ คุณสมบัติของผู้เข้าศึกษาต้องไปตาม ปรับแก้ไขรายละเอียด\nมหาวิทยาลยัธรรมศาสตร์ว่าด้วยการศึกษาชั้น ข้อบังคับมหาวิทยาลัยธรรมศาสตร์ ว่าด้วย การคัดเลือกผเู้ข้าศึกษา\nปริญญาตรีพ.ศ. 2561 ข้อ 14 ดังนี้การศึกษาชั้นปริญญาตรีพ.ศ. 2561 ข้อ 14 โดยการคัดเลือกผเู้ข้า\nข้อ 14 นักศึกษามหาวิทยาลัยต้องมีคุณสมบัติการคัดเลือกผู้เข้าศึกษา ศึกษาให้ไปตาม\nทั่วไปและไม่มลีักษณะต้องห้าม ดงันี้ • การคัดเลือกผู้เข้าศึกษาให้ไปตามระเบยีบ ระเบียบคัดเลือกเพื่อ\n(1) สำเรจ็การศึกษาไมต่ำกว่าชั้น คัดเลือกเพื่อเข้าศึกษาในสถาบันการศึกษาขั้น เข้าศึกษาใน\nมัธยมศึกษาตอนปลายหรือเทียบเท่า อุดมศึกษาของส่วนราชการหรือหน่วยงานอื่น สถาบันการศึกษาขั้น\n(2) ไม่นักศึกษาของมหาวิทยาลัยหรือ ดำเนินการตามการมอบหมายของ อุดมศึกษาของส่วน\nสถาบันอุดมศึกษาอื่น เว้นแต่การศึกษา มหาวิทยาลัยหรือตามข้อตกลง หรือการ ราชการหรือหน่วยงาน\nในมหาวิทยาลัยเปิด หรือการศึกษา คัดเลือกตามวิธีการที่มหาวิทยาลัยกำหนดโดย อื่นดำเนินการตามการ\nหลักสตู รทางไกล (Online) ที่ได้รบัความเห็นชอบของสภามหาวิทยาลัยและ มอบหมายของ\nปริญญา ออกประกาศมหาวิทยาลัย มหาวิทยาลยัหรือตาม\nมคอ. 2 หลักสูตรศิลปศาสตรบัณฑิต สาขาวิชานวัตกรรมการบริการ (หลักสูตรนานาชาติ) หน้า 68 หลักสูตร ฉบบัพ.ศ. 2561 หลักสูตร ฉบบัพ.ศ. 2566 สรุปการ\nเปลี่ยนแปลง\n(3) ไม่ผู้ป่วยหรืออยู่ในสภาวะที่จะ • ต้องมีคะแนนสอบภาษาอังกฤษไปตาม ข้อตกลง หรือการ\nอุปสรรคร้ายแรงต่อการศึกษา ประกาศที่วิทยาลัยกำหนด คัดเลือกตามวิธีการที่\n(4) ไม่ผู้ประพฤติผดิศีลธรรมอันดหีรือมี • ในกรณีที่นักศึกษาต่างชาติผู้ที่มีสัญชาติมหาวิทยาลยักำหนด\nพฤติกรรมเสื่อมเสียอย่างร้ายแรง\nและมีถิ่นฐานอยู่ในประเทศที่ใช้ภาษาอังกฤษ\nโดยความเห็นชอบของ\nการคัดเลือกผู้เข้าศึกษา (นักศกึษาไทยและ สภามหาวิทยาลยั และ\nภาษาราชการ จะได้รับการพิจารณา\nนักศึกษาต่างชาติ)\nยกเว้นไม่จำต้องส่งผลทดสอบ\nออกประกาศ\n• การคัดเลือกตามวิธีการที่มหาวิทยาลัยกำหนด ภาษาอังกฤษ ซึ่งมีรายชื่อประเทศดังนี้มหาวิทยาลยั\nโดยความเห็นชอบของสภามหาวิทยาลัยหรือ ออสเตรเลีย สหราชอาณาจักร นิวซีแลนด์\nการคัดเลือกผู้เข้าศึกษาให้ไปตามระเบียบ ไอร์แลนด์ แคนาดา และสหรัฐอเมริกา\nการคัดเลือกบุคคลเพื่อเข้าศึกษาใน\nสถาบันการศึกษาขั้นอุดมศึกษาของสำนักงาน\nคณะกรรมการการอุดมศึกษา\n• ต้องมีคะแนนสอบภาษาอังกฤษไปตาม\nเกณฑภ์าษาอังกฤษสำหรับหลักสตู รนานาชาติ\n• ในกรณีที่นักศึกษาต่างชาติผู้ทมี่สัญชาติ\nและมีถิ่นฐานอยู่ในประเทศที่ใช้ภาษาอังกฤษ\nภาษาราชการ จะได้รับการพิจารณา\nยกเว้นไม่จำต้องส่งผลทดสอบ\nภาษาอังกฤษ ซึ่งมีรายชื่อประเทศดังนี้\nออสเตรเลีย สหราชอาณาจักร นิวซีแลนด์\nไอร์แลนด์ แคนาดา และสหรัฐอเมริกา\n• เงื่อนไขอื่นๆ ให้ไปตามประกาศรับสมัคร\nบุคคลเข้าศึกษาในระดับอดุ มศึกษาของ\nมหาวิทยาลยัธรรมศาสตร์ และ/หรือ วิทยาลัย\nนวัตกรรม\n4) จำนวนการรับนักศึกษา\nรับนักศึกษาปลีะ 60 คน รับนักศึกษาปลีะ 60 คน คงเดิม\n5) ระบบการศึกษา\nระบบ ระบบ ปรับรายละเอียด\nใช้ระบบการศึกษาแบบทวิภาค โดย 1 ปี หลักสูตรแบบเต็มเวลา ใช้ระบบ ระบบการศึกษาตาม\nการศึกษาแบ่งออก 2 ภาคการศึกษาปกติการศึกษาแบบทวิภาค โดย 1 ปีการศึกษา เกณฑ์ฯ 2565\nซึ่ง 1 ภาคการศึกษาปกติมีระยะเวลาศึกษาไม่ แบ่งออก 2 ภาคการศึกษาปกติ 1 ภาค\nน้อยกว่า 15 สัปดาห์ การศึกษาปกติมีระยะเวลาศึกษาไม่น้อยกว่า\n15 สัปดาห์\nมคอ. 2 หลักสูตรศิลปศาสตรบัณฑิต สาขาวิชานวัตกรรมการบริการ (หลักสูตรนานาชาติ) หน้า 69 หลักสูตร ฉบบัพ.ศ. 2561 หลักสูตร ฉบบัพ.ศ. 2566 สรุปการ\nเปลี่ยนแปลง\nระบบการศึกษา ระบบการศึกษา\n\n<include> แบบชั้นเรียน </include>\n<include> แบบชั้นเรียน (Onsite)</include>\n\n<exclude> แบบทางไกลผ่านสื่อสิ่งพิมพ์หลัก </exclude>\n<exclude> แบบทางไกล (Online)</exclude>\n\n<exclude> แบบทางไกลผ่านสื่อแพร่ภาพและเสียง </exclude>\n<exclude> แบบประสมประสาน (Hybrid)</exclude>\nสื่อหลัก\n<include> อื่นๆ (ระบุ)</include>\n\n<exclude> แบบทางไกลทางอิเล็กทรอนิกส์สื่อ นอกเหนือจากระบบการศึกษาแบบชนั้ เรียน</exclude>\nหลัก (E-Learning) หลักสูตรจะใช้เทคนิคการเรียนการสอนแบบ\n\n<exclude> แบบทางไกลทางอินเทอร์เน็ต ผสมผสาน เพื่อสร้างการเรียนรู้ที่มี</exclude>\n\n<include> อื่น ๆ ประสิทธิภาพให้แก่นักศึกษา โดยเทคนิคที่จะ</include>\nนอกเหนือจากระบบการศึกษาแบบชนั้ เรียน ใช้ในการสร้างการเรียนรู้ประกอบด้วย การ\nหลักสูตรจะใช้เทคนิคการเรียนการสอน เรียนรู้เชิงรุก (Active learning) การเรียนรู้\nแบบผสมผสาน เพื่อสร้างการเรียนรู้ที่มีจากปัญหาที่เผชิญอยู่ในปจัจุบนั (Problem-\nประสิทธิภาพให้แก่นักศึกษา โดยเทคนิคที่ based learning) การเรียนรู้ด้วยการทำ\nจะใช้ในการสร้างการเรียนรู้ประกอบด้วย โครงงาน (Project-based learning) การ\nการเรียนรู้เชิงรุก (Active learning) การ ทำงานกลุ่ม การทำงานวิจัย โครงการเดี่ยว\nเรียนรู้จากปัญหาที่เผชิญอยู่ในปจัจุบัน การวิเคราะห์กรณีศึกษา การฝึกงานผ่านการ\n(Problem-based learning) การเรียนรู้ปฏิบัติจริง รวมถึงการศึกษาดงูาน\nด้วยการทำโครงงาน (Project-based\nlearning) การทำงานกลุ่ม การทำงานวิจัย\nโครงการเดี่ยว การวิเคราะห์กรณีศึกษา\nการฝึกงานผ่านการปฏบิัติจริง รวมถึง\nการศึกษาดูงาน\n6) เกณฑ์การสำเร็จการศึกษา\nเกณฑ์การสำเร็จการศึกษาตามหลักสูตร เกณฑ์การสำเร็จการศึกษาตามหลักสูตร กำหนดให้นักศึกษาสอบ\n• ได้ศึกษารายวิชาต่าง ๆ ครบตามโครงสร้าง • สอบผ่าน และได้รับหน่วยกิตสะสมครบตาม ผ่าน และได้รับหน่วยกิต\nหลักสูตร และมีหน่วยกิตสะสมไม่น้อยกว่า โครงสร้างหลักสูตร และมีหน่วยกิตสะสมไม่สะสมครบตาม\n129 หน่วยกิต น้อยกว่า 129 หน่วยกิต โครงสร้างหลักสูตร และ\n• ได้ค่าระดับเฉลี่ยสะสมไม่ต่ำกว่า 2.00 (จาก • ได้ค่าระดับเฉลี่ยสะสมไม่ต่ำกว่า 2.00 (จาก มีหน่วยกิตสะสมไม่น้อย\nระบบ 4 ระดับคะแนน) ระบบ 4 ระดับคะแนน) กว่า 129 หน่วยกิต\n• ได้ค่าระดับ S (ใช้ได้) ในรายวิชา นบ.484 • ได้ค่าระดับ S (ใช้ได้) ในรายวิชา นบ.484 แทนข้อกำหนดได้ศึกษา\nการฝึกงานสำหรับอุตสาหกรรมการบริการ การฝึกงานสำหรับอุตสาหกรรมการบริการ รายวิชาต่าง ๆ ครบตาม\n• ต้องปฏิบัติตามเงื่อนไขอื่น ๆ ที่วิทยาลัย • ต้องปฏิบัติตามเงื่อนไขอื่น ๆ ที่วิทยาลัย โครงสร้างหลักสูตร และ\nนวัตกรรมและมหาวิทยาลัยธรรมศาสตร์ นวัตกรรมและมหาวิทยาลัยธรรมศาสตร์ มีหน่วยกิตสะสมไม่น้อย\nกำหนด กำหนด กว่า 129 หน่วยกิต\nมคอ. 2 หลักสูตรศิลปศาสตรบัณฑิต สาขาวิชานวัตกรรมการบริการ (หลักสูตรนานาชาติ) หน้า 70 หลักสูตร ฉบบัพ.ศ. 2561 หลักสูตร ฉบบัพ.ศ. 2566 สรุปการ\nเปลี่ยนแปลง\n7) โครงสร้างและองค์ประกอบของหลักสูตร\nโครงสร้างหลักสูตร โครงสร้างหลักสูตร เพิ่มรายละเอียด\n1) หมวดวิชาศึกษาทั่วไป 30 หน่วยกิต นักศึกษาจะต้องจดทะเบียนศึกษารายวิชา รวม นักศึกษาจะต้องจด\n2) หมวดวิชาเฉพาะ 93 หน่วยกิต ไม่น้อยกว่า 129 หน่วยกิต โดยศึกษารายวิชา ทะเบียนศึกษารายวิชา\n2.1) วิชาบังคับ 81 หน่วยกิต ต่างๆ ครบตามโครงสร้างองค์ประกอบ และ รวมไม่น้อยกว่า 129\n2.2) วิชาเลือก 12 หน่วยกิต ข้อกำหนดของหลักสูตรดังนี้หน่วยกิต โดยศึกษา\n3) หมวดวิชาเลือกเสรี 6 หน่วยกิต 1) วิชาศึกษาทั่วไป 30 หน่วยกิต รายวิชาต่างๆ ครบตาม\nรวม 129 หน่วยกิต 2) วิชาเฉพาะ 93 หน่วยกิต โครงสร้างองค์ประกอบ\n2.1) วิชาบังคับ 81 หน่วยกิต และข้อกำหนดของ\n2.2) วิชาเลือก 12 หน่วยกิต หลักสูตร\n3) วิชาเลือกเสรี 6 หน่วยกิต\nรวม 129 หน่วยกิต\n8) รายวิชาตามโครงสร้างของหลักสูตร\n1. หมวดวิชาศึกษาทั่วไป 1. หมวดวิชาศึกษาทั่วไป\nวิชาศึกษาทั่วไป (General Education วิชาศึกษาทั่วไป 30 หน่วยกิต\nCourses) นักศึกษาทุกคนสามารถเลือกเรียนได้ทุกรายวิชา ปรับเงื่อนไข หมวดวิชา\nนักศึกษาจะต้องศึกษารายวิชาในหลักสตู รวิชา ในแต่ละหมวด โดยต้องเลือกเรียนให้ครบทั้ง และรายวิชาตาม\nศึกษาทั่วไป รวมแล้วไม่น้อยกว่า 30 หน่วยกิต 5 หมวด แต่ละหมวดจะเรียนกี่วิชาก็ได้จำนวน หลักสูตรศึกษาทั่วไป\nตามโครงสร้างและองค์ประกอบของหลักสูตรวิชา รวมทั้งสิ้น 30 หน่วยกิต ตามโครงสร้างและ หลักสูตรปรับปรุง พ.ศ.\nศึกษาทั่วไป ซึ่งแบ่ง 2 ส่วน คือ องค์ประกอบของหลักสูตรวิชาศึกษาทั่วไปที่ 2566\nวิทยาลัยกำหนดไว้ดังนี้\nส่วนที่ 1: หลักสตู รกลางของมหาวิทยาลยัที่\nหมวดวิชา\nกำหนดให้นักศึกษาทุกคนต้องเรยีน จำนวน 21\n1) หมวดความเท่าทันโลกและสังคม\nหน่วยกิต โดยกำหนดให้นักศึกษาศึกษาในรูปแบบ\n2) หมวดสุนทรียะและทักษะการสอื่สาร\nดังนี้\n3) หมวดคณิตศาสตร์ วิทยาศาสตร์ และ\nเทคโนโลยี\nหมวดวชิา จำนวนหน่วยกิต\n4) หมวดสุขภาวะและทักษะแห่งอนาคต\n1. สังคมศาสตร์ 6 หน่วยกิต\n2. มนุษยศาสตร์ 3 หน่วยกิต 5) หมวดการบริการสังคมและการเรียนรู้\n3. วิทยาศาสตร์กับ 3 หน่วยกิต จากการปฏิบตัิ\nคณิตศาสตร์ รวม 30 หน่วยกิต\n4. ภาษา 9 หน่วยกิต\nรวม 21 หน่วยกิต\nมคอ. 2 หลักสูตรศิลปศาสตรบัณฑิต สาขาวิชานวัตกรรมการบริการ (หลักสูตรนานาชาติ) หน้า 71 หลักสูตร ฉบบัพ.ศ. 2561 หลักสูตร ฉบบัพ.ศ. 2566 สรุปการ\nเปลี่ยนแปลง\nส่วนที่ 1\n1. หมวดสังคมศาสตร์ บังคับ 2 วิชา\n6 หน่วยกิต\nมธ.100 พลเมืองกับการลงมือ 3 (3-0-6) มธ.100 พลเมืองกับการลงมือ(5) 3 (3-0-6) คงเดิม\nแก้ปัญหา แก้ปัญหา\nTU100 Civic Engagement TU100 Civic Engagement(5)\nมธ.101 โลก อาเซียนและไทย 3 (3-0-6) ปิดวิชา\nTU101 Thailand, ASEAN and the World\nมธ.109 นวัตกรรมกับกระบวน 3 (3-0-6) มธ.109 นวัตกรรมกับกระบวน(1) 3 (3-0-6) คงเดิม\nคิดผู้ประกอบการ คิดผู้ประกอบการ\nTU109 Innovation and Entrepreneurial TU109 Innovation and Entrepreneurial\nmindset mindset(1)\nสผ.165 เศรษฐกิจสร้างมูลค่า (1) 3 (3-0-6) เพิ่มรายวิชา\nAP165 Value Creation Economy(1)\nปด.102 สังคมศาสตร์ใน (1) 3 (3-0-6) เพิ่มรายวิชา\nศตวรรษที่ 21\nPD102 Social Sciences in the 21st Century (1)\n2.หมวดมนุษยศาสตร์\nบังคับ 1 วิชา 3 หน่วยกิต\nมธ.102 ทักษะชีวิตทางสังคม 3 (3-0-6) ปิดวิชา\nTU102 Social Life Skills\nมธ.108 การพัฒนาและจัดการ 3 (3-0-6) มธ.108 การพัฒนาและจัดการ(4) 3 (3-0-6) คงเดิม\nตนเอง ตนเอง\nTU108 Social Life Skills TU108 Social Life Skills (4)\nปด.103 มนุษย์ศาสตร์ในยุค (2) 3 (3-0-6) เพิ่มรายวิชา\nแห่งการผันผวน\nPD103 Humanities in the Age of\nDisruption (2)\nปด.104 เส้นทางสู่ความ (2) 3 (3-0-6) เพิ่มรายวิชา\nสมัยใหม่และโลกาภิวัตน์\nPD104 The Path to Modernity and\nGlobalization (2)\nจน.171 ภาษาจีน 1 (2) 3 (3-0-6) เพิ่มรายวิชา\nCH171 Chinese 1 (2)\nจน.172 ภาษาจีน 2 (2) 3 (3-0-6) เพิ่มรายวิชา\nCH172 Chinese 2 (2)\nมคอ. 2 หลักสูตรศิลปศาสตรบัณฑิต สาขาวิชานวัตกรรมการบริการ (หลักสูตรนานาชาติ) หน้า 72 หลักสูตร ฉบบัพ.ศ. 2561 หลักสูตร ฉบบัพ.ศ. 2566 สรุปการ\nเปลี่ยนแปลง\nอซ.171 ภาษาเกาหลี 1 (2) 3 (3-0-6) เพิ่มรายวิชา\nAS171 Korean 1 (2)\nอซ.172 ภาษาเกาหลี 2 (2) 3 (3-0-6) เพิ่มรายวิชา\nAS172 Korean 2 (2)\n3. หมวดวิทยาศาสตร์กับคณิตศาสตร์\nบังคับ 1 วิชา 3 หน่วยกิต\nมธ.103 ชีวิตกับความยั่งยืน 3 (3-0-6) มธ.103 ชีวิตกับความยั่งยืน (3) 3 (3-0-6) คงเดิม\nTU103 Life and Sustainability หรือ TU103 Life and Sustainability (3)\nมธ.107 ทักษะดิจิทัลกับการแก้ 3 (3-0-6) มธ.107 ทักษะดิจิทัลกับการแก้ (3) 3 (3-0-6) คงเดิม\nปัญหา ปัญหา\nTU107 Digital Skill and Problem TU107 Digital Skill and Problem\nSolving Solving (3)\n4. หมวดภาษา บังคับ 3 วิชา 9 หน่วยกิต\nมธ.050 การพัฒนาทักษะ ไม่นับหน่วยกิต ปิดวิชา\nภาษาอังกฤษ\nTU050 English Skill Development\nมธ.104 การคิด อ่าน และเขียน 3 (3-0-6) ศศ.101 การคิด อ่านและเขียน (2) 3 (3-0-6) เปลี่ยนรหัสวิชา\nอย่างมีวิจารณญาณ อย่างมีวิจารณญาณ\nTU104 Critical Thinking, Reading, and LAS101 Critical Thinking, Reading, and\nWriting Writing (2)\nมธ.105 ทักษะการสื่อสารด้วย 3 (3-0-6) สษ.105 ทักษะการสื่อสารทาง (2) 3 (3-0-6) เปลี่ยนรหัสและชื่อวิชา\nภาษาอังกฤษ ภาษาอังกฤษ ภาษาอังกฤษ\nTU105 Communication Skills in English EL105 English Communication Skills (2)\nมธ.106 ความคิดสร้างสรรค์และ 3 (3-0-6) มธ.106 ความคิดสร้างสรรค์และ (2) 3 (3-0-6) คงเดิม\nการสื่อสาร การสื่อสาร\nTU106 Creativity and Communication TU106 Creativity and Communication(2)\nส่วนที่ 2\nนักศึกษาต้องศึกษารายวิชาที่วิทยาลัยฯ กำหนด\nจำนวน 9 หน่วยกิต\nวิชาศึกษาที่วิทยาลัยฯ กำหนด บงัคับ 1 วิชา\nนักศึกษาเลือกศึกษา จากรายวิชาดังต่อไปนี้\nจ.228 จิตวิทยาความสัมพันธ์ 3 (3-0-6) ปิดวิชา\nระหว่างบุคคล\nPY228 Creativity and Communication\nอซ.125 ความรู้ทั่วไปเกี่ยวกับ 3 (3-0-6) ปิดวิชา\nอาเซียน\nAS125 Introduction to ASEAN\nมคอ. 2 หลักสูตรศิลปศาสตรบัณฑิต สาขาวิชานวัตกรรมการบริการ (หลักสูตรนานาชาติ) หน้า 73 หลักสูตร ฉบบัพ.ศ. 2561 หลักสูตร ฉบบัพ.ศ. 2566 สรุปการ\nเปลี่ยนแปลง\nมธ.117 พัฒนาการของโลกสมัยใหม่ 3(3-0-6) ปิดวิชา\nTU117 Development of Modern World\nหมวดภาษาต่างประเทศ\nกำหนด บังคับ 2 วิชา\nนักศึกษาเลือกศึกษาภาษาต่างประเทศอื่นเพิ่มเติม 1\nภาษา (2 วิชา 6 หน่วยกิต) วิชาศึกษาทั่วไป\nส่วนที่ 2\nภาษาจีน\nจวอ.260 ภาษาและวัฒนธรรมจีน 3 (3-0-6) ปิดวิชา\nเบื้องต้น\nHIM260 Basic Chinese Language and\nCulture\nจวอ.360 ภาษาและวัฒนธรรมจีน 3 (3-0-6) ปิดวิชา\nระดับกลาง\nIntermediate Chinese Language\nHIM360 and Culture\nจวอ.380 ภาษาและวัฒนธรรมจีน 3 (3-0-6) ปิดวิชา\nระดับสูง\nHIM380 Advanced Chinese Language\nand Culture\nภาษาเกาหลี\nนบ.271 ภาษาและวัฒนธรรมเกาหลี 3(3-0-6) ปิดวิชา\nเบื้องต้น\nSV271 Basic Korean Language and\nCulture\nนบ.272 ภาษาและวัฒนธรรมเกาหลี 3(3-0-6) ปิดวิชา\nระดับกลาง\nSV272 Intermediate Korean Language\nand Culture\nนบ.273 ภาษาและวัฒนธรรมเกาหลี 3(3-0-6) ปิดวิชา\nระดับสูง\nSV273 Advanced Korean Language\nand Culture\n2 หมวดวิชาบังคับ 2 หมวดวิชาบังคับ\nนักศึกษาต้องศึกษารายวิชาในหมวดวิชาบังคับ นักศึกษาต้องศึกษารายวิชาในหมวดวิชาบังคับ\nจำนวน 81 หน่วยกิต ตามรายวิชาที่กำหนดไว้ดังนี้จำนวน 81 หน่วยกิต ตามรายวิชาที่กำหนดไว้ดังนี้\nมคอ. 2 หลักสูตรศิลปศาสตรบัณฑิต สาขาวิชานวัตกรรมการบริการ (หลักสูตรนานาชาติ) หน้า 74 หลักสูตร ฉบบัพ.ศ. 2561 หลักสูตร ฉบบัพ.ศ. 2566 สรุปการ\nเปลี่ยนแปลง\nนบ.180 ซอฟต์แวร์ประยุกต์สำหรับการ 3 (3-0-6) นบ.180 ข้อมูลภาพนิทัศน์ 3 (3-0-6) เป ลี่ย น ชื่อ วิชา และ\nจัดการนวัตกรรมบริการ S V 1 80 Data Visualization คำอธิบายรายวิชา\nSV180 Software Applications for Service\nInnovation Management\nนบ.200 ความรู้เบื้องต้นเกี่ยวกับการ 3 (3-0-6) นบ.200 นวัตกรรมเพื่อการมุ่งเน้น 3 (3-0-6) เป ลี่ย น ชื่อ วิชา และ\nจัดการและนวัตกรรมการบริการ ลูกค้า คำอธิบายรายวิชา\nSV200 Introduction to Service Management SV200 Customer-Focused Innovation\nand Innovation\nนบ.210 เศรษฐศาสตร์สำหรับการจัด 3 (3-0-6) นบ.210 เศรษฐศาสตร์และการวิเคราะห์ 3 (3-0-6) เปลี่ยนชื่อวิชา และ\nการนวัตกรรมการบริการ สภาวะทางธุรกิจสำหรับการจัดการ คำอธิบายรายวิชา\nSV210 Economics for Service Innovation นวัตกรรมการบริการ\nManagement SV210 Economics and Business Conditions\nAnalysis for Service Innovation\nManagement\nนบ.211 การบัญชีสำหรับการจัดการ 3 (3-0-6) นบ.211 บัญชแีละการเงินสำหรับการ 3 (3-0-6) เปลี่ยนชื่อวิชา และ\nนวัตกรรมบริการ จัดการ นวัตกรรมบริการ คำอธิบายรายวิชา\nSV211 Accounting for Service Innovation SV211 Accounting and Finance for Service\nManagement Innovation Management\nนบ.212 การตลาดดิจิทัลสำหรับการจัด 3 (3-0-6) นบ.212 การตลาดดิจิทัลสำหรับการจัด 3 (3-0-6) เปลี่ยนคำอธิบายรายวิชา\nการนวัตกรรมบริการ การนวัตกรรมบริการ\nSV212 Digital Marketing for Service Innovation SV212 Digital Marketing for Service\nManagement Innovation Management\nนบ.213 การบริหารทรัพยากรมนุษย์ 3 (3-0-6) นบ.213 การจัดการทรัพยากรมนุษย์ 3 (3-0-6) เปลี่ยนชื่อวิชา และ\nสำหรับนวัตกรรมการบริการ ระ ห ว่างประเทศ คำอธิบายรายวิชา\nSV213 Human Resources Management for SV213 International Human Resources\nService Innovation Management\nนบ.214 กฎหมายธุรกิจสำหรับการจัดการ 3 (3-0-6) นบ.214 กฎหมายธุรกิจสำหรับการจัดการ 3 (3-0-6) เปลี่ยนคำอธิบายรายวิชา\nนวัตกรรมการบริการ นวัตกรรมการบริการ\nSV214 Business Law for Service Innovation SV214 Business Law for Service Innovation\nManagement Management\nนบ.230 การสื่อสารทางธุรกิจ 3 (3-0-6) เพิ่มรายวิชา\nSV230 Business Communication\nนบ.231 การบริหารการเงินสำหรับ 3 (3-0-6) ปิดวิชา\nนวัตกรรมการบริการ\nSV231 Financial Management for Service\nInnovation\nมคอ. 2 หลักสูตรศิลปศาสตรบัณฑิต สาขาวิชานวัตกรรมการบริการ (หลักสูตรนานาชาติ) หน้า 75 หลักสูตร ฉบบัพ.ศ. 2561 หลักสูตร ฉบบัพ.ศ. 2566 สรุปการ\nเปลี่ยนแปลง\nนบ.232 กลยุทธ์การสร้างแบรนด์และ 3 (3-0-6) เพิ่มรายวิชา\nช่องทางการสื่อสารทางการตลาด\nSV232 Brand and Communication\nManagement for Service Industry\nนบ.241 การบริหารและพัฒนาการ 3 (3-0-6) นบ.241 การจัดการโรงแรมในระดับ 3 (3-0-6) เปลี่ยนชื่อวิชา และ\nโรงแรมระหว่างประเทศ นำ นาชาติคำอธิบายรายวิชา\nSV241 International Hotel Development and SV241 International Hotel Management\nManagement\nนบ.242 การจัดการธุรกิจการประชุม 3 (3-0-6) น บ . 3 6 7 การ จัด งำ น อีเว้น ท์เชิงธุรกิจ 3 (3-0-6) เป ลี่ย น ร หัส ชื่อ วิชา\nSV242 Business Event Management SV367 Business Event Management คำอธิบายรายวิชา และ\nย้ายจากหมวดวิชาบังคบั\nวิชาเลือก\nนบ.243 การจัดการธุรกิจการบิน 3 (3-0-6) น บ . 2 4 3 การ จัด การ ธุร กิจ การบิน 3 (3-0-6) เป ลี่ย น คา อ ธิบา ย รำ ย วิชา\nSV243 Airline Business Management SV243 Airline Business Management\nนบ.244 การบริการด้านการดูแลสุขภาพ 3 (3-0-6) น บ . 2 4 4 การ พัฒ นำ แห ล่งท่องเที่ยว 3 (3-0-6) เปลี่ยนชื่อวิชา และ\nSV244 Healthcare Services เชิงสุขภาวะ คำอธิบายรายวิชา\nSV244 Wellness tourism destination\ndevelopment\nนบ.320 การพัฒนาอย่างรับผิดชอบและ 3 (3-0-6) นบ.320 ความยั่งยืนในอุตสาหกรรม 3 (3-0-6) เปลี่ยนชื่อวิชา และ\nยั่งยืนในอุตสาหกรรมบริการ การบริการ คำอธิบายรายวิชา\nSV320 Responsible and Sustainable SV320 Sustainability in Service Industry\nDevelopment in Service Industry\nนบ.321 สัมมนาเชิงปฏิบัติการเรื่อง 3 (3-0-6) นบ.321 สัมมนาเชิงปฏิบัติการเรื่อง 3 (3-0-6) เปลี่ยนคำอธิบายรายวิชา\nนวัตกรรมและการสร้างสรรค์ น วัต ก รรมและการสร้างสรรค์\nSV321 Innovation and Creativity Workshop SV321 Innovation and Creativity Workshop\nนบ.330 การบริหารข้ามวัฒนธรรม 3 (3-0-6) นบ.330 การบริหารข้ามวัฒนธรรม 3 (3-0-6) เปลี่ยนคำอธิบายรายวิชา\nภายใต้สภาพแวดล้อมระดับโลก ภายใต้สภาพแวดล้อมระดับโลก\nSV330 Cross-Cultural Management in a SV330 Cross-Cultural Management in a\nGlobal Environment Global Environment\nนบ.331 การวางแผนเชิงกลยุทธ์สำหรับ 3 (3-0-6) นบ.331 การวางแผนเชิงกลยุทธ์สำหรับ 3 (3-0-6) เปลี่ยนคำอธิบายรายวิชา\nการจัดการนวัตกรรมการบริการ การจัดการนวัตกรรมการบริการ\nSV331 Strategic Planning for Service SV331 Strategic Planning for Service\nInnovation Management Innovation Management\nนบ.332 การแปรรูปและกลยุทธ์ดิจิทัล 3 (3-0-6) ปิดวิชา\nสำหรับนวัตกรรมการบริการ\nSV332 Digital Strategy and Transformation\nfor Service Innovation\nนบ.333 การบริหารโครงการ 3 (3-0-6) เพิ่มรายวิชา\nSV333 Project Management\nมคอ. 2 หลักสูตรศิลปศาสตรบัณฑิต สาขาวิชานวัตกรรมการบริการ (หลักสูตรนานาชาติ) หน้า 76 หลักสูตร ฉบบัพ.ศ. 2561 หลักสูตร ฉบบัพ.ศ. 2566 สรุปการ\nเปลี่ยนแปลง\nนบ.340 นวัตกรรมและการออกแบบ 3 (3-0-6) เพิ่มรายวิชา\nผลิตภัณฑ์\nSV340 Innovation and Product\nDevelopment Project\nนบ.351 การจัดการอาหารและเครื่องดื่ม 3 (3-0-6) น บ . 3 5 1 การ จัด การ อำ หำ ร และ เครื่องดื่ม 3 (3-0-6) เป ลี่ย น คา อ ธิบา ย รายวิชา\nSV351 Management of Food & Beverage SV351 Management of Food & Beverage\nOperations Operations\nนบ.352 การจัดการกิจกรรมสันทนาการ 3 (3-0-6) นบ.366 การจัดการกิจกรรมกีฬา 3 (3-0-6) เป ลี่ย น ร หัส ชื่อ วิชา\nSV352 Leisure Event Management SV366 Sport Events Management คำอธิบายรายวิชา และ\nย้ายจากหมวดวิชาบังคบั\nวิชาเลือก\nนบ.353 การบริการผู้โดยสารบนเครื่องบิน 3 (3-0-6) ปิดวิชา\nSV353 In-Flight Passenger Services\nนบ.354 การจัดการและกลยุทธ์ทางธุรกิจ 3 (3-0-6) ปิดวิชา\nการดูแลสุขภาพ\nSV354 Healthcare Business Management and\nStrategy\nนบ.430 ระเบียบวิธีวิจัยสำหรับนวัตกรรม 3 (3-0-6) นบ.430 การออกแบบงานวิจัยและ 3 (3-0-6) เปลี่ยนชื่อวิชา และ\nการบริการ ระ เบีย บ วิธีวิจัยสำหรับนวัตกรรมการบริการ คา อ ธิบา ย รำ ย วิชา\nSV430 Research Methodology for Service SV430 Research Designed and Methodology\nInnovation for Service Innovation\nนบ.431 สัมมนาเรื่องการจัดการและ 3 (3-0-6) นบ.431 โครงการที่ปรึกษาทางนวัตกรรม 3 (3-0-6) เป ลี่ย น ชื่อ วิชา\nนวัตกรรมการบริการ การบริการ\nSV431 Service Management and Innovation SV431 Service Innovation Consultancy\nSeminar\nนบ.432 การผู้ประกอบการสมัยใหม่ 3 (3-0-6) นบ.432 ความผู้ประกอบการดิจิทัล 3 (3-0-6) เป ลี่ย น ชื่อ วิชา และ\nสำหรับการจัดการนวัตกรรมการบริการ S V 4 3 2 Digital Entrepreneurship คำอธิบายรายวิชา\nSV432 Modern Entrepreneurship for Service\nInnovation Management\nนบ.434 การลดความเสี่ยงและการฟื้นฟู 3 (3-0-6) นบ.434 การวางแผนฉุกเฉินต่อเนื่องทาง 3 (3-0-6) เปลี่ยนชื่อวิชา และ\nวิกฤติสำหรับอุตสาหกรรมการบริการ คำอธิบายรายวิชา\nธุรกิจสำหรับธุรกิจบริการ\nSV434 Risk Mitigation and Crisis Recovery SV434 Business Continuity Management in\nManagement in Service Industry Service Industry\nนบ.460 การจัดการคุณภาพการบริการ 3 (3-0-6) น บ . 4 6 0 การ จัด การ คุณ ภา พ การบริการ 3 (3-0-6) เป ลี่ย น คา อ ธิบา ย รำ ย วิชา\nSV460 Service Quality Management SV460 Service Quality Management\nนบ.461 การผลิตและปฏิบัติการงานอเีว้นท์ 3 (3-0-6) เพิ่ม รำ ย วิชา\nSV461 Event Production and Operation\nมคอ. 2 หลักสูตรศิลปศาสตรบัณฑิต สาขาวิชานวัตกรรมการบริการ (หลักสูตรนานาชาติ) หน้า 77 หลักสูตร ฉบบัพ.ศ. 2561 หลักสูตร ฉบบัพ.ศ. 2566 สรุปการ\nเปลี่ยนแปลง\nนบ.484 การฝึกงานสำหรับอุตสาหกรรม 3 (3-0-6) นบ.484 การฝึกงานสำหรับอุตสาหกรรม 3 (3-0-6) คงเดิม\nการบริการ การบริการ\nSV484 Internships for Service Industry SV484 Internships for Service Industry\n(270 hrs.) (270 hrs.)\nวิชาเลือก วิชาเลือก 12 หน่วยกิต คงเดิม\nนักศึกษาต้องศึกษารายวิชาในหมวดวิชาเลือกทาง นักศึกษาต้องศึกษารายวิชาในหมวดวิชาเลือก จำนวน\nวิชาชีพ จำนวน 12 หน่วยกิตจากรายวิชาที่กำหนดไว้ 12 หน่วยกิต จากรายวิชาที่กำหนดไว้ดังนี้\nดังนี้\nนบ.336 การบริหารรายได้และผลตอบแทน 3 (3-0-6) น บ .3 3 6 การ บ ริหำ ร รำ ย ได้และผลตอบแทน3 (3-0-6) เป ลี่ย น คา อ ธิบา ย รำ ย วิชา\nSV336 Revenue and Yield Management SV336 Revenue and Yield Management\nนบ.346 การบริหารจัดการธุรกิจนำเที่ยว 3 (3-0-6) น บ .3 4 6 การ อ อ ก แบ บ และบริหารจัดการ 3 (3-0-6) เปลี่ยนชื่อ และคำอธิบาย\nSV346 Introduction to Tour Operations จุดหมายปลายทาง รายวิชา\nManagement SV346 Destination Design and Management\nนบ.355 การท่องเที่ยวและอุตสาหกรรม 3 (3-0-6) นบ.355 การปฏิรูปด้านดิจิทัลใน 3 (3-0-6) เปลี่ยนชื่อ และคำอธิบาย\nการบริการดิจิทัล อุตสาหกรรมการท่องเที่ยวและการบริการ รำ ย วิชา\nSV355 Digital Tourism and Service Industry SV355 Digital Transformation for Tourism\nand Service Industry\nนบ.356 การจัดการกิจกรรมพิเศษ 3 (3-0-6) น บ . 2 6 1 การ จัด การ กิจ ก รรมพิเศษทาง 3 (3-0-6) เปลี่ยนรหัส ชื่อวิชา\nSV356 Special Event Management การตลาด คำอธิบายรายวิชา และ\nSV261 Special Event Management ย้ายจากหมวดวิชาเลือก\nวิชาบังคับ\nนบ.365 นวัตกรรมการบริการสำหรับ 3 (3-0-6) นบ.365 นวัตกรรมสังคมสำหรับการ 3 (3-0-6) เปลี่ยนชื่อ และคำอธิบาย\nภาครัฐ และ องค์การสาธารณะ ให้บริการสาธารณะ รายวิชา\nSV365 Social Innovation for Public Service\nSV365 Service Innovation for Public Sector\nand Public Organizations\nนบ.435 การจัดการห่วงโซ่อุปทาน 3 (3-0-6) น บ . 4 3 5 การจัดการห่วงโซ่อุปทาน 3 (3-0-6) เป ลี่ย น คา อ ธิบายรายวิชา\nสำหรับธุรกิจอาหาร สำหรับธุรกิจอาหาร ภาษาอังกฤษ\nSV435 Supply-Chain Management in Food SV435 Supply-Chain Management in Food\nProduction Process Production Process\nนบ.445 การบริการและการท่องเที่ยว 3 (3-0-6) เพิ่มรายวิชา\nผ่านประสบการณ์\nSV445 Experiential Hospitality and Tourism\nนบ.446 การสำรวจตลาดด้านการบริการ 3 (3-0-6) เพิ่มรายวิชา\nและการท่องเที่ยว\nSV446 Marketing Exploration in Hospitality\nand Tourism\nมคอ. 2 หลักสูตรศิลปศาสตรบัณฑิต สาขาวิชานวัตกรรมการบริการ (หลักสูตรนานาชาติ) หน้า 78 หลักสูตร ฉบบัพ.ศ. 2561 หลักสูตร ฉบบัพ.ศ. 2566 สรุปการ\nเปลี่ยนแปลง\nนบ.455 การผู้ประกอบการธุรกิจ 3 (3-0-6) เพิ่ม รำ ย วิชา\nสุขภาวะ\nSV455 Wellness Business Entrepreneurship\nนบ.456 การวิเคราะห์การแข่งขัน 3 (3-0-6) เพิ่มรายวิชา\nสำหรับธุรกิจลักชูรี่ในตลาดอิ่มตัว (Mature\nmarket) และตลาดเกิดใหม่ (Emerging\nmarket)\nSV456 Competitive Analysis for Luxury\nBusiness in Mature and Emerging\nMarkets\nนบ.457 กลยุทธ์การตลาดและการ 3 (3-0-6) เพิ่มรายวิชา\nสื่อสารลักชูรี่\nSV457 Luxury Marketing and\nCommunication Strategies\nนบ.458 การออกแบบอาหารสำหรับ 3 (3-0-6) เพิ่มรายวิชา\nธุรกิจจัดเลี้ยง\nSV458 Food design for catering services\nนบ.459 นวัตกรรมการบริการเพื่อ 3 (3-0-6) เพิ่มรายวิชา\nสังคมสูงวัย\nSV459 Service Innovation for Silver Aging\nSociety\nนบ.475 ศิลปะการประกอบอาหารผ่าน 3 (3-0-6) เพิ่มรายวิชา\nประสบการณ์\nSV475 Experiential Culinary Arts\nนบ.466 การบริการสำหรับสถาน 3 (3-0-6) ปิดวิชา\nพยาบาลสุขภาพ\nSV466 The Service related Dimension of\nManaging Healthcare Facilities\nนบ.467 การจัดการบุคลากรที่เกี่ยว 3 (3-0-6) ปิดวิชา\nเนื่องกับการดูแลสุขภาพในสังคมสมัยใหม่\nSV467 Managing Healthcare Stakeholders in\nModern Society\nนบ.468 การบริการผู้โดยสารภาคพื้น 3 (3-0-6) ปิดวิชา\nSV468 Ground Passenger Services\nนบ.337 การบริหารคนเก่งภายใต้บริบทโลก3 (3-0-6) ปิดวิชา\nSV337 Talent Management in a Global\nContext\nมคอ. 2 หลักสูตรศิลปศาสตรบัณฑิต สาขาวิชานวัตกรรมการบริการ (หลักสูตรนานาชาติ) หน้า 79 หลักสูตร ฉบบัพ.ศ. 2561 หลักสูตร ฉบบัพ.ศ. 2566 สรุปการ\nเปลี่ยนแปลง\nวิชาเลือกเสรีวิชาเลือกเสรี 9 หน่วยกิต ยกเลิกเงื่อนไขการไม่นับ\nนักศึกษาสามารถเลือกศึกษาวิชาใดก็ได้ที่เปิดสอนใน นักศึกษาสามารถเลือกศึกษาวิชาใดก็ได้ที่เปิดสอนใน วิชา ท.162 ท.163\nมหาวิทยาลัยธรรมศาสตร์วิชาเลือกเสรีหรือเลือก มหาวิทยาลัยธรรมศาสตร์วิชาเลือกเสรีหรือ วิชาเลือกเสรี\nศึกษาจากวิชาที่คณะเปิดสอนจำนวนไม่น้อยกว่า เลือกศึกษาจากวิชาที่คณะเปิดสอนจำนวนไม่น้อย\n6 หน่วยกิต ทั้งนี้ให้หมายรวมถึงวิชาศึกษาทั่วไป หมวด กว่า 9 หน่วยกิต\nภาษาต่างประเทศด้วย นักศึกษาไม่สามารถนำรายวิชาในหลักสูตรวิชาศึกษา\nนักศึกษาไม่สามารถนำวิชาต่อไปนี้มานับวิชาเลือก ทั่วไปที่รหัสระดับ 100 ไปนับวิชาเลือกเสรี\nเสรีได้หรือวิชาเลือกหรือวิชาโท\n• วิชาในหลักสูตรวิชาศึกษาทั่วไปทั้งส่วนที่ 1 และ\nส่วนที่ 2 ที่ใช้รหัสย่อ “มธ.” ระดับ 100 คือ มธ.\n100 - มธ.156\nวิชา ท.162 การเขียนรายงานวิชาการและ ท.163\nการเขียนเพื่อการสื่อสารในองค์กร\nมคอ. 2 หลักสูตรศิลปศาสตรบัณฑิต สาขาวิชานวัตกรรมการบริการ (หลักสูตรนานาชาติ) หน้า 80 ภาคผนวก 3 ตารางเทียบรายวิชาในหลักสูตรศิลปศาสตรบัณฑิต สาขาวิชานวัตกรรมการบริการ\nฉบับปรับปรุง พ.ศ. 2561 กับ ฉบับปรับปรุง พ.ศ. 2566\nรายวิชาในหลักสูตร พ.ศ. 2561 รายวิชาในหลักสูตร พ.ศ. 2566\nรายวิชาที่เทียบได้รายวิชาที่เทียบได้\nนบ.180 ซอฟต์แวร์ประยุกต์สำหรับการจัดการ (3 หน่วยกิต) นบ.180 ข้อมูลภาพนิทัศน์ (3 หน่วยกิต)\nนวัตกรรมบริการ SV180 Data Visualization\nSV180 Software Applications for Service\nInnovation Management\nนบ.200 ความรู้เบื้องต้นเกี่ยวกับการจัดการและ (3 หน่วยกิต) นบ.200 นวัตกรรมเพื่อการมุ่งเน้นลูกค้า (3 หน่วยกิต)\nนวัตกรรมการบริการ SV200 Customer-Focused Innovation\nSV 200 Introduction to Service Management\nand Innovation\nนบ.210 เศรษฐศาสตร์สำหรับการจัดการนวัตกรรม (3 หน่วยกิต) นบ.210 เศรษฐศาสตร์และการวิเคราะห์สภาวะทาง (3 หน่วยกิต)\nการบริการ ธุรกิจสำหรับการจัดการนวัตกรรมการบริการ\nSV210 Economics for Service Innovation SV210 Economics and Business Conditions\nManagement Analysis for Service Innovation Management\nนบ.211 การบัญชีสำหรับการจัดการนวัตกรรมบริการ (3 ห น่ว ย กิต) นบ.211 บัญชีและการเงินสำหรับการจัดการ (3 หน่วยกิต)\nSV211 Accounting for Service Innovation นวัตกรรมการบริการ\nManagement SV211 Accounting and Finance for Service\nInnovation Management\nนบ.212 การตลาดดิจิทัลสำหรับการจัดการนวัตกรรม (3 หน่วยกิต) นบ.212 การตลาดดิจิทัลสำหรับการจัดการ (3 หน่วยกิต)\nบริการ นวัตกรรมบริการ\nSV212 Digital Marketing for Service Innovation SV212 Digital Marketing for Service\nManagement Innovation Management\nนบ.213 การบริหารทรัพยากรมนุษย์สำหรับนวัตกรรม (3 หน่วยกิต) นบ.213 การจัดการทรัพยากรมนุษย์ระหว่างประเทศ (3 หน่วยกิต)\nการบริการ SV213 International Human Resources\nSV213 Human Resources Management for Management\nService Innovation\nนบ.214 กฎหมายธุรกิจสำหรับการจัดการนวัตกรรม (3 หน่วยกิต) นบ.214 กฎหมายธุรกิจสำหรับการจัดการนวัตกรรม (3 หน่วยกิต)\nการบริการ การบริการ\nSV214 Business Law for Service Innovation SV214 Business Law for Service Innovation\nManagement Management\nนบ.241 การบริหารและพัฒนาการโรงแรมระหว่าง (3 หน่วยกิต) นบ.241 การจัดการโรงแรมในระดับนานาชาติ (3 หน่วยกิต)\nประเทศ SV241 International Hotel Management\nSV241 International Hotel Development and\nManagement\nนบ.242 การจัดการธุรกิจการประชุม (3 ห น่ว ย กิต) นบ.367 การจัดงานอีเว้นท์เชิงธุรกิจ (3 หน่วยกิต)\nSV242 Business Event Management SV367 Business Event Management\nมคอ. 2 หลักสูตรศิลปศาสตรบัณฑิต สาขาวิชานวัตกรรมการบริการ (หลักสูตรนานาชาติ) หน้า 81 รายวิชาในหลักสูตร พ.ศ. 2561 รายวิชาในหลักสูตร พ.ศ. 2566\nนบ.243 การจัดการธุรกิจการบิน (3 ห น่ว ย กิต) น บ.243 การจัดการธุรกิจการบิน (3 หน่วยกิต)\nSV243 Airline Business Management SV243 Airline Business Management\nนบ.244 การบริการด้านการดูแลสุขภาพ (3 ห น่ว ย กิต) นบ.244 การพัฒนาแหล่งท่องเที่ยวเชิงสุขภาวะ (3 ห น่ว ย กิต)\nSV244 Healthcare Services SV244 Wellness tourism destination\ndevelopment\nนบ.356 การจัดการกิจกรรมพิเศษ (3 ห น่ว ย กิต) นบ.261 การจัดการกิจกรรมพิเศษทางการตลาด (3 หน่วยกิต)\nSV356 Special Event Management SV261 Special Event Management\nนบ.320 การพัฒนาอย่างรับผิดชอบและยั่งยืนใน (3 หน่วยกิต) นบ.320 ความยั่งยืนในอุตสาหกรรมการบริการ (3 ห น่ว ย กิต)\nอุตสาหกรรมบริการ SV320 Sustainability in Service Industry\nSV320 Responsible and Sustainable\nDevelopment in Service Industry\nนบ.321 สัมมนาเชิงปฏิบัติการเรื่องนวัตกรรมและการ (3 หน่วยกิต) นบ.321 สัมมนาเชิงปฏิบัติการเรื่องนวัตกรรมและ (3 หน่วยกิต)\nสร้างสรรค์ การสร้างสรรค์\nSV321 Innovation and Creativity Workshop SV321 Innovation and Creativity Workshop\nนบ.330 การบริหารข้ามวัฒนธรรมภายใต้ (3 หน่วยกิต) นบ.330 การบริหารข้ามวัฒนธรรมภายใต้ (3 หน่วยกิต)\nสภาพแวดล้อมระดับโลก สภาพแวดล้อมระดับโลก\nSV330 Cross-Cultural Management in a Global SV330 Cross-Cultural Management in a\nEnvironment Global Environment\nนบ.331 การวางแผนเชิงกลยุทธ์สำหรับการจัดการ (3 หน่วยกิต) นบ.331 การวางแผนเชิงกลยุทธ์สำหรับการจัดการ (3 หน่วยกิต)\nนวัตกรรมการบริการ นวัตกรรมการบริการ\nSV331 Strategic Planning for Service SV331 Strategic Planning for Service\nInnovation Management Innovation Management\nนบ.336 การบริหารรายได้และผลตอบแทน (3 ห น่ว ย กิต) นบ.336 การบริหารรายได้และผลตอบแทน (3 ห น่ว ย กิต)\nSV336 Revenue and Yield Management SV336 Revenue and Yield Management\nนบ.346 การบริหารจัดการธุรกิจนำเที่ยว (3 ห น่ว ย กิต) นบ.346 การออกแบบและบริหารจัดการจุดหมาย (3 หน่วยกิต)\nSV346 Introduction to Tour Operations ปลายทาง\nManagement SV346 Destination Design and Management\nนบ.351 การจัดการอาหารและเครื่องดื่ม (3 ห น่ว ย กิต) นบ.351 การจัดการอาหารและเครื่องดื่ม (3 ห น่ว ย กิต)\nSV351 Management of Food & Beverage SV351 Management of Food & Beverage\nOperations Operations\nนบ.355 การท่องเที่ยวและอุตสาหกรรมการบริการ (3 หน่วยกิต) นบ.355 การปฏิรูปด้านดิจิทัลในอุตสาหกรรมการ (3 หน่วยกิต)\nดิจิทัล ท่องเที่ยวและการบริการ\nSV355 Digital Tourism and Service Industry SV355 Digital Transformation for Tourism\nand Service Industry\nนบ.365 นวัตกรรมการบริการสำหรับภาครัฐ และ (3 หน่วยกิต) นบ.365 นวัตกรรมสังคมสำหรับการให้บริการ (3 หน่วยกิต)\nองค์การสาธารณะ สาธารณะ\nSV365 Service Innovation for Public Sector SV365 Social Innovation for Public Service\nand Public Organizations\nมคอ. 2 หลักสูตรศิลปศาสตรบัณฑิต สาขาวิชานวัตกรรมการบริการ (หลักสูตรนานาชาติ) หน้า 82 รายวิชาในหลักสูตร พ.ศ. 2561 รายวิชาในหลักสูตร พ.ศ. 2566\nนบ.430 ระเบียบวิธีวิจัยสำหรับนวัตกรรมการบริการ (3 ห น่ว ย กิต) นบ.430 การออกแบบงานวิจัยและระเบียบวิธีวิจัย (3 หน่วยกิต)\nSV430 Research Methodology for Service สำหรับนวัตกรรมการบริการ\nInnovation SV430 Research Design and Methodology for\nService Innovation\nนบ.431 สัมมนาเรื่องการจัดการและนวัตกรรมการ (3 หน่วยกิต) นบ.431โครงการที่ปรึกษาทางนวัตกรรมการบริการ (3 ห น่ว ย กิต)\nบริการ SV431 Service Innovation Consultancy\nSV431 Service Management and Innovation\nSeminar\nนบ.432 การผู้ประกอบการสมัยใหม่สำหรับการ (3 หน่วยกิต) นบ.432 ความผู้ประกอบการดิจิทัล (3 หน่วยกิต)\nจัดการนวัตกรรมการบริการ SV432 Digital Entrepreneurship\nSV432 Modern Entrepreneurship for Service\nInnovation Management\nนบ.434 การลดความเสี่ยงและการฟื้นฟูวิกฤติสำหรับ (3 หน่วยกิต) นบ.434 การวางแผนฉุกเฉินต่อเนื่องทางธุรกิจสำหรับ (3 หน่วยกิต)\nอุตสาหกรรมการบริการ\nธุรกิจบริการ\nSV434 Risk Mitigation and Crisis Recovery SV434 Business Continuity Management in\nManagement in Service Industry Service Industry\nนบ.435 การจัดการห่วงโซ่อุปทานสำหรับธุรกิจอาหาร (3 ห น่ว ย กิต) นบ.435 การจัดการห่วงโซ่อุปทานสำหรับธุรกิจ (3 หน่วยกิต)\nSV435 Supply-Chain Management in Food อาหาร\nSV435 Supply-Chain Management in Food\nProduction Process\nProduction Process\nนบ.460 การจัดการคุณภาพการบริการ (3 ห น่ว ย กิต) นบ.460 การจัดการคุณภาพการบริการ (3 ห น่ว ย กิต)\nSV460 Service Quality Management SV460 Service Quality Management\nนบ.484 การฝึกงานสำหรับอุตสาหกรรมการบริการ (3 ห น่ว ย กิต) นบ.484 การฝึกงานสำหรับอุตสาหกรรมการบริการ (3 ห น่ว ย กิต)\nSV484 Internships for Service Industry SV484 Internships for Service Industry\n(270 hrs.) (270 hrs.)\nรายวิชาที่เทียบไม่ได้\nนบ.231 การบริหารการเงินสำหรับนวัตกรรมการ (3 หน่วยกิต) นบ.230 การสื่อสารทางธุรกิจ (3 หน่วยกิต)\nบริการ SV230 Business Communication\nSV231 Financial Management for Service\nInnovation\nนบ.332 การแปรรูปและกลยุทธ์ดิจิทัลสำหรับ (3 หน่วยกิต) นบ.232 กลยุทธ์การสร้างแบรนด์และช่องทางการ (3 หน่วยกิต)\nนวัตกรรมการบริการ สื่อสารทางการตลาด\nSV332 Digital Strategy and Transformation for SV232 Brand and Communication\nService Innovation Management for Service Industry\nนบ.352 การจัดการกิจกรรมสันทนาการ (3 หน่วยกิต) นบ.333 การบริหารโครงการ (3 หน่วยกิต)\nSV352 Leisure Event Management SV333 Project Management\nนบ.353 การบริการผู้โดยสารบนเครื่องบิน (3 หน่วยกิต) นบ.340 นวัตกรรมและการออกแบบผลิตภัณฑ์ (3 ห น่ว ย กิต)\nSV353 In-Flight Passenger Management SV340 Innovation and Product\nDevelopment Project\nมคอ. 2 หลักสูตรศิลปศาสตรบัณฑิต สาขาวิชานวัตกรรมการบริการ (หลักสูตรนานาชาติ) หน้า 83 รายวิชาในหลักสูตร พ.ศ. 2561 รายวิชาในหลักสูตร พ.ศ. 2566\nนบ.354 การจัดการและกลยุทธ์ทางธุรกิจการดูแล (3 หน่วยกิต) นบ.445 การบริการและการท่องเที่ยว (3 หน่วยกิต)\nสุขภาพ ผ่านประสบการณ์\nSV354 Healthcare Business Management and SV445 Experiential Hospitality and Tourism\nStrategy\nนบ.466 การบริการสำหรับสถานพยาบาลสุขภาพ (3 หน่วยกิต) นบ.446 การสำรวจตลาดด้านการบริการและการ (3 หน่วยกิต)\nSV466 The Service related Dimension of ท่องเที่ยว\nManaging Healthcare Facilities SV446 Marketing Exploration in Hospitality\nand Tourism\nนบ.467 การจัดการบุคลากรที่เกี่ยวเนื่องกับการดูแล (3 หน่วยกิต) นบ.455 การผู้ประกอบการธุรกิจสุขภาวะ (3 ห น่ว ย กิต)\nสุขภาพในสังคม SV455 Wellness Business Entrepreneurship\nSV467 Manageing Healthcare Stakeholders in\nModern Society\nนบ.468 การบริการผู้โดยสารภาคพื้น (3 ห น่ว ย กิต) นบ.456 การวิเคราะห์การแข่งขัน สำหรับธุรกิจลัก (3 หน่วยกิต)\nSV468 Ground Passenger Services ชูรี่ในตลาดอิ่มตัว (Mature market) และตลาดเกิด\nใหม่ (Emerging market)\nSV456 Competitive Analysis for Luxury\nBusiness in Mature and Emerging Markets\nนบ.337 การบริหารคนเก่งภายใต้บริบทโลก (3 หน่วยกิต) นบ.457 กลยุทธ์การตลาดและการสื่อสารลักชูรี่ (3 ห น่ว ย กิต)\nSV337 Talent Management in a Global SV457 Luxury Marketing and Communication\nContext Strategies\nนบ.458 การออกแบบอาหารสำหรับธุรกิจจัดเลี้ยง (3 ห น่ว ย กิต)\nSV458 Food design for catering services\nนบ.459 นวัตกรรมการบริการเพื่อสังคมสูงวัย (3 หน่วยกิต)\nSV459 Service Innovation for Silver Aging\nSociety\nนบ.461 การผลิตและปฏิบัติการงานอีเว้นท์ (3 ห น่ว ย กิต)\nSV461 Event Production and Operation\nนบ.475 ศิลปะการประกอบอาหารผ่าน (3 หน่วยกิต)\nประสบการณ์\nSV475 Experiential Culinary Arts\nหมายเหตุ ในกรณีหลักสูตรเดิมรายวิชานั้น ๆ หน่วยกิต ต่ำกว่ารายวิชาในหลักสูตรใหม่สามารถเทียบรายวิชา\nที่หน่วยกิตที่น้อยกว่าไปหน่วยกิตที่มากกว่าได้ เช่น รายวิชาเดิม จำนวน 2 หน่วยกิต สามารถเทียบรายวิชากับ\nหลักสูตรใหม่ 3 หน่วยกิต ต้น\nมคอ. 2 หลักสูตรศิลปศาสตรบัณฑิต สาขาวิชานวัตกรรมการบริการ (หลักสูตรนานาชาติ) หน้า 84 ภาคผนวก 4 ความสอดคล้องของผลลัพธ์การเรียนรู้ และการออกแบบหลักสูตร\nวิชาศึกษาทั่วไป\nผลลัพธ์การเรียนรู้ของหลักสูตร (PLOs)\nรายวิชา\nลักษณะส่วน\nความรู้ทักษะ จริยธรรม\nวิชาศึกษาทั่วไป (30 หน่วยกิต) บุคคล\n1 2 3 4 1 2 3 4 5 6 1 2 1 2 3\nวิชาศึกษาทั่วไป (30 หน่วยกิต)\nสผ.165 เศรษฐกิจสร้างมูลค่า\n✓ - - - - ✓ ✓ - ✓ - ✓ - - ✓ ✓\nAP165 Value Creation Economy\nมธ.109 นวัตกรรมกับกระบวนคิดผู้ประกอบการ\n- ✓ ✓ ✓ ✓ ✓ ✓ ✓ ✓ ✓ ✓ ✓ - ✓ ✓\nTU109 Innovation and Entrepreneurial Mindset\nปด.102 สังคมศาสตร์ในศตวรรษที่ 21\n✓ ✓ - - - - ✓ ✓ - ✓ ✓ - - ✓ ✓\nPD102 Social Sciences in the 21st Century\nศศ.101 การคิด อ่าน และเขยีนอย่างมีวิจารณญาณ\n✓ ✓ - - ✓ - ✓ ✓ ✓ - - ✓ ✓\nLAS101 Critical Thinking, Reading, and Writing\nมธ.106 ความคิดสร้างสรรค์และการสื่อสาร\n✓ ✓ ✓ ✓ ✓ - ✓ ✓ ✓ ✓ - ✓ - ✓ ✓\nTU106 Creativity and Communication\nปด.103 มนุษย์ศาสตร์ในยุคแห่งการผันผวน\n✓ - - - ✓ - ✓ - - ✓ - ✓ - ✓ ✓\nPD103 Humanities in the Age of Disruption\nปด.104 เส้นทางสู่ความสมัยใหม่และโลกาภิวัตน์\n✓ - - - ✓ - ✓ - - ✓ ✓ - - ✓ -\nPD104 The Path to Modernity and Globalization\nจน.171 ภาษาจีน 1\n✓ ✓ ✓ ✓ ✓ ✓ ✓ ✓ ✓ ✓ - ✓ - ✓ ✓\nCH171 Chinese 1\nจน.172 ภาษาจีน 2\n✓ ✓ ✓ ✓ ✓ ✓ ✓ ✓ ✓ ✓ - ✓ - ✓ ✓\nCH172 Chinese 2\nมคอ. 2 หลักสูตรศิลปศาสตรบัณฑิต สาขาวิชานวัตกรรมการบริการ (หลักสูตรนานาชาติ) หน้า 85 ผลลัพธ์การเรียนรู้ของหลักสูตร (PLOs)\nรายวิชา\nลักษณะส่วน\nความรู้ทักษะ จริยธรรม\nวิชาศึกษาทั่วไป (30 หน่วยกิต) บุคคล\n1 2 3 4 1 2 3 4 5 6 1 2 1 2 3\nอซ.171 ภาษาเกาหลี1\n✓ ✓ ✓ ✓ ✓ ✓ ✓ ✓ ✓ ✓ ✓ ✓ ✓ ✓ ✓\nAS171 Korean 1\nอซ.172 ภาษาเกาหลี2\n✓ ✓ ✓ ✓ ✓ ✓ ✓ ✓ ✓ ✓ ✓ ✓ ✓ ✓ ✓\nAS172 Korean 2\nสษ.105 ทักษะการสื่อสารทางภาษาอังกฤษ\n✓ - ✓ ✓ ✓ - - ✓ ✓ ✓ - ✓ - - -\nEL105 English Communication Skills\nมธ.103 ชีวิตกับความยั่งยืน\n✓ ✓ - ✓ ✓ ✓ - - ✓ ✓ - ✓ - ✓ -\nTU103 Life and Sustainability\nมธ.107 ทักษะดิจิทัลกับการแก้ปัญหา\n✓ ✓ ✓ ✓ ✓ ✓ ✓ ✓ ✓ - ✓ ✓ - ✓ -\nTU107 Digital Skill and Problem Solving\nมธ.108 การพัฒนาและจัดการตนเอง\n✓ ✓ ✓ ✓ - ✓ ✓ ✓ ✓ ✓ ✓ ✓ ✓ ✓ ✓\nTU108 Self Development and Management\nมธ.100 พลเมืองกับการลงมือแก้ปัญหา\n✓ ✓ ✓ ✓ ✓ ✓ ✓ ✓ ✓ - ✓ ✓ ✓ ✓ ✓\nTU100 Civic Engagement\nมคอ. 2 หลักสูตรศิลปศาสตรบัณฑิต สาขาวิชานวัตกรรมการบริการ (หลักสูตรนานาชาติ) หน้า 86 วิชาเฉพาะ จำนวน 93 หน่วยกิต\nผลลัพธ์การเรียนรู้ของหลักสูตร (PLOs)\nรายวิชา\nลักษณะส่วน\nวิชาเฉพาะ จำนวน 93 หน่วยกิต ความรู้ทักษะ จริยธรรม\nบุคคล\n1 2 3 4 1 2 3 4 5 6 1 2 1 2 3\nวิชาบังคับ (81 หน่วยกิต)\nนบ.180 ข้อมูลภาพนิทัศน์\n✓ ✓ ✓ - ✓ - - ✓ ✓ ✓ ✓ ✓ ✓ ✓ ✓\nSV180 Data Visualization\nนบ.200 นวัตกรรมเพื่อการมุ่งเน้นลูกค้า\n✓ ✓ ✓ - ✓ - ✓ ✓ - ✓ ✓ ✓ ✓ ✓ ✓\nSV 200 Customer-Focused Innovation\nเศรษฐศาสตร์และการวิเคราะห์สภาวะทางธุรกิจสำหรับการจัดการนวัตกรรม\nนบ.210\nการบริการ\n- - - ✓ - ✓ - ✓ ✓ ✓ ✓ ✓ ✓ - -\nEconomics and Business Conditions Analysis for Service Innovation\nSV210\nManagement\nนบ.211 บัญชีและการเงินสำหรับการจัดการนวัตกรรมการบริการ\n- - - ✓ - ✓ - ✓ ✓ ✓ ✓ ✓ ✓ - -\nSV211 Accounting and Finance for Service Innovation Management\nนบ.212 การตลาดดิจิทัลสำหรับการจัดการนวัตกรรมบริการ\n✓ ✓ ✓ - ✓ - - ✓ ✓ ✓ ✓ ✓ ✓ ✓ ✓\nSV212 Digital Marketing for Service Innovation Management\nนบ.213 การจัดการทรัพยากรมนุษย์ระหว่างประเทศ\n- - ✓ - - - ✓ - - ✓ ✓ ✓ ✓ ✓ ✓\nSV213 International Human Resources Management\nนบ.214 กฎหมายธุรกิจสำหรับการจัดการนวัตกรรมการบริการ\n✓ ✓ - - ✓ - - ✓ - ✓ ✓ ✓ ✓ - ✓\nSV214 Business Law for Service Innovation Management\nนบ.230 การสื่อสารทางธุรกิจ\n✓ ✓ ✓ - ✓ - - ✓ - ✓ - ✓ - ✓ ✓\nSV230 Business Communication\nนบ.232 กลยุทธก์ารสร้างแบรนด์และชอ่งทางการสื่อสารทางการตลาด ✓ ✓ ✓ - ✓ - ✓ - ✓ ✓ ✓ ✓ ✓ ✓\nมคอ. 2 หลักสูตรศิลปศาสตรบัณฑิต สาขาวิชานวัตกรรมการบริการ (หลักสูตรนานาชาติ) หน้า 87 ผลลัพธ์การเรียนรู้ของหลักสูตร (PLOs)\nรายวิชา\nลักษณะส่วน\nวิชาเฉพาะ จำนวน 93 หน่วยกิต ความรู้ทักษะ จริยธรรม\nบุคคล\n1 2 3 4 1 2 3 4 5 6 1 2 1 2 3\nSV232 Brand and Communication Management for Service Industry\nนบ.241 การจัดการโรงแรมในระดับนานาชาติ\n✓ - ✓ - - - ✓ - - ✓ ✓ ✓ ✓ ✓ ✓\nSV241 International Hotel Management\nนบ.243 การจัดการธุรกิจการบิน\n✓ - ✓ - - - ✓ - - ✓ ✓ ✓ ✓ ✓ ✓\nSV243 Airline Business Management\nนบ.244 การพัฒนาแหล่งท่องเที่ยวเชิงสุขภาวะ\n✓ ✓ ✓ - ✓ ✓ ✓ - - - ✓ ✓ - - ✓\nSV244 Wellness tourism destination development\nนบ.261 การจัดการกิจกรรมพิเศษทางการตลาด\n✓ - ✓ - ✓ ✓ ✓ - - ✓ ✓ ✓ ✓ ✓ ✓\nSV261 Special Event Management\nนบ.320 ความยั่งยืนในอุตสาหกรรมการบริการ\n✓ ✓ - ✓ ✓ - - - ✓ ✓ ✓ - - ✓\nSV320 Sustainability in Service Industry\nนบ.321 สัมมนาเชิงปฏิบัติการเรื่องนวัตกรรมและการสร้างสรรค์\n✓ - ✓ - ✓ ✓ ✓ - - ✓ ✓ ✓ ✓ ✓ ✓\nSV321 Innovation and Creativity Workshop\nนบ.330 การบริหารข้ามวัฒนธรรมภายใต้สภาพแวดล้อมระดับโลก\n✓ ✓ ✓ ✓ - ✓ - ✓ - ✓ - ✓ ✓ ✓ ✓\nSV330 Cross-Cultural Management in a Global Environment\nนบ.331 การวางแผนเชิงกลยุทธ์สำหรับการจัดการนวัตกรรมการบรกิาร\n✓ ✓ ✓ - - ✓ ✓ ✓ ✓ ✓ - - - - ✓\nSV331 Strategic Planning for Service Innovation Management\nนบ.333 การบริหารโครงการ\n✓ ✓ ✓ - ✓ - - - ✓ ✓ ✓ ✓ ✓ ✓ ✓\nSV333 Project Management\nนบ.340 นวัตกรรมและการออกแบบผลิตภัณฑ์\n- ✓ - ✓ ✓ ✓ - - - ✓ ✓ ✓ ✓ ✓ ✓\nSV340 Innovation and Product Development Project\nมคอ. 2 หลักสูตรศิลปศาสตรบัณฑิต สาขาวิชานวัตกรรมการบริการ (หลักสูตรนานาชาติ) หน้า 88 ผลลัพธ์การเรียนรู้ของหลักสูตร (PLOs)\nรายวิชา\nลักษณะส่วน\nวิชาเฉพาะ จำนวน 93 หน่วยกิต ความรู้ทักษะ จริยธรรม\nบุคคล\n1 2 3 4 1 2 3 4 5 6 1 2 1 2 3\nนบ.351 การจัดการด้านอาหารและเครื่องดื่ม\n✓ - ✓ - ✓ ✓ ✓ - - ✓ ✓ ✓ ✓ ✓ ✓\nSV351 Management of Food & Beverage Operations\nนบ.430 การออกแบบงานวิจยั และระเบยีบวธิีวจิยัสำหรับนวัตกรรมการบริการ\n✓ ✓ ✓ ✓ - ✓ ✓ ✓ ✓ ✓ - - - - -\nSV430 Research Design and Methodology for Service Innovation\nนบ.431 โครงการที่ปรึกษาทางนวัตกรรมการบรกิาร\n- ✓ ✓ ✓ ✓ ✓ - ✓ - ✓ ✓ ✓ ✓ - ✓\nSV431 Service Innovation Consultancy\nนบ.432 ความผู้ประกอบการดิจิทัล\n- ✓ ✓ ✓ ✓ ✓ ✓ ✓ ✓ ✓ ✓ ✓ ✓ - ✓\nSV432 Digital Entrepreneurship\nนบ.434 การวางแผนฉุกเฉินต่อเนื่องทางธุรกิจสำหรับธุรกิจบริการ\n✓ ✓ ✓ - ✓ - - - ✓ - ✓ - - - ✓\nSV434 Business Continuity Management in Service Industry\nนบ.460 การจัดการคุณภาพการบริการ ✓ ✓ ✓ ✓ ✓ ✓ - - - ✓ ✓ - -\n✓\nSV460 Service Quality Management\nนบ.461 การผลิตและการปฏิบัตกิารงานอีเว้นท์ ✓ ✓ ✓ - - ✓ ✓ ✓ ✓ ✓ ✓\n✓ - ✓\nSV461 Event production and operation\nนบ.484 การฝึกงานสำหรับอุตสาหกรรมการบริการ - - - ✓ ✓ - - ✓ ✓ ✓ ✓\n✓ - -\nSV484 Internships for Service Industry (270 hrs.)\nวิชาเลือก (12 หน่วยกิต)\nนบ.336 การบริหารรายได้และผลตอบแทน\n- - - ✓ - ✓ - ✓ ✓ ✓ ✓ ✓ ✓ - -\nSV336 Revenue and Yield Management\nนบ.346 การออกแบบและบริหารจัดการจุดหมายปลายทาง\n✓ ✓ ✓ - ✓ ✓ ✓ - - - ✓ ✓ - - ✓\nSV346 Destination Design and Management\nมคอ. 2 หลักสูตรศิลปศาสตรบัณฑิต สาขาวิชานวัตกรรมการบริการ (หลักสูตรนานาชาติ) หน้า 89 ผลลัพธ์การเรียนรู้ของหลักสูตร (PLOs)\nรายวิชา\nลักษณะส่วน\nวิชาเฉพาะ จำนวน 93 หน่วยกิต ความรู้ทักษะ จริยธรรม\nบุคคล\n1 2 3 4 1 2 3 4 5 6 1 2 1 2 3\nนบ.355 การปฏิรูปด้านดิจิทัลในอุตสาหกรรมการท่องเที่ยวและการบริการ\n✓ ✓ - - ✓ ✓ - ✓ - - ✓ - - - ✓\nSV355 Digital Transformation for Tourism and Service Industry\nนบ.365 นวัตกรรมสังคมสำหรับการให้บริการสาธารณะ\n✓ - - ✓ ✓ ✓ - ✓ - - ✓ ✓ ✓ - ✓\nSV365 Social Innovation for Public Service\nนบ.366 การจัดการกิจกรรมกีฬา\n✓ - ✓ ✓ ✓ ✓ - - ✓ ✓ ✓ ✓ ✓ ✓\nSV366 Sport Events Management\nนบ.367 การจัดการอีเว้นท์เชิงธุรกิจ\n✓ - ✓ ✓ ✓ ✓ - - ✓ ✓ ✓ ✓ ✓ ✓\nSV367 Business Event Management\nนบ.435 การจัดการห่วงโซ่อุปทานสำหรับธุรกิจอาหาร\n✓ - ✓ ✓ ✓ - - ✓ ✓ ✓ - ✓ ✓\nSV435 Supply-Chain Management in Food Production Process\nนบ.445 การบริการและการทอ่งเที่ยวผ่านประสบการณ์\n✓ ✓ ✓ - ✓ - ✓ ✓ - ✓ ✓ ✓ ✓ ✓ ✓\nSV445 Experiential Hospitality and Tourism\nนบ.446 การสำรวจตลาดด้านการบริการและการท่องเที่ยว\n✓ ✓ ✓ - ✓ - - ✓ ✓ ✓ ✓ ✓ ✓ ✓ ✓\nSV446 Marketing Exploration in Hospitality and Tourism\nนบ.455 การผู้ประกอบการธุรกิจสุขภาวะ\n✓ ✓ ✓ ✓ ✓ ✓ - - - ✓ ✓ - ✓\nSV455 Wellness Business Entrepreneurship\nการวิเคราะหก์ารแข่งขันสำหรับธุรกจิลกัชูรี่ในตลาดอิ่มตัว (Mature market)\nนบ.456\nและตลาดเกิดใหม่ (Emerging Market)\n✓ - ✓ - ✓ ✓ ✓ - - ✓ ✓ ✓ ✓ ✓ ✓\nCompetitive Analysis for Luxury Business in Mature and Emerging\nSV456\nMarkets\nนบ.457 กลยุทธก์ารตลาดและการสื่อสารลักชูรี่\n✓ ✓ ✓ - ✓ - - - - ✓ - ✓ - ✓ ✓\nSV457 Luxury Marketing and Communication Strategies\nมคอ. 2 หลักสูตรศิลปศาสตรบัณฑิต สาขาวิชานวัตกรรมการบริการ (หลักสูตรนานาชาติ) หน้า 90 ผลลัพธ์การเรียนรู้ของหลักสูตร (PLOs)\nรายวิชา\nลักษณะส่วน\nวิชาเฉพาะ จำนวน 93 หน่วยกิต ความรู้ทักษะ จริยธรรม\nบุคคล\n1 2 3 4 1 2 3 4 5 6 1 2 1 2 3\nนบ.458 การออกแบบอาหารสำหรับธุรกิจจัดเลี้ยง\n✓ - ✓ - ✓ ✓ ✓ - - ✓ ✓ ✓ ✓ ✓ ✓\nSV458 Food Design for Catering Services\nนบ.459 นวัตกรรมการบริการเพื่อสังคมสูงวัย\n✓ - ✓ - ✓ - ✓ - - ✓ ✓ ✓ - ✓ ✓\nSV459 Service Innovation for Silver Aging Society\nนบ.475 ศิลปะการประกอบอาหารผ่านประสบการณ์\n✓ - ✓ - ✓ ✓ ✓ - - ✓ ✓ ✓ ✓ ✓ ✓\nSV475 Experiential Culinary Arts\nมคอ. 2 หลักสูตรศิลปศาสตรบัณฑิต สาขาวิชานวัตกรรมการบริการ (หลักสูตรนานาชาติ) หน้า 91 ภาคผนวก 5 แนบสำเนาเอกสารต่อไปนี้\n1. คำสั่งแต่งตั้งคณะกรรมการพัฒนาหลักสูตร หรือ ปรับปรุงหลักสูตร\n2. เอกสาร MOU กรณีที่มีการลงนามกับมหาวิทยาลัยคู่สัญญา\n3. สัญญาจ้างมีระยะเวลาไม่ต่ำกว่า 9 เดือน กรณีที่มีอาจารย์ต่างชาติหรืออาจารย์\nเกษียณอายุราชการ อาจารย์ผู้รับผิดชอบหลักสูตรหรืออาจารย์ประจำหลักสูตร\n4. ข้อบังคับมหาวิทยาลัยธรรมศาสตร์ ว่าด้วยการศึกษาระดับปริญญาตรีพ.ศ. 2561\n5. ข้อบังคับมหาวิทยาลัยธรรมศาสตร์ ว่าด้วยวินัยนักศึกษา พ.ศ. 2564\n6. ประกาศมหาวิทยาลัยธรรมศาสตร์ เรื่อง การลงทะเบียนเรียนรายวิชาข้ามหลักสูตร\nพ.ศ. 2560\n7. ประกาศมหาวิทยาลัยธรรมศาสตร์ เรื่อง การลงทะเบียนเรียนรายวิชาข้าม\nสถาบันอุดมศึกษา พ.ศ. 2560\nหมายเหตุ เอกสารหัวข้อนี้ให้ใส่ในเล่มเอกสารหลักสูตรฉบับที่จะเสนอสภามหาวิทยาลัยและ สป.อว.\nส่วนฉบับร่างที่เสนอคณะกรรมการนโยบายวิชาการ ยังไม่ต้องใส่\nมคอ. 2 หลักสูตรศิลปศาสตรบัณฑิต สาขาวิชานวัตกรรมการบริการ (หลักสูตรนานาชาติ) หน้า 92"
}