{
    "หมวดที่ 1": "รายละเอียดของหลักสตู ร\nหลักสูตรศิลปศาสตรบัณฑิต\nสาขาวิชาการจัดการมรดกวัฒนธรรมและอุตสาหกรรมสร้างสรรค์\n(หลักสูตรพหุวิทยาการ / หลักสูตรปรับปรุง พ.ศ.2566)\nชื่อสถาบันอุดมศึกษา มหาวิทยาลัยธรรมศาสตร์\nคณะ/วิทยาลัย/สถาบัน วิทยาลัยนวัตกรรม\nหมวดที่ 1 ข้อมูลทวั่ ไป\n1.1 รหัสและชื่อหลักสูตร\nรหัสหลักสูตร : 25570051102416\nชื่อหลักสูตร\nภาษาไทย : หลักสูตรศิลปศาสตรบัณฑิต สาขาวิชาการจัดการมรดกวัฒนธรรมและ\nอุตสาหกรรมสร้างสรรค์ (หลักสูตรพหุวิทยาการ)\nภาษาอังกฤษ : Bachelor of Arts Program in Management of Cultural Heritage and\nCreative Industries (Multidisciplinary)\n1.2 ชื่อปริญญาและสาขาวิชา\nภาษาไทย ชื่อเต็ม: ศิลปศาสตรบัณฑิต (การจัดการมรดกวัฒนธรรมและอุตสาหกรรม\nสร้างสรรค์)\nชื่อย่อ: ศศ.บ. (การจัดการมรดกวัฒนธรรมและอุตสาหกรรมสร้างสรรค์\nภาษาอังกฤษ ชื่อเต็ม: Bachelor of Arts (Management of Cultural Heritage and\nCreative Industries)\nชื่อย่อ: B.A. (Management of Cultural Heritage and Creative\nIndustries)\n- ไม่มี -\n1.3 วิชาเอก\n1.4 รูปแบบของหลักสูตร\n1.4.1 รูปแบบ\n\n<exclude> หลักสูตรระดับปริญญาตรี (ต่อเนื่อง)</exclude>\n\n<include> หลักสูตรระดับปริญญาตรี 4 ปี</include>\n\n<exclude> หลักสูตรระดับปริญญาตรี 5 ปี</exclude>\n\n<exclude> หลักสูตรระดับปริญญาตรี 6 ปี</exclude>\nมคอ. 2 หลักสูตรศิลปศาสตรบัณฑิต สาขาวิชาการจัดการมรดกวัฒนธรรมและอตุ สาหกรรมสร้างสรรค์ หน้า 1 1.4.2 ประเภทของหลักสูตร\n\n<include> หลักสูตรปริญญาตรีทางวิชาการ</include>\n\n<exclude> หลักสูตรปริญญาตรีแบบก้าวหน้าทางวิชาการ</exclude>\n\n<exclude> หลักสูตรปริญญาตรีทางวิชาชีพหรือปฏิบัติการ</exclude>\n\n<exclude> หลักสูตรปริญญาตรีแบบก้าวหน้าทางวิชาชีพหรือปฏิบัติการ</exclude>\n1.4.3 ภาษาที่ใช้\n\n<include> จัดการศึกษาภาษาไทย</include>\n\n<exclude> จัดการศึกษาภาษาอังกฤษ</exclude>\n\n<exclude> จัดการศึกษาทั้งภาษาไทยและภาษาอังกฤษ</exclude>\n\n<exclude> จัดการศึกษาภาษาต่างประเทศ ระบุ..</exclude>\n1.4.4 ความร่วมมือกับสถาบันอื่น\n\n<include> หลักสูตรของสถาบันโดยเฉพาะ</include>\n\n<exclude> หลักสูตรที่ได้รับความร่วมมือสนับสนุนจากสถาบันอื่น หลักสูตรร่วมกับสถาบัน</exclude>\nหรือ\nอื่น ระบุ (โดยต้องระบุชื่อสถาบันการศึกษา/หน่วยงานที่ทำความร่วมมือ\nพร้อมทั้งแนบ MOU)\n1.4.5 การให้ปริญญาแก่ผู้สำเร็จการศึกษา\n\n<include> ให้ปริญญาเพียงสาขาวิชาเดียว</include>\n\n<exclude> ให้ปริญญามากกว่า 1 สาขาวิชา (เช่น ทวิปริญญา) หรือปริญญาร่วมระหว่าง</exclude>\nสถาบันอุดมศึกษา)\n1.4.6 สถานภาพของหลักสูตรและการพิจารณาอนุมัติ/เห็นชอบหลักสูตร\nหลักสูตรปรับปรุง พ.ศ. 2566 ปรับปรุงจากหลักสูตรศิลปศาสตรบัณฑิต สาขาวิชาการจัดการ\nมรดกวัฒนธรรมและอุตสาหกรรมสร้างสรรค์ หลักสูตรปรับปรุง พ.ศ. 2561\nกำหนดเปิดสอนในภาคการศึกษาที่ 1 ปีการศึกษา 2566\nได้พิจารณากลั่นกรองโดยคณะกรรมการนโยบายวิชาการ ในการประชุมครั้งที่ 1/2566 เมื่อวันที่\n1 เดือน มีนาคม พ.ศ. 2566\nได้รับอนุมัติ/เห็นชอบหลักสูตรจากสภามหาวิทยาลัย ในการประชุมครั้งที่ 5/2566\nเมื่อวันที่ 25 เดือน เมษายน พ.ศ. 2566\nมคอ. 2 หลักสูตรศิลปศาสตรบัณฑิต สาขาวิชาการจัดการมรดกวัฒนธรรมและอตุ สาหกรรมสร้างสรรค์ หน้า 2 1.5 อาชีพที่สามารถประกอบได้หลังสารเ็จการศึกษา\n1.5.1 พนักงานและผู้ประกอบการด้านมรดกวัฒนธรรม\n1.5.2 พนักงานและผู้ประกอบการด้านอุตสาหกรรมสร้างสรรค์\n1.5.3 บุคลากรสายวิชาการ และพนักงานสายสนับสนุนด้านการจัดการมรดกวัฒนธรรมและ\nอุตสาหกรรมสร้างสรรค์\n1.5.4 นักวิจัยหรือผู้ช่วยนักวิจัยในโครงการขององค์การยูเนสโก และงานด้านวัฒนธรรมอื่น ๆ\nที่เกี่ยวข้อง\n1.5.5 ภัณฑารักษ์หรือผู้ดูแลพิพิธภัณฑ์\n1.5.6 พนักงานองค์กรฝ่ายการตลาดและการประชาสัมพันธ์ทางวัฒนธรรม\n1.5.7 พนักงานองค์กรฝ่ายวิเคราะห์และวางแผนโครงการทางวัฒนธรรม\n1.5.8 พนักงานองค์กรฝ่ายประสานงานโครงการทางวัฒนธรรมและโครงการอื่น ๆ ที่เกี่ยวข้อง\n1.5.9 พนักงานองค์กรด้านการออกแบบสื่อวัฒนธรรมสร้างสรรค์\n1.5.10 เจ้าหน้าที่บริษัทผลิตรายการโทรทัศน์และภาพยนตร์และสื่อสมัยใหม่\n1.5.11 เจ้าหน้าที่บริษัทรับจัดงานและการแสดงทางวัฒนธรรม (Event)\n1.5.12 อาชีพอิสระ เช่น ผู้ผลิตงานสร้างสรรค์ (ภาพยนตร์ เพลง ศิลปะการแสดง ฯลฯ) ผู้\nประกอบกิจการสตาร์ทอัป (Startup)\n1.6 สถานที่จัดการเรียนการสอน\n\n<exclude> ศูนย์รังสิต</exclude>\n\n<include> ท่าพระจันทร์</include>\n\n<exclude> ศูนย์พัทยา</exclude>\n\n<exclude> ศูนย์ลำปาง</exclude>\n1.7 ค่าใช้จ่ายตลอดหลักสูตร\nประเภทโครงการ\n\n<exclude> โครงการปกติ</exclude>\n\n<include> โครงการพิเศษ</include>\n\n<exclude> โครงการปกติและโครงการพิเศษ</exclude>\nค่าใช้จ่ายตลอดหลักสูตร\n\n<include> นักศึกษาไทย 325,680 บาท</include>\n\n<exclude> นักศึกษาต่างชาติ  บาท</exclude>\nมคอ. 2 หลักสูตรศิลปศาสตรบัณฑิต สาขาวิชาการจัดการมรดกวัฒนธรรมและอตุ สาหกรรมสร้างสรรค์ หน้า 3 ค่าใช้จ่ายต่อหัวนักศึกษาตลอดระยะเวลาหลักสูตร คือ 325,680 บาทต่อคน โดยมีการบริหาร\nจัดการโครงการบริการการศึกษา (เพื่อรับปริญญา) (โครงการพิเศษ) นักศึกษามีค่าใช้จ่ายหลักได้แก่\nค่าหน่วยกิต ๆ ละ 1,500 บาท และค่าธรรมเนียมอื่น ๆ ของวิทยาลัยนวัตกรรม รายละเอียดดังนี้\nค่าธรรมเนียมพิเศษ ภาคการศึกษาปกติภาคฤดูร้อน (ถ้ามี)\nสำหรับนักศึกษาไทย (ยกเว้นภาคฤดูร้อน) 10,000 บาท -\nสำหรับนักศึกษาต่างชาติ (ยกเว้นภาคฤดูร้อน) 10,000 บาท -\nทั้งนี้ค่าใช้จ่ายต่อหัวนักศึกษาตลอดระยะเวลาหลักสูตรนี้ยังไม่รวมค่าใช้จ่ายในการศึกษาดูงาน\nต่างประเทศ\nมคอ. 2 หลักสูตรศิลปศาสตรบัณฑิต สาขาวิชาการจัดการมรดกวัฒนธรรมและอตุ สาหกรรมสร้างสรรค์ หน้า 4",
    "หมวดที่ 2": "หมวดที่ 2 คุณสมบัติผู้เข้าศึกษา\n2.1 การรับเข้าศึกษา\n\n<exclude> รับเฉพาะนักศึกษาไทย</exclude>\n\n<include> รับทั้งนักศึกษาไทยและนักศึกษาต่างชาติที่สามารถใช้ภาษาไทยได้ดี</include>\n\n<exclude> รับทั้งนักศึกษาไทยและนักศึกษาต่างชาติ</exclude>\n2.2 คุณสมบัติของผู้เข้าศึกษา\nคุณสมบัติของผู้เข้าศึกษาต้องไปตามข้อบังคับมหาวิทยาลัยธรรมศาสตร์ ว่าด้วยการศึกษา\nชั้นปริญญาตรีพ.ศ. 2561 ข้อ 14\nการคัดเลือกผู้เข้าศึกษา\nการคัดเลือกผู้เข้าศึกษาให้ไปตามระเบียบคัดเลือกเพื่อเข้าศึกษาในสถาบันการศึกษาขั้น\nอุดมศึกษาของส่วนราชการหรือหน่วยงานอื่นดำเนินการตามการมอบหมายของมหาวิทยาลัยหรือตาม\nข้อตกลง หรือ การคัดเลือกตามวิธีการที่มหาวิทยาลัยกำหนดโดยความเห็นชอบของสภามหาวิทยาลัย และ\nออกประกาศมหาวิทยาลัย\n2.3 แผนการรับนักศึกษาและผู้สารเ็จการศึกษาในระยะ 5 ปี\nในแต่ละปีการศึกษาจะรับนักศึกษาปีละ 120 คน\nจำนวนนักศึกษาแต่ละปีการศึกษา\nจำนวนนักศึกษา\n2566 2567 2568 2569 2570\nชั้นปีที่ 1 120 120 120 120 120\nชั้นปีที่ 2 120 120 120 120\nชั้นปีที่ 3 120 120 120\nชั้นปีที่ 4 120 120\nรวม 120 240 360 480 480\nคาดว่าจะจบการศึกษา - - - 120 120\nมคอ. 2 หลักสูตรศิลปศาสตรบัณฑิต สาขาวิชาการจัดการมรดกวัฒนธรรมและอตุ สาหกรรมสร้างสรรค์ หน้า 5",
    "หมวดที่ 3": "หมวดที่ 3 ปรัชญา วัตถุประสงค์ และผลลัพธ์การเรียนรู้ของหลักสูตร\n3.1 ความสอดคล้องของหลักสูตรกับทิศทางนโยบายและยุทธศาสตร์การพัฒนากำลังคน และ\nยุทธศาสตร์มหาวิทยาลัย\nหลักสูตรศิลปศาสตรบัณฑิต สาขาวิชาการจัดการมรดกวัฒนธรรมและอุตสาหกรรมสร้างสรรค์\nจัดเตรียมองค์ความรู้ทั้งทางด้านวัฒนธรรม อุตสาหกรรมสร้างสรรค์ และ การจัดการ สู่การออกแบบ\nรายวิชาและวิธีจัดการเรียนการสอนเชิงบูรณาการ เพื่อให้สอดคล้องกับสาขาวิชาที่สาขาพหุวิทยากร\nสอดรับกับแนวทางการเรียนรู้ตามยุทธศาสตร์ของมหาวิทยาลัย ทั้ง “พัฒนากำลังคนแห่งอนาคต (Future\nWorkforce)” ที่พร้อมเผชิญกับการประกอบอาชีพ และตลาดแรงงานในอนาคต การศึกษาอย่างรอบด้าน\nเพื่อสร้างความรอบรู้ ไม่ยึดติดกับการเรียนรู้แบบเดิม ๆ ตลอดจนพัฒนาทักษะและทัศนคติของการเรียนรู้\nแห่งอนาคตที่ต้องการผู้มีทักษะอย่างหลากหลาย ให้ความสนใจมิติวัฒนธรรมทั้งในแง่การอนุรักษ์ และมิติ\nการพัฒนาอย่างสร้างสรรค์ โดยคำนึงถึงหลักการพัฒนาของประเทศ และโลกที่ว่าด้วยความมีส่วนร่วมและ\nความยั่งยืน ด้าน “พัฒนาที่ทำงานแห่งอนาคต (Future Workplace)” โดยหลักสูตรใช้โอกาสจากพื้นที่\nจัดการเรียนการสอนที่ตั้งอยู่ในพื้นที่ของมหาวิทยาลัยธรรมศาสตร์ ท่าพระจันทร์ สร้างและบูรณาการพื้นที่\nที่ทรงคุณค่าทางประวัติศาสตร์และวัฒนธรรม สู่การพื้นที่เพื่อการเรียนรู้สำหรับทั้งในและนอก\nห้องเรียน ส่งเสริมโอกาสเพื่อการเรียนรู้หรือทำการศึกษาวิจัย สร้างสรรค์นวัตกรรม และบริการสังคม ทั้ง\nยังการส่งเสริมให้ผู้เรียนได้มีทักษะในการสร้างความร่วมมือ และเข้าใจต่อความเปลี่ยนแปลงในสังคม\nและวัฒนธรรมได้อย่างรูปธรรม มีความรับผิดชอบต่อสังคม มีเป้าหมายเพื่อพัฒนาคุณภาพชีวิตของ\nประชาชนและสร้างสังคมที่ดียิ่งขึ้น สอดคล้องกับยุทธศาสตร์ด้าน “พัฒนาคุณภาพชีวิตและสังคมแห่ง\nอนาคต (Future Life and Society)” และ “พัฒนารูปแบบความร่วมมือแห่งอนาคต (Future\nCollaboration)” ของมหาวิทยาลัย\n3.2 ปรัชญา\nพัฒนาตนและสร้างองค์ความรู้พหุวิทยาการด้านวัฒนธรรมและการจัดการ ก้าวทันความ\nเปลี่ยนแปลง ก้าวข้ามเส้นแบ่งความรู้ก้าวสู่ความเลิศระดับสากล บนพื้นฐานคุณธรรม จริยธรรม และรับ\nใช้สังคม\n3.3 วัตถุประสงค์ของหลักสูตร\nเพื่อให้บัณฑิตที่สำเร็จการศึกษาในหลักสูตรมีคุณลักษณะ ดังนี้\n1. นักจัดการด้านวัฒนธรรมที่มีความรู้ความสามารถ และทักษะเชิงพหุวิทยาการ\n2. สามารถบูรณาการองค์ความรู้ด้านวัฒนธรรม และอุตสาหกรรมสร้างสรรค์ได้\n3. มีศักยภาพในระดับอาเซียนและสากล\n4. มีความรับผิดชอบต่อสังคมบนพื้นฐานคุณธรรม จริยธรรม และรับใช้สังคม\nมคอ. 2 หลักสูตรศิลปศาสตรบัณฑิต สาขาวิชาการจัดการมรดกวัฒนธรรมและอตุ สาหกรรมสร้างสรรค์ หน้า 6 3.4 ผลลพัธก์ารเรียนรู้ของหลักสูตร (PLOs)\nด้านความรู้ (Knowledge)\nK 1 ผู้เรียนมีความรู้ความเข้าใจเรื่องแนวคิด ทฤษฎี และหลักการด้านการจัดการทาง\nวัฒนธรรม\nK 2 ผู้เรียนมีความรู้ความเข้าใจเรื่องแนวคิดเชิงสร้างสรรค์ หรือการคิดในเชิงสร้างสรรค์\nK 3 ผู้เรียนมีความรู้ความเข้าใจเรื่องการทำวิจัย\nK 4 ผู้เรียนมีความรู้ความเข้าใจในการวางแผนกลยุทธ์การจัดการทางวัฒนธรรม\nK 5 ผู้เรียนมีความรู้ความเข้าใจ และสามารถประยุกต์ใช้เทคโนโลยีในการจัดการทาง\nวัฒนธรรม\nK 6 ผู้เรียนสามารถนำข้อมูลทางเศรษฐกิจที่เกี่ยวข้องกับการจัดการทางวัฒนธรรมมาวิเคราะห์\nเพื่อประยุกต์ใช้ในการจัดการทางวัฒนธรรมได้อย่างมีประสิทธิภาพ\nด้านทักษะ (Skills)\nS 1 ผู้เรียนสามารถคิด วิเคราะห์ปัญหาภายใต้สถานการณ์ต่าง ๆ ได้อย่างสร้างสรรค์\nS 2 ผู้เรียนสามารถประเมินผลกระทบจากการดำเนินงานต่าง ๆ และสามารถนำความรู้มา\nประยุกต์ใช้ได้\nS 3 ผู้เรียนสามารถใช้ความรู้ในการแก้ไขปัญหาเฉพาะหน้าได้อย่างมีประสิทธิภาพ เหมาะสมกับ\nสถานการณ์\nS 4 ผู้เรียนสามารถพัฒนาและสร้างสรรค์องค์ความรู้สหวิทยาการทางวัฒนธรรม\nS 5 ผู้เรียนสามารถวิเคราะห์ข้อมูลต่าง ๆ ด้านการเงินและการตลาดเพื่อประกอบการ\nตัดสินใจในการดำเนินงานด้านการจัดการทางวัฒนธรรม\nS 6 ผู้เรียนสามารถประยุกต์ใช้เทคโนโลยีสารสนเทศเพื่อเครื่องมือในการจัดการและการ\nสื่อสารข้อมูลต่าง ๆ ได้อย่างเหมาะสมและมีประสิทธิภาพ\nด้านจริยธรรม (Ethics)\nE 1 ผู้เรียนมีความรู้ความเข้าใจเรื่องการอนุรักษ์ศิลปวัฒนธรรมอย่างยั่งยืน\nE 2 ผู้เรียนมีความรู้และตระหนักในความรับผิดชอบต่อสังคมและวัฒนธรรม\nด้านลักษณะบุคคล (Character)\nC 1 ผู้เรียนมีภาวะความผู้นำและผู้ตามในกลุ่ม ตลอดจนการทำงานร่วมกันทีม\nสามารถทำงานร่วมกับผู้อื่นและมีมนุษยสัมพันธ์ที่ดีกับผู้ร่วมงาน\nC 2 ผู้เรียนมีความรับผิดชอบในการกระทำของตนเองและรับผิดชอบงานกลุ่ม\nC 3 ผู้เรียนมีความกล้าในการแสดงความคิดเห็นและการยอมรับความคิดเห็นของผู้อื่น\nC 4 ผู้เรียนสามารถใช้ทักษะทางการสื่อสารได้อย่างชัดเจนและมีประสิทธิภาพ\nมคอ. 2 หลักสูตรศิลปศาสตรบัณฑิต สาขาวิชาการจัดการมรดกวัฒนธรรมและอตุ สาหกรรมสร้างสรรค์ หน้า 7 3.5 ผลลัพธ์การเรียนรู้ที่คาดหวังเมื่อสิ้นปีการศึกษา (YLOs)\nความรู้ทักษะ ทัศนคติหรืออื่นๆ ที่นักศึกษาจะได้รับเมื่อ\nชั้นปี\nเรียนจบแต่ละชั้นปี\nปีที่ 1 นักศึกษามีความรู้ และความเข้าใจต่อแนวคิด และทฤษฎีด้านวัฒนธรรม และอุตสาหกรรม\nสร้างสรรค์ที่เกี่ยวข้องอย่างรอบด้าน โดยสามารถนำเอาความรู้ และทักษะต่าง ๆ ที่ได้จากการ\nเรียนรู้มาใช้แนวทางในการคิด และวิเคราะห์ประเด็นที่เกี่ยวข้องทางด้านวัฒนธรรมและ\nอุตสาหกรรมสร้างสรรค์ได้อย่างเหมาะสม โดยมีเข้าใจในความรับผิดชอบและความตระหนัก\nต่อสังคมและวัฒนธรรม และมีทักษะการทำงานทีม สามารถแสดงความคิดเห็นในที่\nสาธารณะ\nปีที่ 2 นักศึกษามีความรู้ และความเข้าใจต่อแนวคิด และทฤษฎีด้านการจัดการ สามารถประยุกต์\nแนวคิดด้านการจัดการเพื่อนำสู่การจัดการทางด้านวัฒนธรรมและอุตสาหกรรมสร้างสรรค์ได้\nอย่างระบบ มีทักษะการคิดวิเคราะห์ และ การคิดเชิงวิพากษ์อย่างสร้างสรรค์ โดยสามารถ\nนำทั้งความรู้ทักษะต่าง ๆ ตลอดจนกระบวนการคิดอย่างสร้างสรรค์ที่ได้จากการเรียนรู้มา\nบูรณาการกับประเด็นการจัดการมรดกวัฒนธรรมและอุตสาหกรรมสร้างสรรค์ได้อย่าง\nระบบ โดยมีความตระหนักและรับผิดชอบต่อสังคมและวัฒนธรรมอย่างรอบด้าน\nปีที่ 3 นักศึกษาได้รับการพัฒนาความลุ่มลึกของความรู้ และมีทักษะระดับสูง ตลอดจนความสามารถ\nในการจัดการและบูรณาการ มีความสามารถในการคิด และวิเคราะห์อย่างระบบ อีกทั้ง\nสามารถประยุกต์ใช้ข้อมูลอย่างรอบด้าน และเทคโนโลยีที่เหมาะสมเพื่อนำสู่การพัฒนาการ\nเรียนรู้ด้านการจัดการวัฒนธรรมและอุตสาหกรรมสร้างสรรค์ที่มีเนื้อหาสาระ และประเด็นทาง\nสังคมที่ลุ่มลึกขึ้น ให้ความสำคัญกับการนำเอาสิ่งที่ได้รับจากการเรียนรู้มาบูรณาการและ\nสร้างสรรค์แก่สังคมด้วยความตระหนักและรับผิดชอบต่อสังคมและวัฒนธรรมอย่างยั่งยืน\nปีที่ 4 นักศึกษาสามารถพัฒนาและสร้างสรรค์องค์ความรู้ด้านการจัดการวัฒนธรรมและอุตสาหกรรม\nสร้างสรรค์ด้วยกระบวนการคิดอย่างบูรณาการ ทักษะที่สร้างสรรค์ และความรู้ความสามารถที่\nได้รับการพัฒนามาอย่างต่อเนื่อง อีกทั้งมีความตระหนักถึงประเด็นทางสังคมและวัฒนธรรม\nของสังคมอย่างลึกซึ้ง รอบด้าน พร้อมสู่การแข่งขันในตลาดแรงงานได้อย่างมีคุณภาพ ก้าวสู่\nการสมาชิกของสังคม และประชาชนของประเทศที่มีความกระตือรือร้น และมีความ\nตระหนักและรับผิดชอบต่อสังคมและวัฒนธรรมอย่างยั่งยืน และมีทักษะความสามารถในการ\nสื่อสารได้อย่างชัดเจนและมีประสิทธิภาพ\nมคอ. 2 หลักสูตรศิลปศาสตรบัณฑิต สาขาวิชาการจัดการมรดกวัฒนธรรมและอตุ สาหกรรมสร้างสรรค์ หน้า 8",
    "หมวดที่ 4": "หมวดที่ 4 โครงสร้างหลักสูตร รายวิชา และหน่วยกิต\n4.1 ระบบการจัดการศึกษาและระยะเวลาการศึกษา\n4.1.1 ระบบ\nหลักสูตรแบบเต็มเวลา ใช้ระบบการศึกษาแบบทวิภาค โดย 1 ปีการศึกษาแบ่งออก 2\nภาคการศึกษาปกติ 1 ภาคการศึกษาปกติมีระยะเวลาศึกษาไม่น้อยกว่า 15 สัปดาห์\n4.1.2 ระยะเวลาการศึกษาสูงสุด\n\n<exclude> ไม่กำหนด</exclude>\n\n<include> ไม่เกิน.16.ภาคการศึกษาปกติ</include>\n4.2 การดำเนินการหลักสูตร\n4.2.1 วัน-เวลาในการดำเนินการเรียนการสอน\n\n<include> วัน – เวลาราชการปกติ</include>\n\n<exclude> นอกวัน – เวลาราชการ</exclude>\n(เลือกเพียง 1 ระบบ)\n4.2.2 ระบบการศึกษา\n\n<include> แบบชั้นเรียน (Onsite)</include>\n\n<exclude> แบบทางไกล (Online)</exclude>\n\n<exclude> แบบประสมประสาน (Hybrid)</exclude>\n\n<include> อื่นๆ (ระบุ)</include>\nนอกเหนือจากระบบการศึกษาแบบชั้นเรียน หลักสูตรจะใช้เทคนิคการเรียนการสอนแบบ\nผสมผสาน เพื่อสร้างการเรียนรู้ที่มีประสิทธิภาพให้แก่นักศึกษา โดยเทคนิคที่จะใช้ในการสร้างการเรียนรู้\nประกอบด้วย การเรียนรู้เชิงรุก (Active learning) การเรียนรู้จากปัญหาที่เผชิญอยู่ในปัจจุบัน (Problem-\nbased learning) การเรียนรู้ด้วยการทำโครงงาน (Project-based learning) การทำงานกลุ่ม การ\nทำงานวิจัย โครงการเดี่ยว การวิเคราะห์กรณีศึกษา การฝึกงานผ่านการปฏิบัติจริง รวมถึงการศึกษาดูงาน\n4.3 โครงสร้างหลักสูตร รายวิชา และหน่วยกิต\nนักศึกษาจะต้องจดทะเบียนศึกษารายวิชารวมไม่น้อยกว่า 129 หน่วยกิต โดยศึกษารายวิชาต่าง ๆ\nครบตามโครงสร้างองค์ประกอบ และข้อกำหนดของหลักสูตรดังนี้\n4.3.1 หลักสูตร\n4.3.1.1 จำนวนหน่วยกิตรวม\nจำนวนหน่วยกิตรวมตลอดหลักสูตร 129 หน่วยกิต\nมคอ. 2 หลักสูตรศิลปศาสตรบัณฑิต สาขาวิชาการจัดการมรดกวัฒนธรรมและอตุ สาหกรรมสร้างสรรค์ หน้า 9 4.3.1.2 โครงสร้างหลักสูตร\n1) วิชาศึกษาทั่วไป 30 หน่วยกิต\n2) วิชาเฉพาะ 90 หน่วยกิต\n2.1) วิชาบังคับ 66 หน่วยกิต\n2.2) วิชาบังคับเลือก 9 หน่วยกิต\n2.3) วิชาเลือก 15 หน่วยกิต\n3) วิชาเลือกเสรี 9 หน่วยกิต\nรวม 129 หน่วยกิต\n4.3.2 รายวิชาในหลักสูตร\n4.3.2.1 รหัสวิชา\nรายวิชาในหลักสูตรประกอบด้วย อักษรย่อ 2 หรือ 3 ตัว และเลขรหัส 3 ตัว โดยมี\nความหมายดังนี้\nอักษรย่อ จวอ/HIM หมายถึง อักษรย่อของสาขาวิชา การจัดการมรดกวัฒนธรรม\nและอุตสาหกรรมสร้างสรรค์\nตัวเลข มีความหมาย ดังนี้\n(ระบุรายละเอียดตามลักษณะของแต่ละหลักสูตร)\nเลขหลักหน่วย\nเลข 0-5 หมายถึง วิชาบังคับ\nเลข 6-9 หมายถึง วิชาบังคับเลือกและวิชาเลือก\n(ระบุรายละเอียดตามลักษณะของแต่ละหลักสูตร)\nเลขหลักสิบ\nเลข 0-1 หมายถึง วิชาด้านการจัดการทางวัฒนธรรมทั่วไป\nเลข 2 หมายถึง วิชาด้านการจัดการทางวัฒนธรรม หมวดมรดกทาง\nวัฒนธรรม\nเลข 3 หมายถึง วิชาด้านการจัดการทางวัฒนธรรม หมวด\nอุตสาหกรรมสร้างสรรค์\nเลข 4 หมายถึง วิชาภาษาต่างประเทศเพื่อการจัดการทาง\nวัฒนธรรม\nเลข 5-8 หมายถึง วิชาภาษาและวัฒนธรรมในอาเซียน\nเลข 9 หมายถึง วิชาเลือกเสรี\nเลขหลักร้อย\nเลข 1 หมายถึง รายวิชาที่จัดสอนในหลักสูตรชั้นปีที่ 1\nเลข 2 หมายถึง รายวิชาที่จัดสอนในหลักสูตรชั้นปีที่ 2\nเลข 3 หมายถึง รายวิชาที่จัดสอนในหลักสูตรชั้นปีที่ 3\nเลข 4 หมายถงึรายวิชาที่จัดสอนในหลักสูตรชั้นปีที่ 4\nมคอ. 2 หลักสูตรศิลปศาสตรบัณฑิต สาขาวิชาการจัดการมรดกวัฒนธรรมและอตุ สาหกรรมสร้างสรรค์ หน้า 10 4.3.2.2 รายวิชาและข้อกำหนดของหลักสูตร\n1) วิชาศึกษาทั่วไป 30 หน่วยกิต\nนักศึกษาทุกคนสามารถเลือกเรียนได้ทุกรายวิชาในแต่ละหมวด โดยต้องเลือกเรียนให้ครบทั้ง 5\nหมวด ได้แก่ 1) หมวดความเท่าทันโลกและสังคม 2) หมวดสุนทรียะและทักษะการสื่อสาร 3) หมวด\nคณิตศาสตร์ วิทยาศาสตร์ และเทคโนโลยี 4) หมวดสุขภาวะและทักษะแห่งอนาคต 5) หมวดการบริการ\nสังคมและการเรียนรู้จากการปฏิบัติจำนวนรวมทั้งสิ้น 30 หน่วยกิต ตามโครงสร้างและองค์ประกอบของ\nหลักสูตรวิชาศึกษาทั่วไปที่วิทยาลัยกำหนดไว้ดังนี้\nหมวดวิชา จำนวนหน่วยกิต\n1) หมวดความเท่าทันโลกและสังคม 6 หน่วยกิต\n2) หมวดสุนทรียะและทักษะการสื่อสาร 12 หน่วยกิต\n3) หมวดคณิตศาสตร์ วิทยาศาสตร์ และเทคโนโลยี 6 หน่วยกิต\n4) หมวดสุขภาวะและทักษะแห่งอนาคต 3 หน่วยกิต\n5) หมวดการบริการสังคมและการเรียนรู้จากการปฏิบัติ 3 หน่วยกิต\nรวม 30 หน่วยกิต\n6 หน่วยกิต\n1.1) หมวดความเท่าทันโลกและสังคม\nจำนวนหน่วยกิต\nรหัสวิชา ชื่อรายวิชา\n(บรรยาย – ปฏิบัติ – ศึกษาดว้ยตนเอง)\nมธ. 101 โลก อาเซียน และไทย\n3(3-0-6)\nTU 101 Thailand, ASEAN, and the World\nมธ. 109 นวัตกรรมกับกระบวนคิดผู้ประกอบการ\n3(3-0-6)\nTU 109 Innovation and Entrepreneurial mindset\n12 หน่วยกิต\n1.2) หมวดสุนทรียะและทักษะการสื่อสาร\nจำนวนหน่วยกิต\nรหัสวิชา ชื่อรายวิชา\n(บรรยาย – ปฏิบัติ – ศึกษาดว้ยตนเอง)\nมธ. 102 ชีวิตกับสุนทรียภาพ\n3(3-0-6)\nTU 102 Life & Aesthetics\nศศ. 101 การคิด อ่าน และเขียนอย่างมีวิจารณญาณ\n3(3-0-6)\nLAS 101 Critical Thinking, Reading and Writing\nสษ. 105 ทักษะการสื่อสารทางภาษาอังกฤษ\n3(3-0-6)\nEL 105 English Communication Skills\nมคอ. 2 หลักสูตรศิลปศาสตรบัณฑิต สาขาวิชาการจัดการมรดกวัฒนธรรมและอตุ สาหกรรมสร้างสรรค์ หน้า 11 มธ. 106 ความคิดสร้างสรรค์และการสื่อสาร\n3(3-0-6)\nTU 106 Creativity and Communication\n6 หน่วยกิต\n1.3) หมวดคณิตศาสตร์ วิทยาศาสตร์ และเทคโนโลยี\nจำนวนหน่วยกิต\nรหัสวิชา ชื่อรายวิชา\n(บรรยาย – ปฏิบัติ – ศึกษาดว้ยตนเอง)\nมธ. 103 ชีวิตกับความยั่งยืน\n3(3-0-6)\nTU 103 Life and Sustainability\nมธ. 107 ทักษะดิจิทัลกับการแก้ปัญหา\n3(3-0-6)\nTU 107 Digital Skill and Problem Solving\n3 หน่วยกิต\n1.4) หมวดสุขภาวะและทักษะแห่งอนาคต\nจำนวนหน่วยกิต\nรหัสวิชา ชื่อรายวิชา\n(บรรยาย – ปฏิบัติ – ศึกษาดว้ยตนเอง)\nมธ. 201 ความรู้ทางการเงินสำหรับบุคคล\n3(3-0-6)\nTU 201 Financial Literacy for Individuals\n3 หน่วยกิต\n1.5) หมวดการบริการสังคมและการเรียนรู้จากการปฏิบัติ\nจำนวนหน่วยกิต\nรหัสวิชา ชื่อรายวิชา\n(บรรยาย – ปฏิบัติ – ศึกษาดว้ยตนเอง)\nมธ. 100 พลเมืองกับการลงมือแก้ปัญหา\n3(3-0-6)\nTU 100 Civic Engagement\n2) วิชาเฉพาะ 90 หน่วยกิต\n66 หน่วยกิต\n2.1) วิชาบังคับ\nนักศึกษาต้องศึกษารายวิชาในหมวดวิชาบังคับ จำนวน 66 หน่วยกิต ตามรายวิชาที่กำหนดไว้\nดังนี้\nจำนวนหน่วยกิต\nรหัสวิชา ชื่อรายวิชา\n(บรรยาย – ปฏิบัติ – ศึกษาดว้ยตนเอง)\nจวอ. 200 แนวคิดและทฤษฎีด้านมรดกวัฒนธรรมและอุตสาหกรรม 3(3-0-6)\nสร้างสรรค์\nHIM 200 Concepts and Theories of Cultural Heritage and\nCreative Industries\nมคอ. 2 หลักสูตรศิลปศาสตรบัณฑิต สาขาวิชาการจัดการมรดกวัฒนธรรมและอตุ สาหกรรมสร้างสรรค์ หน้า 12 จำนวนหน่วยกิต\nรหัสวิชา ชื่อรายวิชา\n(บรรยาย – ปฏิบัติ – ศึกษาดว้ยตนเอง)\nจวอ. 201 การบัญชีและการเงินเพื่อการจัดการมรดกวัฒนธรรมและ 3(3-0-6)\nอุตสาหกรรมสร้างสรรค์\nHIM 201 Accounting and Finance for Management of\nCultural Heritage and Creative Industries\nจวอ. 202 ศิลปะเพื่อการสร้างสรรค์นวัตกรรม 3(3-0-6)\nHIM 202 Art for Creative Innovation\nจวอ. 203 อารยธรรม การเปลี่ยนแปลงและนวัตกรรม 3(3-0-6)\nHIM 203 Civilization, Transformation, and Innovation\nจวอ. 204 มานุษยวิทยาประยุกต์เพื่อการจัดการมรดกวัฒนธรรมและ 3(3-0-6)\nอุตสาหกรรมสร้างสรรค์\nHIM 204 Applied Anthropology for Management of Cultural\nHeritage and Creative Industries\nจวอ. 205 หลักเศรษฐศาสตร์เพื่อการจัดการมรดกวัฒนธรรมและ 3(3-0-6)\nอุตสาหกรรมสร้างสรรค์\nHIM 205 Principles of Economics for Management of\nCultural Heritage and Creative Industries\nจวอ. 210 หลักการตลาดเพื่อการจัดการมรดกวัฒนธรรมและ 3(3-0-6)\nอุตสาหกรรมสร้างสรรค์\nHIM 210 Marketing Principles for Management of Cultural\nHeritage and Creative Industries\nจวอ. 212 การจัดการทรัพยากรทางวัฒนธรรม 3(3-0-6)\nHIM 212 Cultural Resource Management\nจวอ. 214 สื่อและวัฒนธรรมเชิงวิพากษ์ 3(3-0-6)\nHIM 214 Critical Media and Cultural Studies\nจวอ. 215 ทัศนวัฒนธรรมร่วมสมัย 3(3-0-6)\nHIM 215 Contemporary Visual Culture\nจวอ. 230 กระบวนการสร้างสรรค์และการผลิตในอุตสาหกรรมสื่อ 3(3-0-6)\nHIM 230 Creative Process and Production in Media Industries\nจวอ. 300 นโยบายทางวัฒนธรรม 3(3-0-6)\nHIM 300 Cultural Policy\nจวอ. 301 การจัดการความรู้และความคิดสร้างสรรค์ 3(3-0-6)\nมคอ. 2 หลักสูตรศิลปศาสตรบัณฑิต สาขาวิชาการจัดการมรดกวัฒนธรรมและอตุ สาหกรรมสร้างสรรค์ หน้า 13 จำนวนหน่วยกิต\nรหัสวิชา ชื่อรายวิชา\n(บรรยาย – ปฏิบัติ – ศึกษาดว้ยตนเอง)\nHIM 301 Knowledge and Creativity Management\nจวอ. 302 ระเบียบวิธีวิจัยเพื่อการจัดการทางมรดกวัฒนธรรมและ 3(3-0-6)\nอุตสาหกรรมสร้างสรรค์\nHIM 302 Research Methodology for Management of Cultural\nHeritage and Creative Industries\nจวอ. 303 การจัดการโครงการทางมรดกวัฒนธรรมและอุตสาหกรรม 3(3-0-6)\nสร้างสรรค์\nHIM 303 Project Management for Cultural Heritage and\nCreative Industries\nจวอ. 304 กลยุทธ์การจัดการเพื่อมรดกวัฒนธรรมและอุตสาหกรรม 3(3-0-6)\nสร้างสรรค์\nHIM 304 Strategic Management for Cultural Heritage and\nCreative Industries\nจวอ. 313 การสื่อสารข้ามวัฒนธรรม 3(3-0-6)\nHIM 313 Cross-cultural Communication\nจวอ. 320 การจัดการมรดกภูมิปัญญาทางวัฒนธรรม 3(3-0-6)\nHIM 320 Intangible Cultural Heritage Management\nจวอ. 340 ภาษาอังกฤษเพื่อการจัดการทางมรดกวัฒนธรรมและ 3(3-0-6)\nอุตสาหกรรมสร้างสรรค์\nHIM 340 English for Management of Cultural Heritage and\nCreative Industries\nจวอ. 400 การศึกษาเฉพาะเรื่อง 3(1-4-4)\nHIM 400 Special Project\nจวอ. 410 กฎหมายและจริยธรรมในการจัดการมรดกวัฒนธรรมและ 3(3-0-6)\nอุตสาหกรรมสร้างสรรค์\nHIM 410 Laws and Ethics in Management of Cultural\nHeritage and Creative Industries\nจวอ. 411 การฝึกปฏิบัติงานด้านการจัดการมรดกวัฒนธรรมและ 3\nอุตสาหกรรมสร้างสรรค์ (ฝึกงาน 250 ชั่วโมง)\nHIM 411 Internship for Cultural Heritage Management and\nCreative Industries\nมคอ. 2 หลักสูตรศิลปศาสตรบัณฑิต สาขาวิชาการจัดการมรดกวัฒนธรรมและอตุ สาหกรรมสร้างสรรค์ หน้า 14 9 หน่วยกิต\n2.2) วิชาบังคับเลือก\nนักศึกษาต้องศึกษารายวิชาในหมวดวิชาบังคับเลือก จำนวน 9 หน่วยกิต โดยเลือกศึกษาจาก\nรายวิชาที่กำหนดไว้เฉพาะกลุ่มใดกลุ่มหนึ่ง ดังนี้\nจำนวนหน่วยกิต\nรหัสวิชา ชื่อรายวิชา\n(บรรยาย – ปฏิบัติ – ศึกษาดว้ยตนเอง)\nกลุ่มภาษาและวัฒนธรรมเขมร\nจวอ. 250 ทักษะการสื่อสารภาษาและวัฒนธรรมเขมรเบื้องต้น 3(3-0-6)\nHIM 250 Basic Communicative Skills on Khmer Language and\nCulture\nจวอ. 350 ทักษะการสื่อสารภาษาและวัฒนธรรมเขมรระดับกลาง 3(3-0-6)\nHIM 350 Intermediate Communicative Skills on Khmer\nLanguage and Culture\nจวอ. 370 ทักษะการสื่อสารภาษาและวัฒนธรรมเขมรระดับสูง 3(3-0-6)\nHIM 370 Advanced Communicative Skills on Khmer\nLanguage and Culture\nกลุ่มภาษาและวัฒนธรรมพม่า\nจวอ. 251 ทักษะการสื่อสารภาษาและวัฒนธรรมพม่าเบื้องต้น 3(3-0-6)\nHIM 251 Basic Communicative Skills on Burmese Language\nand Culture\nจวอ. 351 ทักษะการสื่อสารภาษาและวัฒนธรรมพม่าระดับกลาง 3(3-0-6)\nHIM 351 Intermediate Communicative Skills on Burmese\nLanguage and Culture\nจวอ. 371 ทักษะการสื่อสารภาษาและวัฒนธรรมพม่าระดับสูง 3(3-0-6)\nHIM 371 Advanced Communicative Skills on Burmese\nLanguage and Culture\nกลุ่มภาษาและวัฒนธรรมมลายู\nจวอ. 252 ทักษะการสื่อสารภาษาและวัฒนธรรมมลายูเบื้องต้น 3(3-0-6)\nHIM 252 Basic Communicative Skills on Malay Language and\nCulture\nจวอ. 352 ทักษะการสื่อสารภาษาและวัฒนธรรมมลายูระดับกลาง 3(3-0-6)\nHIM 352 Intermediate Communicative Skills on Malay\nLanguage and Culture\nมคอ. 2 หลักสูตรศิลปศาสตรบัณฑิต สาขาวิชาการจัดการมรดกวัฒนธรรมและอตุ สาหกรรมสร้างสรรค์ หน้า 15 จำนวนหน่วยกิต\nรหัสวิชา ชื่อรายวิชา\n(บรรยาย – ปฏิบัติ – ศึกษาดว้ยตนเอง)\nจวอ. 372 ทักษะการสื่อสารภาษาและวัฒนธรรมมลายูระดับสูง 3(3-0-6)\nHIM 372 Advanced Communicative Skills on Malay Language\nand Culture\nกลุ่มภาษาและวัฒนธรรมเวียดนาม\nจวอ. 253 ทักษะการสื่อสารภาษาและวัฒนธรรมเวียดนามเบื้องต้น 3(3-0-6)\nHIM 253 Basic Communicative Skills on Vietnamese\nLanguage and Culture\nจวอ. 353 ทักษะการสื่อสารภาษาและวัฒนธรรมเวียดนามระดับกลาง 3(3-0-6)\nHIM 353 Intermediate Communicative Skills on Vietnamese\nLanguage and Culture\nจวอ. 373 ทักษะการสื่อสารภาษาและวัฒนธรรมเวียดนามระดับสูง 3(3-0-6)\nHIM 373 Advanced Communicative Skills on Vietnamese\nLanguage and Culture\nกลุ่มภาษาและวัฒนธรรมลาว\nจวอ. 254 ทักษะการสื่อสารภาษาและวัฒนธรรมลาวเบื้องต้น 3(3-0-6)\nHIM 254 Basic Communicative Skills on Lao Language and\nCulture\nจวอ. 354 ทักษะการสื่อสารภาษาและวัฒนธรรมลาวระดับกลาง 3(3-0-6)\nHIM 354 Intermediate Communicative Skills on Lao\nLanguage and Culture\nจวอ. 374 ทักษะการสื่อสารภาษาและวัฒนธรรมลาวระดับสูง 3(3-0-6)\nHIM 374 Advanced Communicative Skills on Lao Language\nand Culture\nกลุ่มภาษาและวัฒนธรรมอินโดนีเซีย\nจวอ. 255 ทักษะการสื่อสารภาษาและวัฒนธรรมอินโดนีเซียเบื้องต้น 3(3-0-6)\nHIM 255 Basic Communicative Skills on Indonesian Language\nand Culture\nจวอ. 355 ทักษะการสื่อสารภาษาและวัฒนธรรมอินโดนีเซียระดับกลาง 3(3-0-6)\nHIM 355 Intermediate Communicative Skills on Indonesian\nLanguage and Culture\nมคอ. 2 หลักสูตรศิลปศาสตรบัณฑิต สาขาวิชาการจัดการมรดกวัฒนธรรมและอตุ สาหกรรมสร้างสรรค์ หน้า 16 จำนวนหน่วยกิต\nรหัสวิชา ชื่อรายวิชา\n(บรรยาย – ปฏิบัติ – ศึกษาดว้ยตนเอง)\nจวอ. 375 ทักษะการสื่อสารภาษาและวัฒนธรรมอินโดนีเซียระดับสูง 3(3-0-6)\nHIM 375 Advanced Communicative Skills on Indonesian\nLanguage and Culture\nกลุ่มภาษาและวัฒนธรรมจีน\nจวอ. 260 ทักษะการสื่อสารภาษาและวัฒนธรรมจีนเบื้องต้น 3(3-0-6)\nHIM 260 Basic Communicative Skills on Chinese Language\nand Culture\nจวอ. 360 ทักษะการสื่อสารภาษาและวัฒนธรรมจีนระดับกลาง 3(3-0-6)\nHIM 360 Intermediate Communicative Skills on Chinese\nLanguage and Culture\nจวอ. 380 ทักษะการสื่อสารภาษาและวัฒนธรรมจีนระดับสูง 3(3-0-6)\nHIM 380 Advanced Communicative Skills on Chinese\nLanguage and Culture\nกลุ่มภาษาและวัฒนธรรมเกาหลี\nจวอ. 261 ทักษะการสื่อสารภาษาและวัฒนธรรมเกาหลีเบื้องต้น 3(3-0-6)\nHIM 261 Basic Communicative Skills on Korean Language\nand Culture\nจวอ. 361 ทักษะการสื่อสารภาษาและวัฒนธรรมเกาหลีระดับกลาง 3(3-0-6)\nHIM 361 Intermediate Communicative Skills on Korean\nLanguage and Culture\nจวอ. 381 ทักษะการสื่อสารภาษาและวัฒนธรรมเกาหลีระดับสูง 3(3-0-6)\nHIM 381 Advanced Communicative Skills on Korean\nLanguage and Culture\n15 หน่วยกิต\n2.3) วิชาเลือก\nนักศึกษาต้องศึกษาวิชาเลือก จำนวนไม่น้อยกว่า 15 หน่วยกิตจากหมวดวิชาทั้ง 2 หมวด ดังนี้\nหมวดมรดกทางวัฒนธรรม\nจำนวนหน่วยกิต\nรหัสวิชา ชื่อรายวิชา\n(บรรยาย – ปฏิบัติ – ศึกษาดว้ยตนเอง)\nจวอ. 227 การจัดการมรดกทางโบราณคดี 3(3-0-6)\nHIM 227 Archaeological Heritage Management\nมคอ. 2 หลักสูตรศิลปศาสตรบัณฑิต สาขาวิชาการจัดการมรดกวัฒนธรรมและอตุ สาหกรรมสร้างสรรค์ หน้า 17 จำนวนหน่วยกิต\nรหัสวิชา ชื่อรายวิชา\n(บรรยาย – ปฏิบัติ – ศึกษาดว้ยตนเอง)\nจวอ. 326 การพัฒนาและการจัดการมรดกทางวัฒนธรรมเชิงบูรณาการ 3(3-0-6)\nHIM 326 Integrated Cultural Heritage Management and\nDevelopment\nจวอ. 328 การจัดการข้อมูลดิจิทัลทางวัฒนธรรม 3(3-0-6)\nHIM 328 Management of Digitalized Data for Culture\nจวอ. 329 การจัดการภูมิทัศน์วัฒนธรรม 3(3-0-6)\nHIM 329 Cultural Landscape Management\nจวอ. 426 การจัดการการท่องเที่ยววัฒนธรรม 3(3-0-6)\nHIM 426 Cultural Tourism Management\nจวอ. 427 การจัดการพิพิธภัณฑ์และแหล่งเรียนรู้ทางวัฒนธรรม 3(3-0-6)\nHIM 427 Museum and Cultural Learning Center Management\nจวอ. 428 การจัดการมรดกเมือง 3(3-0-6)\nHIM 428 Urban Heritage Management\nหมวดอุตสาหกรรมสร้างสรรค์\nจำนวนหน่วยกิต\nรหัสวิชา ชื่อรายวิชา\n(บรรยาย – ปฏิบัติ – ศึกษาดว้ยตนเอง)\nจวอ. 336 อุตสาหกรรมสร้างสรรค์ในบริบทสากล 3(3-0-6)\nHIM 336 Global Creative Industries\nจวอ. 337 อุตสาหกรรมภาพยนตร์ โลกาภิวัตน์ และอัตลักษณ์ 3(3-0-6)\nHIM 337 Film Industry, Globalization and Identities\nจวอ. 338 อุตสาหกรรมโทรทัศน์และสื่อใหม่ในยุคดิจิทัล 3(3-0-6)\nHIM 338 Television Industry and New Media in the Digital Era\nจวอ. 339 ศิลปะการแสดง: จากวัฒนธรรมสู่อุตสาหกรรม 3(3-0-6)\nHIM 339 Performing Arts: from Culture to Industry\nจวอ. 437 การจัดการศิลปะการแสดง 3(3-0-6)\nHIM 437 Performing Arts Management\nจวอ. 438 การจัดการศิลปิน 3(3-0-6)\nHIM 438 Artist Management\nจวอ. 439 การจัดการผู้ชม 3(3-0-6)\nHIM 439 Audience Management\nมคอ. 2 หลักสูตรศิลปศาสตรบัณฑิต สาขาวิชาการจัดการมรดกวัฒนธรรมและอตุ สาหกรรมสร้างสรรค์ หน้า 18 3) วิชาเลือกเสรี 9 หน่วยกิต\nนักศึกษาสามารถเลือกศึกษาวิชาใดก็ได้ที่เปิดสอนในมหาวิทยาลัยธรรมศาสตร์วิชาเลือก\nเสรีหรือเลือกศึกษาจากวิชาที่คณะเปิดสอนจำนวนไม่น้อยกว่า 9 หน่วยกิต\nนักศึกษาไม่สามารถนำรายวิชาในหลักสูตรวิชาศึกษาทั่วไปที่รหัสระดับ 100 ไปนับ\nวิชาเลือกเสรีหรือวิชาเลือกหรือวิชาโท\nนักศึกษาไม่สามารถนำรายวิชาเลือกเสรีที่หลักสูตรเปิดสอนไปวิชาเลือกได้\nวิชาเลือกเสรีที่คณะเปิดสอนมีดังนี้\nจำนวนหน่วยกิต\nรหัสวิชา ชื่อรายวิชา\n(บรรยาย – ปฏิบัติ – ศึกษาดว้ยตนเอง)\nจวอ. 396 การเขียนเชิงสร้างสรรค์เพื่องานวัฒนธรรม 3(3-0-6)\nHIM 396 Creative Writings for Culture\nจวอ. 397 การสร้างแบรนด์สินค้าทางวัฒนธรรมเพื่อการจัดการมรดก 3(3-0-6)\nวัฒนธรรมและอุตสาหกรรมสร้างสรรค์\nHIM 397 Brand Product for Management of Cultural Heritage\nand Creative Industries\nจวอ. 398 ผู้ประกอบการทางวัฒนธรรมและอุตสาหกรรมสร้างสรรค์ 3(3-0-6)\nHIM 398 Entrepreneurship in Culture and Creative Industries\nจวอ. 399 นวัตกรรมการจัดการแฟชั่นในยุคดิจิทัล 3(3-0-6)\nHIM 399 Innovation of Fashion Management in Digital Era\nจวอ. 496 การออกแบบและสร้างสรรค์สื่อใหม่ 3(3-0-6)\nHIM 496 Design and Creativity for New Media\nจวอ. 497 การออกแบบนิทรรศการ 3(3-0-6)\nHIM 497 Exhibition Design\nจวอ. 498 ธุรกิจดนตรี 3(3-0-6)\nHIM 498 Music Business\nจวอ. 499 หัวข้อเฉพาะในการจัดการมรดกวัฒนธรรมและอุตสาหกรรม 3(3-0-6)\nสร้างสรรค์\nHIM 499 Selected Topics in Management of Cultural\nHeritage and Creative Industries\nมคอ. 2 หลักสูตรศิลปศาสตรบัณฑิต สาขาวิชาการจัดการมรดกวัฒนธรรมและอตุ สาหกรรมสร้างสรรค์ หน้า 19 4.3.2.3 แสดงแผนการศึกษา\nปีการศึกษาที่ 1 | ภาคเรียนที่ 1\nมธ. 101 โลก อาเซียน และไทย 3 หน่วยกิต\nมธ. 103 ชีวิตกับความยั่งยืน 3 หน่วยกิต\nศศ.101 การคิด อ่าน และเขียนอย่างมีวิจารณญาณ 3 หน่วยกิต\nสษ. 105 ทักษะการสื่อสารทางภาษาอังกฤษ 3 หน่วยกิต\nจวอ. 200 แนวคิดและทฤษฎีด้านมรดกวัฒนธรรมและอุตสาหกรรมสร้างสรรค์ 3 หน่วยกิต\nจวอ. 203 อารยธรรม การเปลี่ยนแปลงและนวัตกรรม 3 หน่วยกิต\nรวม 18 หน่วยกิต\nปีการศึกษาที่ 1 | ภาคเรียนที่ 2\nมธ. 100 พลเมืองกับการลงมือแก้ปัญหา 3 หน่วยกิต\nมธ. 102 ชีวิตกับสุนทรียภาพ 3 หน่วยกิต\nมธ. 106 ความคิดสร้างสรรค์และการสื่อสาร 3 หน่วยกิต\nมธ. 201 ความรู้ทางการเงินสำหรับบุคคล 3 หน่วยกิต\nจวอ. 202 ศิลปะเพื่อการสร้างสรรค์นวัตกรรม 3 หน่วยกิต\nจวอ. 204 มานุษยวิทยาประยุกต์เพื่อการจัดการมรดกวัฒนธรรมและอุตสาหกรรม 3 หน่วยกิต\nสร้างสรรค์\nรวม 18 หน่วยกิต\nปีการศึกษาที่ 2 | ภาคเรียนที่ 1\nมธ. 107 ทักษะดิจิทัลกับการแก้ปัญหา 3 หน่วยกิต\nมธ. 109 นวัตกรรมกับกระบวนการคิดผู้ประกอบการ 3 หน่วยกิต\nจวอ. 201 การบัญชีและการเงินเพื่อการจัดการมรดกวัฒนธรรมและอุตสาหกรรม 3 หน่วยกิต\nสร้างสรรค์\nจวอ. 212 การจัดการทรัพยากรทางวัฒนธรรม 3 หน่วยกิต\nจวอ. 214 สื่อและวัฒนธรรมเชิงวิพากษ์ 3 หน่วยกิต\nวิชาบังคับเลือก 1 3 หน่วยกิต\nรวม 18 หน่วยกิต\nมคอ. 2 หลักสูตรศิลปศาสตรบัณฑิต สาขาวิชาการจัดการมรดกวัฒนธรรมและอตุ สาหกรรมสร้างสรรค์ หน้า 20 ปีการศึกษาที่ 2 | ภาคเรียนที่ 2\nจวอ. 205 หลักเศรษฐศาสตร์เพื่อการจัดการมรดกวัฒนธรรมและอุตสาหกรรม 3 หน่วยกิต\nสร้างสรรค์\nจวอ. 210 หลักการตลาดเพื่อการจัดการมรดกวัฒนธรรมและอุตสาหกรรม 3 หน่วยกิต\nสร้างสรรค์\nจวอ. 215 ทัศนวัฒนธรรมร่วมสมัย 3 หน่วยกิต\nจวอ. 230 กระบวนการสร้างสรรค์และการผลิตในอุตสาหกรรมสื่อ 3 หน่วยกิต\nจวอ. 320 การจัดการมรดกภูมิปัญญาทางวัฒนธรรม 3 หน่วยกิต\nวิชาบังคับเลือก 2 3 หน่วยกิต\nรวม 18 หน่วยกิต\nปีการศึกษาที่ 3 | ภาคเรียนที่ 1\nจวอ. 304 กลยุทธ์การจัดการเพื่อมรดกวัฒนธรรมและอุตสาหกรรมสร้างสรรค์ 3 หน่วยกิต\nจวอ. 301 การจัดการความรู้และความคิดสร้างสรรค์ 3 หน่วยกิต\nจวอ. 303 การจัดการโครงการทางมรดกวัฒนธรรมและอุตสาหกรรมสร้างสรรค์ 3 หน่วยกิต\nจวอ. 313 การสื่อสารข้ามวัฒนธรรม 3 หน่วยกิต\nวิชาบังคับเลือก 3 3 หน่วยกิต\nวิชาเลือก 3 หน่วยกิต\nรวม 18 หน่วยกิต\nปีการศึกษาที่ 3 | ภาคเรียนที่ 2\nจวอ. 300 นโยบายทางวัฒนธรรม 3 หน่วยกิต\nจวอ. 302 ระเบียบวิธีวิจัยเพื่อการจัดการทางมรดกวัฒนธรรมและอุตสาหกรรม 3 หน่วยกิต\nสร้างสรรค์\nจวอ. 340 ภาษาอังกฤษเพื่อการจัดการทางมรดกวัฒนธรรมและอุตสาหกรรม 3 หน่วยกิต\nสร้างสรรค์\nวิชาเลือก 6 หน่วยกิต\nวิชาเลือกเสรี 3 หน่วยกิต\nรวม 18 หน่วยกิต\nมคอ. 2 หลักสูตรศิลปศาสตรบัณฑิต สาขาวิชาการจัดการมรดกวัฒนธรรมและอตุ สาหกรรมสร้างสรรค์ หน้า 21 ปีการศึกษาที่ 4 | ภาคเรียนที่ 1\nจวอ. 400 การศึกษาเฉพาะเรื่อง 3 หน่วยกิต\nจวอ. 410 กฎหมายและจริยธรรมในการจัดการมรดกวัฒนธรรมและอุตสาหกรรม 3 หน่วยกิต\nสร้างสรรค์\nวิชาเลือก 6 หน่วยกิต\nวิชาเลือกเสรี 6 หน่วยกิต\nรวม 18 หน่วยกิต\nปีการศึกษาที่ 4 | ภาคเรียนที่ 2\nจวอ. 411 การฝึกปฏิบัติงานด้านการจัดการมรดกวัฒนธรรมและอุตสาหกรรม 3 หน่วยกิต\nสร้างสรรค์\nรวม 3 หน่วยกิต\n4.3.2.4 คำอธิบายรายวิชา\nวิชาศึกษาทั่วไป\nหมวดความเท่าทันโลกและสังคม\nมธ.101 โลก อาเซียน และไทย 3(3-0-6)\nTU101 Thailand, ASEAN, and the World\nศึกษาปรากฏการณ์ที่สำคัญของโลก อาเซียนและไทย ในมิติทางการเมือง เศรษฐกิจ สังคม\nวัฒนธรรม โดยใช้กรอบแนวคิด ทฤษฎี และระเบียบวิจัยทางสังคมศาสตร์ ผ่านการอภิปรายและ\nยกตัวอย่างสถานการณ์หรือบุคคลที่ได้รับความสนใจ เพื่อให้เกิดมุมมองต่อความหลากหลายและเข้า\nใจความซับซ้อนที่สัมพันธ์กันทั้งโลก มีจิตสำนึกสากล (Global Mindset) สามารถท้าทายกรอบความเชื่อ\nเดิมและเปิดโลกทัศน์ใหม่ให้กว้างขวางขึ้น\nStudy of significant phenomena around the world, in the ASEAN region and in\nThailand in terms of their political, economic and sociocultural dimensions. This is done\nthrough approaches, theories and principles of social science research via discussion and\nraising examples of situations or people of interest. The purpose of this is to create a\nperspective of diversity, to understand the complexity of global interrelationships, to\nbuild a global mindset and to be able to challenge old paradigms and open up a new,\nbroader worldview.\nมคอ. 2 หลักสูตรศิลปศาสตรบัณฑิต สาขาวิชาการจัดการมรดกวัฒนธรรมและอตุ สาหกรรมสร้างสรรค์ หน้า 22 มธ.109 นวัตกรรมกับกระบวนคิดผู้ประกอบการ 3(3-0-6)\nTU109 Innovation and Entrepreneurial mindset\nการประเมินความเสี่ยงและการสร้างโอกาสใหม่การคิดและการวางแผนแบบผู้ประกอบการ\nการตัดสินใจและการพัฒนาธุรกิจ การสื่อสารเชิงธุรกิจและการสร้างแรงจูงใจอย่างมีประสิทธิภาพ การ\nสร้างคุณค่าร่วมเพื่อสังคม\nRisk assessment and creating new opportunities. Thinking and planning as an\nentrepreneur. Decision making and entrepreneurial venture development. Business\ncommunication for delivering concept or initiative in an efficient, effective and\ncompelling manner. Social shared value creation.\nหมวดสุนทรียะและทักษะการสื่อสาร\nมธ.102 ชีวิตกับสุนทรียภาพ 3(3-0-6)\nTU102 Life & Aesthetics\nสุนทรียภาพและองค์ประกอบพื้นฐานของงานศิลปะและสภาพแวดล้อมสรรค์สร้าง ความซาบซึ้ง\nใน คุณค่าและความหมาย การวิเคราะห์วิพากษ์ และการเชื่อมโยงเข้ากับชีวิตตนเองและบริบททางสังคม\nThe course investigates aesthetic and fundamental elements of art and built\nenvironment. These include appreciation in value and meaning, analyses and criticisms,\nand connections to lives and social contexts.\nศศ.101 การคิด อ่าน และเขียนอย่างมีวิจารณญาณ 3(3-0-6)\nLAS101 Critical Thinking, Reading, and Writing\nพัฒนาทักษะการคิดอย่างมีวิจารณญาณผ่านการตั้งคำถาม การวิเคราะห์ การสังเคราะห์ และ\nการประเมินค่า พัฒนาทักษะการอ่านเพื่อจับสาระสำคัญ เข้าใจจุดมุ่งหมาย ทัศนคติสมมติฐาน หลักฐาน\nสนับสนุน การใช้เหตุผลที่นำไปสู่ข้อสรุปของงานเขียน พัฒนาทักษะการเขียนแสดงความคิดเห็นอย่างมี\nเหตุผลและการเขียนเชิงวิชาการ รู้จักถ่ายทอดความคิด และเชื่อมโยงข้อมูลเข้ากับมุมมองของตนเอง\nรวมถึงสามารถอ้างอิงหลักฐานและข้อมูลมาใช้ในการสร้างสรรค์งานเขียนได้อย่างมีประสิทธิภาพ\nDevelopment of critical thinking through questioning, analytical, synthetic and\nevaluation skills. Students learn how to read without necessarily accepting all the\ninformation presented in the text, but rather consider the content in depth, taking into\naccount the objectives, perspectives, assumptions, bias and supporting evidence, as well\nas logic or strategies leading to the author’s conclusion. The purpose is to apply these\nmethods to students’ own persuasive writing based on information researched from\nvarious sources, using effective presentation techniques.\nมคอ. 2 หลักสูตรศิลปศาสตรบัณฑิต สาขาวิชาการจัดการมรดกวัฒนธรรมและอตุ สาหกรรมสร้างสรรค์ หน้า 23 สษ.105 ทักษะการสื่อสารทางภาษาอังกฤษ 3(3-0-6)\nEL105 English Communication Skills\nพัฒนาทักษะการสื่อสารทางภาษาอังกฤษด้านการฟัง พูด อ่าน และเขียน ฝึกการใช้ภาษา\nคำศัพท์ และสำนวนในบริบททางวิชาการ และสังคม\nDevelopment of English communication skills, including listening, speaking,\nreading and writing. Practice of language, vocabulary and expressions used in academic\nand social contexts.\nมธ.106 ความคิดสร้างสรรค์และการสื่อสาร 3(3-0-6)\nTU106 Creativity and Communication\nกระบวนการคิดอย่างสร้างสรรค์ โดยมีการคิดเชิงวิพากษ์องค์ประกอบสำคัญ และการ\nสื่อสารความคิดดังกล่าวให้เกิดผลสัมฤทธิ์อย่างเหมาะสมตามบริบทสังคม วัฒนธรรม สภาพแวดล้อม ทั้งใน\nระดับบุคคล องค์กร และสังคม\nCreative thought processes, with critical thinking as an important part, as well as\ncommunication of these thoughts that lead to suitable results in social, cultural and\nenvironmental contexts, at personal, organizational and social levels\nหมวดคณิตศาสตร์ วิทยาศาสตร์และเทคโนโลยี\nมธ.103 ชีวิตกับความยั่งยืน 3(3-0-6)\nTU103 Life and Sustainability\nการดำเนินชีวิตอย่างเท่าทันกับการเปลี่ยนแปลงของโลก เข้าใจความสัมพันธ์ระหว่างพลวัต ของ\nธรรมชาติมนุษย์ และสรรพสิ่ง ทั้งสิ่งแวดล้อมสรรสร้าง การใช้พลังงาน เศรษฐกิจ สังคมในความขัดแย้ง\nและการแปรเปลี่ยน ตลอดจนองค์ความรู้ทางวิทยาศาสตร์สิ่งแวดล้อม ที่นำไปสู่การปรับเปลี่ยนวิถีชีวิตสู่\nความยั่งยืน\nThis course provides an introduction to the importance of life-cycle systems\nperspectives in understanding major challenges and solutions to achieving more\nsustainable societies in this changing world. Students will learn about the relationship\nbetween mankind and the environment in the context of energy and resource use,\nconsumption and development, and environmental constraints. Furthermore, an\nexamination of social conflict and change from the life-cycle perspective will be used to\ndevelop an understanding of potential solution pathways for sustainable lifestyle\nmodifications.\nมคอ. 2 หลักสูตรศิลปศาสตรบัณฑิต สาขาวิชาการจัดการมรดกวัฒนธรรมและอตุ สาหกรรมสร้างสรรค์ หน้า 24 มธ.107 ทักษะดิจิทัลกับการแก้ปัญหา 3(3-0-6)\nTU107 Digital Skill and Problem Solving\nทักษะการคิดเชิงคำนวณเพื่อการแก้ปัญหาและการพัฒนาโอกาสใหม่ด้านสังคมและเศรษฐกิจ\nความสามารถในค้นหาและการเข้าถึงสารสนเทศได้อย่างมีประสิทธิภาพ การประเมินความน่าเชื่อถือของ\nสารสนเทศ การกลั่นกรองและจัดการสารสนเทศอย่างระบบ การใช้และจรรยาบรรณด้านดิจิทัล การ\nสื่อสารออนไลน์อย่างมืออาชีพ\nBasic computational thinking skill for solving problems and developing new\nsocial and economic opportunities. Efficient access and search for information.\nInformation reliability evaluation. Filtering and managing information systematically.\nEthical digital usage and professional online communication.\nหมวดสุขภาวะและทักษะแห่งอนาคต\nมธ.201 ความรู้ทางการเงินสำหรับบุคคล 3(3-0-6)\nTU201 Financial Literacy for Individuals\nเรียนรู้พื้นฐาน หลักการ ความสำคัญและแนวทางวางแผนการเงินเพื่อเป้าหมายชีวิตการใช้\nเครื่องมือทาง การเงิน รวมทั้งเทคนิคต่างๆ ประกอบด้วย เทคนิคการค้นหาตนเอง เทคนิคการวางแผน\nการเงินทั้ง รู้หา รู้เก็บ รู้ใช้ และรู้ขยายดอกผล เทคนิคการจัดสรรเงินออมและการลงทุนแบบ DCA เทคนิค\nบริหารจัดการหนี้ เทคนิคการเพิ่ม เงินออม เทคนิคในการวางแผนประหยัดภาษีเงินได้บุคคลธรรมดา\nตลอดจนหลักการและความสำคัญของปรัชญา เศรษฐกิจพอเพียงต่อสังคมไทย เพื่อน้อมนำมาประยุกต์ใช้\nในการดำรงชีวิต\nTo learn the foundations, principles, importance and guidelines of financial\nplanning for life goals, the uses of financial instruments, together with self-discovery\ntechniques, financial planning techniques including how to earn, collect, use and invest\nmoney, savings allocation and DCA investment techniques, debt management\ntechniques, savings increase techniques, personal income tax saving planning\ntechniques as well as the principles and importance of the Sufficiency Economy\nPhilosophy in Thai society in order to be applied in living.\nมคอ. 2 หลักสูตรศิลปศาสตรบัณฑิต สาขาวิชาการจัดการมรดกวัฒนธรรมและอตุ สาหกรรมสร้างสรรค์ หน้า 25 หมวดการบริการสังคมและการเรียนรู้จากการปฏิบัติ\nมธ.100 พลเมืองกับการลงมือแก้ปัญหา 3(3-0-6)\nTU100 Civic Engagement\nปลูกฝังจิตสำนึก บทบาท และหน้าที่ความรับผิดชอบของการสมาชิกที่ดีของสังคมในฐานะ\nพลเมืองโลก ผ่านกระบวนการหลากหลายวิธี เช่น การบรรยาย การอภิปรายกรณีศึกษาต่างๆ ดูงาน\nต้น โดยนักศึกษาจะต้องจัดทำโครงการรณรงค์ เพื่อให้เกิดการรับรู้หรือเกิดการเปลี่ยนแปลง ในประเด็นที่\nสนใจ\nInstillation of social conscience and awareness of one’s role and duties as a\ngood global citizen. This is done through a variety of methods such as lectures,\ndiscussion of various case studies and field study outings. Students are required to\norganize a campaign to raise awareness or bring about change in an area of their interest.\nมคอ. 2 หลักสูตรศิลปศาสตรบัณฑิต สาขาวิชาการจัดการมรดกวัฒนธรรมและอตุ สาหกรรมสร้างสรรค์ หน้า 26 วิชาเฉพาะ\nวิชาบังคับ\nจวอ. 200 แนวคิดและทฤษฎีด้านมรดกวัฒนธรรมและอุตสาหกรรม\n3(3-0-6)\nสร้างสรรค์\nHIM 200 Concepts and Theories of Cultural Heritage and\nCreative Industries\nความรู้พื้นฐานเกี่ยวกับนิยามของวัฒนธรรมแนวคิดและทฤษฎีทางวัฒนธรรมที่สำคัญเพื่อ\nพื้นฐานสำหรับการจัดการมรดกวัฒนธรรมและอุตสาหกรรมสร้างสรรค์\nBasic knowledge related to definitions of culture, key concepts and theories for\nmanaging cultural heritage and creative industries.\nจวอ. 201 การบัญชีและการเงินเพื่อการจัดการมรดกวัฒนธรรมและ\n3(3-0-6)\nอุตสาหกรรมสร้างสรรค์\nHIM 201 Accounting and Finance for Management of\nCultural Heritage and Creative Industries\nศึกษาหลักการบัญชีและการเงินเบื้องต้น งบการเงินแต่ละประเภท สัดส่วนทางการเงิน การ\nวิเคราะห์จุดคุ้มทุน และการกำหนดราคา กรณีศึกษาการนำจุดคุ้มทุนมากำหนดราคาในงานมรดก\nวัฒนธรรมและอุตสาหกรรมสร้างสรรค์\nFundamental principle of accounting and finance, financial statements, financial\nratio, analysis of breakeven point and pricing, case studies of pricing for cultural heritage\nand creative industries.\nจวอ. 202 ศิลปะเพื่อการสร้างสรรค์นวัตกรรม 3(3-0-6)\nHIM 202 Art for Creative Innovation\nศิลปะและวิวัฒนาการโดยสังเขป ตั้งแต่ศิลปะสมัยก่อนประวัติศาสตร์ ศิลปะตะวันตก ศิลปะ\nตะวันออก รวมถึงศิลปะไทย อันสะท้อนภูมิหลังทางสังคมและประวัติศาสตร์ ความเชื่อ สุนทรียศาสตร์\nและความคิดสร้างสรรค์ในฐานะทรัพย์สินทางปัญญาเพื่อสร้างสรรค์นวัตกรรม\nThe synopsis evolution of prehistoric, western, eastern, and Thai art, reflecting\nsocial and historical background, beliefs, aesthetic, and creativity as intellect properties\nto design innovation.\nมคอ. 2 หลักสูตรศิลปศาสตรบัณฑิต สาขาวิชาการจัดการมรดกวัฒนธรรมและอตุ สาหกรรมสร้างสรรค์ หน้า 27 จวอ. 203 อารยธรรม การเปลี่ยนแปลงและนวัตกรรม 3(3-0-6)\nHIM 203 Civilization, Transformation, and Innovation\nพัฒนาการอารยธรรมที่สำคัญ ทั้งอารยธรรมตะวันตก อารยธรรมตะวันออก ตลอดจนเหตุการณ์\nสำคัญของโลก อันมีผลต่อการเปลี่ยนแปลงและสร้างสรรค์นวัตกรรมแห่งยุคสมัย\nThe significant evolution of the western and eastern civilizations including the\nremarkable global incidents unavoidably impacting the transformation and innovation\ndesign of the era.\nจวอ. 204 มานุษยวิทยาประยุกต์เพื่อการจัดการมรดกวัฒนธรรมและ\n3(3-0-6)\nอุตสาหกรรมสร้างสรรค์\nHIM 204 Applied Anthropology for Management of Cultural\nHeritage and Creative Industries\nแนวคิดทางมานุษยวิทยาวัฒนธรรมที่ใช้ในการอธิบายปรากฏการณ์สังคมและวัฒนธรรมในมิติต่าง\nๆ ซึ่งนำไปสู่การเข้าใจอย่างระบบ และเชื่อมโยงความสัมพันธ์ของปัจเจกกับสังคมและวัฒนธรรมใน\nระดับที่กว้างขวางขึ้นท่ามกลางกระแสโลกาภิวัตน์\nConcepts of cultural anthropology for explaining and understanding the social\nand cultural phenomena systematically, as well as a wide understanding of relations\nbetween individual, society and culture in globalization.\nจวอ. 205 หลักเศรษฐศาสตร์เพื่อการจัดการมรดกวัฒนธรรมและ\n3(3-0-6)\nอุตสาหกรรมสร้างสรรค์\nHIM 205 Principles of Economics for Management of\nCultural Heritage and Creative Industries\nทฤษฎีเศรษฐศาสตร์เบื้องต้นประกอบไปด้วย เศรษฐศาสตร์จุลภาค และ เศรษฐศาสตร์มหภาค\nเพื่อความเข้าใจพฤติกรรม บุคคล บริษัท ผู้ซื้อ ผู้ขาย ภาครัฐ รวมทั้ง การดำเนินกิจกรรมต่างๆในตลาดที่\nเกี่ยวข้องกับงานมรดกวัฒนธรรมและอุตสาหกรรมสร้างสรรค์ รวมทั้งแนวคิดเบื้องต้นทางเศรษฐศาสตร์\nเพื่อการจัดการทางวัฒนธรรม\nFundamental theory of economics consisting of principles of microeconomics\nand macroeconomics. To understand the behavior of individuals, companies, buyers,\nvendors, government, activities in the market relating to cultural heritage and creative\nindustries. The course will also include basic concepts in economics for cultural\nmanagement.\nมคอ. 2 หลักสูตรศิลปศาสตรบัณฑิต สาขาวิชาการจัดการมรดกวัฒนธรรมและอตุ สาหกรรมสร้างสรรค์ หน้า 28 จวอ. 210 หลักการตลาดเพื่อการจัดการมรดกวัฒนธรรมและ\n3(3-0-6)\nอุตสาหกรรมสร้างสรรค์\nHIM 210 Marketing Principles for Management of Cultural\nHeritage and Creative Industries\nแนวคิดและทฤษฎีการตลาด การวิจัยการตลาด การแบ่งส่วนทางการตลาด การเลือก\nกลุ่มเป้าหมาย การจัดวางตำแหน่งผลิตภัณฑ์ การสื่อสารทางการตลาดแบบผสมผสาน การจัดทำแผนการ\nตลาด กลยุทธ์การตลาด และการสร้างตราสินค้าเพื่อการจัดการมรดกวัฒนธรรมและอุตสาหกรรม\nสร้างสรรค์\nMarketing concepts and principles, marketing research, market segmentation,\nidentifying a target market, market positioning, integrated marketing communication,\nmarketing plan, marketing strategy and branding for cultural heritage and creative\nindustries management.\nจวอ. 212 การจัดการทรัพยากรทางวัฒนธรรม 3(3-0-6)\nHIM 212 Cultural Resource Management\nแนวคิดและทฤษฎีเกี่ยวกับการจัดการทรัพยากรทางวัฒนธรรม หลักและกระบวนการในการ\nจัดการทรัพยากรทางวัฒนธรรมอย่างยั่งยืน การศึกษาเปรียบเทียบแนวทางการจัดการทรัพยากรทาง\nวัฒนธรรมในยุคสมัยปัจจุบันได้อย่างเหมาะสม ตระหนักถึงคุณค่าและความสำคัญของทรัพยากรทาง\nวัฒนธรรม และใช้ทรัพยากรทางวัฒนธรรมให้เกิดประโยชน์สูงสุด\nConcepts and theories related to cultural resource management, principles and\nprocedures in sustainable cultural resource management, a study on a suitable way of\ncultural resource management in current situation including awareness raising of values\nand significance in cultural resource management, as well as fully using of cultural\nresources.\nจวอ. 214 สื่อและวัฒนธรรมเชิงวิพากษ์ 3(3-0-6)\nHIM 214 Critical Media and Cultural Studies\nทฤษฎีวิพากษ์ที่เกี่ยวข้องกับสื่อและวัฒนธรรม เพื่อนำมาวิเคราะห์ความสัมพันธ์ระหว่างสื่อ และ\nวัฒนธรรมได้อย่างระบบ อันจะเปิดเผยให้เห็นอำนาจนำ มายาคติวาทกรรมและการสร้างภาพตัวแทน\nในมิติต่าง ๆ และวิเคราะห์ผู้รับสาร เพื่อศึกษาการต่อรองความหมายของผู้บริโภคที่มีความแตกต่างด้าน\nเพศ อายุ ชนชั้นอันจะสะท้อนการสร้างอัตลักษณ์ผ่านสื่อ\nCritical theory concerning culture and media to analyze their relationship\nsystematically revealing hegemony, myth discourse and representation in various\nมคอ. 2 หลักสูตรศิลปศาสตรบัณฑิต สาขาวิชาการจัดการมรดกวัฒนธรรมและอตุ สาหกรรมสร้างสรรค์ หน้า 29 contexts, and analyze message receivers with diverse backgrounds in gender, age and\nclass reflecting identity construction and negotiation of meaning.\nจวอ. 215 ทัศนวัฒนธรรมร่วมสมัย 3(3-0-6)\nHIM 215 Contemporary Visual Culture\nการศึกษาและฝึกทักษะการมองเพื่อตีความและวิเคราะห์ภาพประเภทต่าง ๆ ในรูปแบบ\nวัฒนธรรมศึกษา ที่จะแสดงให้เห็นทั้งบทบาท นัยทางสังคมและอำนาจจากการมองและภาพ บนพื้นฐาน\nทฤษฎีเชิงวิพากษ์บูรณาการกับทฤษฎีที่เกี่ยวข้องแบบสหวิทยาการ\nThe study and practice of gaze to interpret and analyze various types of images in\nform of cultural studies revealing roles, social implication, and power both of gaze and\nimages based on the critical theories associated with related theories in interdisciplinary\naspects.\nจวอ. 230 กระบวนการสร้างสรรค์และการผลิตในอุตสาหกรรมสื่อ 3(3-0-6)\nHIM 230 Creative Process and Production in Media Industries\nกระบวนการสร้างสื่อสร้างสรรค์ประเภทต่าง ๆ โดยเริ่มต้นจากความคิดสร้างสรรค์จนนำไปสู่\nการผลิตสื่อ ที่คำนึงถึงทั้งมิติด้านวัฒนธรรมและธุรกิจ เรียนรู้ประสบการณ์ในวิชาชีพจากศิลปินที่มี\nความสามารถและองค์กรที่โดดเด่น เพื่อเข้าใจกระบวนการผลิตสื่อสร้างสรรค์ และสามารถริเริ่มสื่อ\nสร้างสรรค์ได้ในอนาคต\nCreative practices in creative media, knowledge to transform creative ideas into\nmedia production, which are considered to meet both culture and commercial aspects,\nengage in professional experiences with talented artists and outstanding organizations,\nunderstand how creative works are generated so that students will be able to initiate\ntheir own creative media in the future.\nจวอ. 300 นโยบายทางวัฒนธรรม 3(3-0-6)\nHIM 300 Cultural Policy\nแนวคิดและทฤษฎีนโยบายทางวัฒนธรรม ที่มา กระบวนการสร้าง การกำหนดนโยบาย การ\nปฏิบัติการประเมินผลและผลกระทบของนโยบายทางวัฒนธรรมต่อผู้มีส่วนได้ส่วนเสีย องค์กรทาง\nวัฒนธรรม และสังคม พร้อมเรียนรู้จากกรณีศึกษานโยบายทางวัฒนธรรมระดับประเทศและนานาชาติ\nConcepts and theories of cultural policy, rationale and process of formulation,\nimplementation and evaluation of cultural policy and the impacts of cultural policy to\nมคอ. 2 หลักสูตรศิลปศาสตรบัณฑิต สาขาวิชาการจัดการมรดกวัฒนธรรมและอตุ สาหกรรมสร้างสรรค์ หน้า 30 stakeholders, cultural organizations, and society, as well as case studies of cultural\npolicies both in national and international levels\nจวอ. 301 การจัดการความรู้และความคิดสร้างสรรค์ 3(3-0-6)\nHIM 301 Knowledge and Creativity Management\nหลักการจัดการความรู้วิเคราะห์ ออกแบบ และพัฒนาระบบจัดการความรู้ด้วยเทคโนโลยี\nสารสนเทศและสื่อสมัยใหม่จากบุคคล องค์กร/สถาบันทางวัฒนธรรมและอุตสาหกรรมสร้างสรรค์ นำสู่\nกระบวนการในการพัฒนาให้เกิดความคิดสร้างสรรค์และนำองค์ความรู้ไปใช้ให้เกิดประโยชน์สูงสุดในการ\nจัดการมรดกวัฒนธรรมและอุตสาหกรรมสร้างสรรค์\nPrinciples of knowledge management, analysis, design and development of\nknowledge management by using information technology and moden media contributed\nby individual, cultural and creative industries organizations and imstitutions, the process\nof developing creative thinking and the application of its concept to create innovation\nfor cultural heritage and creative industries management.\nจวอ. 302 ระเบียบวิธีวิจัยเพื่อการจัดการทางมรดกวัฒนธรรมและ\n3(3-0-6)\nอุตสาหกรรมสร้างสรรค์\nHIM 302 Research Methodology for Management of Cultural\nHeritage and Creative Industries\nลักษณะและงานวิจัยด้านการจัดการทางวัฒนธรรม ตลอดจนแนวโน้มและระเบียบวิธีวิจัยทาง\nวัฒนธรรมทั้งเชิงปริมาณและเชิงคุณภาพ การประยุกต์ใช้แนวคิดและทฤษฎีด้านการจัดการทางวัฒนธรรม\nมาใช้ในการสร้างโจทย์และการออกแบบงานวิจัยหรือโครงการทางวัฒนธรรม การฝึกฝนการทำวิจัยหรือ\nโครงการทางวัฒนธรรม\nCharacteristics and trends of research methodologies in cultural management,\nboth quantitatively and qualitatively, application of the concepts and theories of cultural\nmanagement to assign research problem and design cultural research or project, practice\nconducting research or project in culture.\nจวอ. 303 การจัดการโครงการทางมรดกวัฒนธรรมและอุตสาหกรรม\n3(3-0-6)\nสร้างสรรค์\nHIM 303 Project Management for Cultural Heritage and\nCreative Industries\nมคอ. 2 หลักสูตรศิลปศาสตรบัณฑิต สาขาวิชาการจัดการมรดกวัฒนธรรมและอตุ สาหกรรมสร้างสรรค์ หน้า 31 แนวทางโครงการทางวัฒนธรรม โดยบูรณาการแนวคิดและประยุกต์เครื่องมือด้านการจัดการ\nโครงการอย่างระบบ เพื่อจัดทำและดำเนินการโครงการทางวัฒนธรรม การวิเคราะห์ข้อมูล วางแผน\nสร้างสรรค์แนวทางกิจกรรมทางวัฒนธรรมซึ่งมีความสอดคล้องกับบริบทสังคมและวัฒนธรรมและความ\nต้องการของกลุ่มเป้าหมายที่เกี่ยวข้อง การประมาณการ จนถึงการจัดการความเปลี่ยนแปลง และการ\nประเมินผล\nConcepts of cultural projects; applying instruments of project management\nsystematically and holistically to conduct and implement cultural projects; analyze data,\nplan and develop cultural activities which are accord with social-cultural contexts and\nstakeholders, project estimation, including change management and evaluatation.\nจวอ. 304 กลยุทธ์การจัดการเพื่อมรดกวัฒนธรรมและอุตสาหกรรมสร้างสรรค์ 3(3-0-6)\nHIM 304 Strategic Management for Cultural Heritage and Creative Industries\nแนวคิดและพัฒนาการการจัดการองค์การ หลักและกระบวนการของการจัดการเชิงกลยุทธ์ ตั้งแต่\nการกำหนดวิสัยทัศน์และพันธกิจ การวิเคราะห์สภาพแวดล้อมภายในและภายนอก การกำหนดกลยุทธ์\nการปฏิบัติ และการติดตามประเมินผล เพื่อสร้างความได้เปรียบในเชิงแข่งขันและประยุกต์ใช้ในงานด้าน\nมรดกวัฒนธรรมและอุตสาหกรรมสร้างสรรค์\nConcepts and development of organization management, principles, and\nprocesses of strategic management, including identifying vision and mission, analyzing\nexternal and internal environment, strategy formulation, implementation, and evaluation\nto create competitive advantages that are applied to cultural heritage and creative\nindustries.\nจวอ. 313 การสื่อสารข้ามวัฒนธรรม 3(3-0-6)\nHIM 313 Cross-Cultural Communication\nความหมายและบทบาทของการสื่อสารข้ามวัฒนธรรม อิทธิพลหรือองค์ประกอบทางวัฒนธรรม\nแบบแผนการสื่อสารทางวัจนะภาษา และอวัจนะภาษา จริยธรรมและปัญหาการสื่อสาร ข้ามวัฒนธรรม\nและการสื่อสารข้ามวัฒนธรรมในสถานการณ์พหุวัฒนธรรมและในยุคโลกาภิวัตน์เพื่อความเข้าใจและ\nเคารพในความหลากหลายทางวัฒนธรรม\nMeaning and role of cross-cultural communication. Cultural influence and\ncomponent. Verbal patterns and non-verbal communication patterns. ethics and\nproblems of cross-cultural communication. cross-cultural communication in multicultural\nsituations and in the age of globalization. For understanding and respecting cultural\ndiversity\nมคอ. 2 หลักสูตรศิลปศาสตรบัณฑิต สาขาวิชาการจัดการมรดกวัฒนธรรมและอตุ สาหกรรมสร้างสรรค์ หน้า 32 จวอ. 320 การจัดการมรดกภูมิปัญญาทางวัฒนธรรม 3(3-0-6)\nHIM 320 Intangible Cultural Heritage Management\nหลักการจัดการมรดกภูมิปัญญาทางวัฒนธรรม ประเภท พัฒนาการ และกระบวนการสงวน\nรักษามรดกภูมิปัญญาทางวัฒนธรรมทั้งในระดับประเทศและนานาชาติ เพื่อสร้างความตระหนักถึงคุณค่า\nและความสำคัญของมรดกภูมิปัญญาทางวัฒนธรรม สู่การบริหารจัดการได้อย่างเหมาะสมและยั่งยืน\nPrinciples of intangible cultural heritage management, domains, development,\nand safeguarding of intangible cultural heritage at both national and international levels.\nAwareness raising of its values and significances leading to the appropriate and\nsustainable management.\nจวอ. 340 ภาษาอังกฤษเพื่อการจัดการทางมรดกวัฒนธรรมและ\n3(3-0-6)\nอุตสาหกรรมสร้างสรรค์\nHIM 340 English for Management of Cultural Heritage and\nCreative Industries\nการพัฒนาทักษะภาษาอังกฤษที่จำเพื่อเตรียมพร้อมสำหรับการเข้าสู่วิชาชีพและวิชาการด้าน\nการจัดการวัฒนธรรม โดยเน้นการฝึกฝนทักษะการฟัง การพูด การอ่าน และการเขียนที่เกี่ยวข้องประเด็น\nปัจจุบันด้านมรดกทางวัฒนธรรมและอุตสาหกรรมสร้างสรรค์\nDevelopment of essential English skills in professional and academic preparation for\ncultural management. The emphasis on the practical skills of listening, speaking, reading,\nand writing involving the current issues of cultural heritage and creative industries.\nจวอ. 400 การศึกษาเฉพาะเรื่อง 3(1-4-4)\nHIM 400 Special Project\nศึกษาค้นคว้าอิสระเฉพาะบุคคลที่มีเนื้อหาเกี่ยวข้องกับงานบริหารงานศิลปวัฒนธรรมตามความ\nถนัดและความสนใจของนักศึกษา ภายใต้การดูแลของอาจารย์ที่ปรึกษาหรือออกแบบแผนโครงการ\nวัฒนธรรมทั้งด้านมรดกวัฒนธรรมและอุตสาหกรรมสร้างสรรค์ โดยใช้เทคนิคและทฤษฎีต่างๆที่เกี่ยวข้อง\nกับการจัดการวัฒนธรรม การศึกษาความไปได้การดำเนินการตามแผนโดยจัดหาทุนและการ\nสนับสนุน จัดทำงบประมาณ การวิเคราะห์โครงการ ประเมินและนำเสนอผลสรุปของโครงการ การวัดผล\nการศึกษาแบ่งออก 2 ระดับ คือ S (ผ่าน) และ U (ไม่ผ่าน)\nIndividual study with concepts and approach of cultural management relied on\nlearners’ interest and skill advised by advisor or Designing plan for cultural project\nincluding both cultural heritage and creative industries, using techniques and theories\nมคอ. 2 หลักสูตรศิลปศาสตรบัณฑิต สาขาวิชาการจัดการมรดกวัฒนธรรมและอตุ สาหกรรมสร้างสรรค์ หน้า 33 that are related to cultural management, feasibility analysis, implementation by\nfundraising and finding other supports, budgeting, project analysis, evaluation and\npresentation of project results. Assessment is graded into 2 grades: S (Satisfactory) and U\n(Unsatisfactory).\nจวอ. 410 กฎหมายและจริยธรรมในการจัดการมรดกวัฒนธรรมและ\n3(3-0-6)\nอุตสาหกรรมสร้างสรรค์\nHIM 410 Laws and Ethics in Management of Cultural Heritage\nand Creative Industries\nกฎหมายและหลักจริยธรรมทั้งในระดับประเทศและระหว่างประเทศที่เกี่ยวข้องกับการจัดการ\nมรดกวัฒนธรรมและอุตสาหกรรมสร้างสรรค์ การแลกเปลี่ยนความรู้และประสบการณ์กับผู้เชี่ยวชาญ\nประเด็นที่เกี่ยวข้อง ตลอดจนการสร้างสำนึกและการนำหลักกฎหมายและหลักจริยธรรมไปปฏิบัติในการ\nจัดการมรดกวัฒนธรรมและอุตสาหกรรมสร้างสรรค์\nLaws and codes of ethics at both national and international level which are\nrelated to management of cultural heritage and creative industries, exchanges of\nknowledge and experience with experts, relevant issues, including awareness and\nimplementation of laws and ethical practices in management of cultural heritage and\ncreative industries.\nจวอ. 411 การฝึกปฏิบัติงานด้านการจัดการมรดกวัฒนธรรมและ\n3 (ฝึกงาน 250 ชั่วโมง)\nอุตสาหกรรมสร้างสรรค์\nHIM 411 Internship for Cultural Heritage Management and\n3 (Training 250 hrs.)\nCreative Industries\nการฝึกปฏิบัติงานภายในองค์กรที่เหมาะสมและเกี่ยวข้องเพื่อบูรณาการองค์ความรู้สู่ทักษะการทำ\nงานพร้อมจัดทำรายงานการฝึกปฏิบัติการวัดผลการศึกษามี 2 ระดับ คือ S (ผ่าน) และ U (ไม่ผ่าน)\nPracticum in proper and related organizations to integrate body of knowledge\ninto skills with practicum report and assessment will be 2 levels : S (Satisfactory) and U\n(Unsatisfactory).\nวิชาบังคับเลือก\nจวอ. 250 ทักษะการสื่อสารภาษาและวัฒนธรรมเขมรเบื้องต้น 3(3-0-6)\nHIM 250 Basic Communicative Skills on Khmer Language and\nCulture\nมคอ. 2 หลักสูตรศิลปศาสตรบัณฑิต สาขาวิชาการจัดการมรดกวัฒนธรรมและอตุ สาหกรรมสร้างสรรค์ หน้า 34 ฝึกทักษะการฟัง การพูด การอ่าน และการเขียนที่จำต่อการสื่อสารภาษาเขมรพื้นฐานผ่าน\nการเรียนรู้และความเข้าใจสังคมและวัฒนธรรมเขมร\nPracticing listening, speaking, reading, and writing skills which are essential for the\nbasic Khmer communication through a learning and comprehension of Khmer culture\nand society.\nจวอ. 350 ทักษะการสื่อสารภาษาและวัฒนธรรมเขมรระดับกลาง 3(3-0-6)\nHIM 350 Intermediate Communicative Skills on Khmer\nLanguage and Culture\nวิชาบังคับก่อน: สอบได้วิชา จวอ. 250\nฝึกทักษะการสื่อสารภาษาเขมรอย่างมีประสิทธิภาพด้านการฟัง การพูด การอ่าน และการเขียน\nเพิ่มเติมผ่านการเรียนรู้และความเข้าใจสังคมและวัฒนธรรมเขมร\nPre-requisite: passed HIM 250\nBroadening effective communication skills of Khmer in listening, speaking,\nreading, and writing at the intermediate level through a learning and comprehension of\nKhmer culture and society.\nจวอ. 370 ทักษะการสื่อสารภาษาและวัฒนธรรมเขมรระดับสูง 3(3-0-6)\nHIM 370 Advanced Communicative Skills on Khmer\nLanguage and Culture\nวิชาบังคับก่อน: สอบได้จวอ. 350\nเพิ่มพูนทักษะการสื่อสารภาษาเขมรระดับสูงด้านการฟัง การพูด การอ่าน และการเขียนผ่าน\nการเรียนรู้และความเข้าใจสังคมและวัฒนธรรมเขมร\nPre-requisite: passed HIM 350\nEnhancing advanced communication skills of Khmer in listening, speaking,\nreading, and writing through a learning and comprehension of Khmer culture and society.\nจวอ. 251 ทักษะการสื่อสารภาษาและวัฒนธรรมพม่าเบื้องต้น 3(3-0-6)\nHIM 251 Basic Communicative Skills on Burmese Language\nand Culture\nฝึกทักษะการฟัง การพูด การอ่าน และการเขียนที่จำต่อการสื่อสารภาษาพม่าพื้นฐานผ่าน\nการเรียนรู้และความเข้าใจสังคมและวัฒนธรรมพม่า\nมคอ. 2 หลักสูตรศิลปศาสตรบัณฑิต สาขาวิชาการจัดการมรดกวัฒนธรรมและอตุ สาหกรรมสร้างสรรค์ หน้า 35 Practicing listening, speaking, reading, and writing skills which are essential for\nthe basic Burmese communication through a learning and comprehension of Burmese\nculture and society.\nจวอ. 351 ทักษะการสื่อสารภาษาและวัฒนธรรมพม่าระดับกลาง 3(3-0-6)\nHIM 351 Intermediate Communicative Skills\non Burmese Language and Culture\nวิชาบังคับก่อน: สอบได้วิชา จวอ. 251\nฝึกทักษะการสื่อสารภาษาพม่าอย่างมีประสิทธิภาพด้านการฟัง การพูด การอ่าน และการเขียน\nเพมิ่ เติมผ่านการเรียนรู้และความเข้าใจสังคมและวัฒนธรรมพม่า\nPre-requisite: passed HIM 251\nBroadening effective communication skills of Burmese in listening, speaking,\nreading, and writing at the intermediate level through a learning and comprehension of\nBurmese culture and society.\nจวอ. 371 ทักษะการสื่อสารภาษาและวัฒนธรรมพม่าระดับสูง 3(3-0-6)\nHIM 371 Advanced Communicative Skills on Burmese\nLanguage and Culture\nวิชาบังคับก่อน: สอบได้จวอ. 351\nเพิ่มพูนทักษะการสื่อสารภาษาพม่าระดับสูงด้านการฟัง การพูด การอ่าน และการเขียนผ่าน\nการเรียนรู้และความเข้าใจสังคมและวัฒนธรรมพม่า\nPre-requisite: passed HIM 351\nEnhancing advanced communication skills of Burmese in listening, speaking,\nreading, and writing through a learning and comprehension of Burmese culture and\nsociety.\nจวอ. 252 ทักษะการสื่อสารภาษาและวัฒนธรรมมลายูเบื้องต้น 3(3-0-6)\nHIM 252 Basic Communicative Skills on Malay Language and\nCulture\nฝึกทักษะการฟัง การพูด การอ่าน และการเขียนที่จำต่อการสื่อสารภาษามลายูพื้นฐานผ่าน\nการเรียนรู้และความเข้าใจสังคมและวัฒนธรรมมลายู\nมคอ. 2 หลักสูตรศิลปศาสตรบัณฑิต สาขาวิชาการจัดการมรดกวัฒนธรรมและอตุ สาหกรรมสร้างสรรค์ หน้า 36 Practicing listening, speaking, reading, and writing skills which are essential for\nthe basic Malay communication through a learning and comprehension of Malay culture\nand society.\nจวอ. 352 ทักษะการสื่อสารภาษาและวัฒนธรรมมลายูระดับกลาง 3(3-0-6)\nHIM 352 Intermediate Communicative Skills on Malay\nLanguage and Culture\nวิชาบังคับก่อน: สอบได้วิชา จวอ. 252\nฝึกทักษะการสื่อสารภาษามลายูอย่างมีประสิทธิภาพด้านการฟัง การพูด การอ่าน และการ\nเขียนเพิ่มเติมผ่านการเรียนรู้และความเข้าใจสังคมและวัฒนธรรมมลายู\nPre-requisite: passed HIM 252\nBroadening effective communication skills of Malay in listening, speaking,\nreading, and writing at the intermediate level through a learning and comprehension of\nMalay culture and society.\nจวอ. 372 ทักษะการสื่อสารภาษาและวัฒนธรรมมลายูระดับสูง 3(3-0-6)\nHIM 372 Advanced Communicative Skills on Malay Language\nand Culture\nวิชาบังคับก่อน: สอบได้จวอ. 352\nเพิ่มพูนทักษะการสื่อสารภาษามลายูระดับสูงด้านการฟัง การพูด การอ่าน และการเขียนผ่าน\nการเรียนรู้และความเข้าใจสังคมและวัฒนธรรมมลายู\nPre-requisite: passed HIM 352\nEnhancing advanced communication skills of Malay in listening, speaking,\nreading, and writing through a learning and comprehension of Malay culture and society.\nจวอ. 253 ทักษะการสื่อสารภาษาและวัฒนธรรมเวียดนามเบื้องต้น 3(3-0-6)\nHIM 253 Basic Communicative Skills on Vietnamese\nLanguage and Culture\nฝึกทักษะการฟัง การพูด การอ่าน และการเขียนที่จำต่อการสื่อสารภาษาเวียดนามพื้นฐาน\nผ่านการเรียนรู้และความเข้าใจสังคมและวัฒนธรรมเวียดนาม\nPracticing listening, speaking, reading, and writing skills which are essential for\nthe basic Vietnamese communication through a learning and comprehension of\nVietnamese culture and society.\nมคอ. 2 หลักสูตรศิลปศาสตรบัณฑิต สาขาวิชาการจัดการมรดกวัฒนธรรมและอตุ สาหกรรมสร้างสรรค์ หน้า 37 จวอ. 353 ทักษะการสื่อสารภาษาและวัฒนธรรมเวียดนามระดับกลาง 3(3-0-6)\nHIM 353 Intermediate Communicative Skills on Vietnamese\nLanguage and Culture\nวิชาบังคับก่อน: สอบได้วิชา จวอ. 253\nฝึกทักษะการสื่อสารภาษาเวียดนามอย่างมีประสิทธิภาพด้านการฟัง การพูด การอ่าน และการ\nเขียนเพิ่มเติมผ่านการเรียนรู้และความเข้าใจสังคมและวัฒนธรรมเวียดนาม\nPre-requisite: passed HIM 253\nBroadening effective communication skills of Vietnamese in listening, speaking,\nreading, and writing at the intermediate level through a learning and comprehension of\nVietnamese culture and society.\nจวอ. 373 ทักษะการสื่อสารภาษาและวัฒนธรรมเวียดนามระดับสูง 3(3-0-6)\nHIM 373 Advanced Communicative Skills on Vietnamese\nLanguage and Culture\nวิชาบังคับก่อน: สอบได้จวอ. 353\nเพิ่มพูนทักษะการสื่อสารภาษาเวียดนามระดับสูงด้านการฟัง การพูด การอ่าน และการเขียน\nผ่านการเรียนรู้และความเข้าใจสังคมและวัฒนธรรมเวียดนาม\nPre-requisite: passed HIM 353\nEnhancing advanced communication skills of Vietnamese in listening, speaking,\nreading, and writing through a learning and comprehension of Vietnamese culture and\nsociety.\nจวอ. 254 ทักษะการสื่อสารภาษาและวัฒนธรรมลาวเบื้องต้น 3(3-0-6)\nHIM 254 Basic Communicative Skills on Lao Language and\nCulture\nฝึกทักษะการฟัง การพูด การอ่าน และการเขียนที่จำต่อการสื่อสารภาษาลาวพื้นฐานผ่าน\nการเรียนรู้และความเข้าใจสังคมและวัฒนธรรมลาว\nPracticing listening, speaking, reading, and writing skills which are essential for\nthe basic Lao communication through a learning and comprehension of Lao culture and\nsociety.\nมคอ. 2 หลักสูตรศิลปศาสตรบัณฑิต สาขาวิชาการจัดการมรดกวัฒนธรรมและอตุ สาหกรรมสร้างสรรค์ หน้า 38 จวอ. 354 ทักษะการสื่อสารภาษาและวัฒนธรรมลาวระดับกลาง 3(3-0-6)\nHIM 354 Intermediate Communicative Skills on Lao\nLanguage and Culture\nวิชาบังคับก่อน: สอบได้วิชา จวอ. 254\nฝึกทักษะการสื่อสารภาษาลาวอย่างมีประสิทธิภาพด้านการฟัง การพูด การอ่าน และการเขียน\nเพิ่มเติมผ่านการเรียนรู้และความเข้าใจสังคมและวัฒนธรรมลาว\nPre-requisite: passed HIM 254\nBroadening effective communication skills of Lao in listening, speaking, reading,\nand writing at the intermediate level through a learning and comprehension of Lao\nculture and society.\nจวอ. 374 ทักษะการสื่อสารภาษาและวัฒนธรรมลาวระดับสูง 3(3-0-6)\nHIM 374 Advanced Communicative Skills on Lao Language\nand Culture\nวิชาบังคับก่อน: สอบได้จวอ. 354\nเพิ่มพูนทักษะการสื่อสารภาษาลาวระดับสูงด้านการฟัง การพูด การอ่าน และการเขียนผ่านการ\nเรียนรู้และความเข้าใจสังคมและวัฒนธรรมลาว\nPre-requisite: passed HIM 354\nEnhancing advanced communication skills of Lao in listening, speaking, reading,\nand writing through a learning and comprehension of Lao culture and society.\nจวอ. 255 ทักษะการสื่อสารภาษาและวัฒนธรรมอินโดนีเซียเบื้องต้น 3(3-0-6)\nHIM 255 Basic Communicative Skills on Indonesian Language\nand Culture\nฝึกทักษะการฟัง การพูด การอ่าน และการเขียนที่จำต่อการสื่อสารภาษาอินโดนีเซีย\nพื้นฐานผ่านการเรียนรู้และความเข้าใจสังคมและวัฒนธรรมอินโดนีเซีย\nPracticing listening, speaking, reading, and writing skills which are essential for\nthe basic Indonesian communication through a learning and comprehension of\nIndonesian culture and society.\nจวอ. 355 ทักษะการสื่อสารภาษาและวัฒนธรรมอินโดนีเซียระดับกลาง 3(3-0-6)\nHIM 355 Intermediate Communicative Skills on Indonesian\nLanguage and Culture\nมคอ. 2 หลักสูตรศิลปศาสตรบัณฑิต สาขาวิชาการจัดการมรดกวัฒนธรรมและอตุ สาหกรรมสร้างสรรค์ หน้า 39 วิชาบังคับก่อน: สอบได้วิชา จวอ. 255\nฝึกทักษะการสื่อสารภาษาอินโดนีเซียอย่างมีประสิทธิภาพด้านการฟัง การพูด การอ่าน และ\nการเขียนเพิ่มเติมผ่านการเรียนรู้และความเข้าใจสังคมและวัฒนธรรมอินโดนีเซีย\nPre-requisite: passed HIM 255\nBroadening effective communication skills of Indonesian in listening, speaking,\nreading, and writing at the intermediate level through a learning and comprehension of\nIndonesian culture and society.\nจวอ. 375 ทักษะการสื่อสารภาษาและวัฒนธรรมอินโดนีเซียระดับสูง 3(3-0-6)\nHIM 375 Advanced Communicative Skills on Indonesian\nLanguage and Culture\nวิชาบังคับก่อน: สอบได้จวอ. 355\nเพิ่มพูนทักษะการสื่อสารภาษาอินโดนีเซียระดับสูงด้านการฟัง การพูด การอ่าน และการ\nเขียนผ่านการเรียนรู้และความเข้าใจสังคมและวัฒนธรรมอินโดนีเซีย\nPre-requisite: passed HIM 355\nEnhancing advanced communication skills of Indonesian in listening, speaking,\nreading, and writing through a learning and comprehension of Indonesian culture and\nsociety.\nจวอ. 260 ทักษะการสื่อสารภาษาและวัฒนธรรมจีนเบื้องต้น 3(3-0-6)\nHIM 260 Basic Communicative Skills on Chinese Language\nand Culture\nฝึกทักษะการฟัง การพูด การอ่าน และการเขียนที่จำต่อการสื่อสารภาษาจีนพื้นฐานผ่าน\nการเรียนรู้และความเข้าใจสังคมและวัฒนธรรมจีน\nPracticing listening, speaking, reading, and writing skills which are essential for\nthe basic Chinese communication through a learning and comprehension of Chinese\nculture and society.\nจวอ. 360 ทักษะการสื่อสารภาษาและวัฒนธรรมจีนระดับกลาง 3(3-0-6)\nHIM 360 Intermediate Communicative Skills on Chinese\nLanguage and Culture\nวิชาบังคับก่อน: สอบได้วิชา จวอ. 260\nมคอ. 2 หลักสูตรศิลปศาสตรบัณฑิต สาขาวิชาการจัดการมรดกวัฒนธรรมและอตุ สาหกรรมสร้างสรรค์ หน้า 40 ฝึกทักษะการสื่อสารภาษาจีนอย่างมีประสิทธิภาพด้านการฟัง การพูด การอ่าน และการเขียน\nเพิ่มเติมผ่านการเรียนรู้และความเข้าใจสังคมและวัฒนธรรมจีน\nPre-requisite: passed HIM 260\nBroadening effective communication skills of Chinese in listening, speaking,\nreading, and writing at the intermediate level through a learning and comprehension of\nChinese culture and society.\nจวอ. 380 ทักษะการสื่อสารภาษาและวัฒนธรรมจีนระดับสูง 3(3-0-6)\nHIM 380 Advanced Communicative Skills on Chinese\nLanguage and Culture\nวิชาบังคับก่อน: สอบได้จวอ. 360\nเพิ่มพูนทักษะการสื่อสารภาษาจีนระดับสูงด้านการฟัง การพูด การอ่าน และการเขียนผ่านการ\nเรียนรู้และความเข้าใจสังคมและวัฒนธรรมจีน\nPre-requisite: passed HIM 360\nEnhancing advanced communication skills of Chinese in listening, speaking,\nreading, and writing through a learning and comprehension of Chinese culture and\nsociety.\nจวอ. 261 ทักษะการสื่อสารภาษาและวัฒนธรรมเกาหลีเบื้องต้น 3(3-0-6)\nHIM 261 Basic Communicative Skills on Korean Language\nand Culture\nฝึกทักษะการฟัง การพูด การอ่าน และการเขียนที่จำต่อการสื่อสารภาษาเกาหลีพื้นฐานผ่าน\nการเรียนรู้และความเข้าใจสังคมและวัฒนธรรมเกาหลี\nPracticing listening, speaking, reading, and writing skills which are essential for the\nbasic Korean communication through a learning and comprehension of Korean culture\nand society.\nจวอ. 361 ทักษะการสื่อสารภาษาและวัฒนธรรมเกาหลีระดับกลาง 3(3-0-6)\nHIM 361 Intermediate Communicative Skills on Korean\nLanguage and Culture\nวิชาบังคับก่อน: สอบได้วิชา จวอ. 261\nฝึกทกัษะการสื่อสารภาษาเกาหลีอย่างมีประสิทธิภาพด้านการฟัง การพูด การอ่าน และการเขียน\nเพิ่มเติมผ่านการเรียนรู้และความเข้าใจสังคมและวัฒนธรรมเกาหลี\nมคอ. 2 หลักสูตรศิลปศาสตรบัณฑิต สาขาวิชาการจัดการมรดกวัฒนธรรมและอตุ สาหกรรมสร้างสรรค์ หน้า 41 Pre-requisite: passed HIM 261\nBroadening effective communication skills of Korean in listening, speaking,\nreading, and writing at the intermediate level through a learning and comprehension of\nKorean culture and society.\nจวอ. 381 ทักษะการสื่อสารภาษาและวัฒนธรรมเกาหลีระดับสูง 3(3-0-6)\nHIM 381 Advanced Communicative Skills on Korean\nLanguage and Culture\nวิชาบังคับก่อน: สอบได้จวอ. 361\nเพิ่มพูนทักษะการสื่อสารภาษาเกาหลีระดับสูงด้านการฟัง การพูด การอ่าน และการเขียนผ่าน\nการเรียนรู้และความเข้าใจสังคมและวัฒนธรรมเกาหลี\nPre-requisite: passed HIM 361\nEnhancing advanced communication skills of Korean in listening, speaking,\nreading, and writing through a learning and comprehension of Korean culture and\nsociety.\nวิชาเลือก\nหมวดมรดกทางวัฒนธรรม\nจวอ. 227 การจัดการมรดกทางโบราณคดี 3(3-0-6)\nHIM 227 Archaeological Heritage Management\nการประยุกต์แนวคิด ทฤษฎีการจัดการมรดกทางโบราณคดีเพื่อการวางแผน สำรวจ ค้นคว้า\nประเมินความสำคัญ การอนุรักษ์ รวมถึงการสื่อความหมายและเผยแพร่ตลอดจนสร้างความร่วมมือกับ\nองค์การที่เกี่ยวข้องโดยเน้นการจัดการที่คำนึงถึงการมีส่วนร่วมของผู้มีส่วนได้ส่วนเสีย และเจ้าของมรดก\nโบราณคดี โดยคงไว้ซึ่งความหลากหลายทางอัตลักษณ์ และหลักสิทธิทางวัฒนธรรม\nApplying concepts and theories of managing archaeological heritage for\nplanning, surveying, significance assessment; conservation including interpretation,\ndissemination, and collaboration with relevant organizations; management which is\nconcerned with related stakeholders, archaeological heritage owners, as well as sustain\nidentity diversity and codes of cultural right\nมคอ. 2 หลักสูตรศิลปศาสตรบัณฑิต สาขาวิชาการจัดการมรดกวัฒนธรรมและอตุ สาหกรรมสร้างสรรค์ หน้า 42 จวอ. 326 การพัฒนาและการจัดการมรดกทางวัฒนธรรมเชิงบูรณาการ 3(3-0-6)\nHIM 326 Integrated Cultural Heritage Management and Development\nบูรณาการหลักและแนวคิดเพื่อการพัฒนาและการจัดการมรดกทางวัฒนธรรม เทคนิค และ\nกระบวนการในการจัดการและการพัฒนามรดกทางวัฒนธรรมที่เสนอโดยองค์การระดับชาติและนานาชาติ\nกลยุทธ์ในการวางแผนการจัดการและการพัฒนามรดกทางวัฒนธรรมอย่างยั่งยืน\nIntegrated principles and concepts for cultural heritage management and\ndevelopment, techniques and processes in cultural heritage development and\nmanagement proposed by national and international organizations, strategic planning for\nsustainable management and development of cultural heritage.\nจวอ. 328 การจัดการข้อมูลดิจิทัลทางวัฒนธรรม 3(3-0-6)\nHIM 328 Management of Digitalized Data for Culture\nแนวคิดและทฤษฎีเกี่ยวกับการจัดการข้อมูลดิจิทัล ลักษณะและประเภทของข้อมูลดิจิทัลทาง\nวัฒนธรรม การจัดการฐานข้อมูลเพื่อการสงวนรักษาและการอนุรักษ์ การประยุกต์ใช้ดิจิทัลเพื่อการเข้าถึง\nมรดกวัฒนธรรมอย่างมีประสิทธิภาพ และเพื่อการจัดการอย่างยั่งยืน\nConcepts and theories related to digitalized data, characteristics, and\nclassification of digitalized data for culture, database management for safeguarding and\npreserving cultural information, as well as application of digitalization to access cultural\nheritage effectively and sustainable management\nจวอ. 329 การจัดการภูมิทัศน์วัฒนธรรม 3(3-0-6)\nHIM 329 Cultural Landscape Management\nแนวคิดเกี่ยวกับภูมิทัศน์วัฒนธรรม ประวัติบทบาทและความสัมพันธ์ระหว่างมรดกวัฒนธรรมที่\nจับต้องได้และภูมิปัญญา ที่แสดงการจัดการ การสงวนรักษาเชิงนโยบายและการอนุรักษ์สังคมและ\nสิ่งแวดล้อมอย่างยั่งยืน\nIntroduction to cultural landscape concepts, evolution roles and the\nconnection between tangible and intangible heritage with the expression of\nmanagement, policies preservation, and social and environmental conservation\nsustainability.\nมคอ. 2 หลักสูตรศิลปศาสตรบัณฑิต สาขาวิชาการจัดการมรดกวัฒนธรรมและอตุ สาหกรรมสร้างสรรค์ หน้า 43 จวอ. 426 การจัดการการท่องเที่ยววัฒนธรรม 3(3-0-6)\nHIM 426 Cultural Tourism Management\nแนวคิดเกี่ยวกับการท่องเที่ยววัฒนธรรม ความสำคัญและบทบาทของการท่องเที่ยว ประเภท\nการท่องเที่ยววัฒนธรรม การตลาด การประเมินศักยภาพแหล่งท่องเที่ยว ผลกระทบ และการจัดการการ\nท่องเที่ยววัฒนธรรมอย่างยั่งยืน\nIntroduction to cultural tourism concept, significance and role of tourism,\ntypology of cultural tourism, marketing, tourism resource assessment, impacts and\nsustainable cultural tourism management\nจวอ. 427 การจัดการพิพิธภัณฑ์และแหล่งเรียนรู้ทางวัฒนธรรม 3(3-0-6)\nHIM 427 Museum and Cultural Learning Center Management\nหลักการจัดการพิพิธภัณฑ์และแหล่งเรียนรู้ทางศิลปวัฒนธรรม ทั้งด้านหน้าที่บทบาท\nโครงสร้าง กระบวนการในการจัดการแหล่งเรียนรู้ทางวัฒนธรรม การจัดการวัตถุจัดแสดง การจัด\nนิทรรศการ การจัดกิจกรรมและการบริการการศึกษาภายในแหล่งเรียนรู้ทางวัฒนธรรมรูปแบบต่าง ๆ\nกลยุทธ์การประชาสัมพันธ์และการสื่อสารการตลาดไปสู่กลุ่มผู้เข้าชม\nPrinciples of management for museums and cultural learning centers to\nunderstand their roles, functions, organization structure and process of management, as\nwell as collections management, exhibition design, event and educational services\nincluding a study of public relation strategies and marketing communication for\naudiences.\nจวอ. 428 การจัดการมรดกเมือง 3(3-0-6)\nHIM 428 Urban Heritage Management\nการศึกษาวิวัฒนาการของเมือง องค์ประกอบเมือง ลักษณะและคุณค่าของมรดกเมือง\nความสัมพันธ์ระหว่างคนและมรดกเมือง หลักการจัดการมรดกเมือง แนวทางการอนุรักษ์และพัฒนามรดก\nเมืองในมิติต่าง ๆ อย่างสร้างสรรค์ ตลอดจนศึกษาผลกระทบจากการพัฒนาและการปรับใช้นโยบายเพื่อ\nความยั่งยืน\nThe study of urban evolution and element, characteristic and value of urban\nheritage, the connection between urbanites and urban heritages, principle of urban\nheritage management, conservation, and development in various contexts with creativity\nincluding development impacts and policy adaptation for sustainability.\nมคอ. 2 หลักสูตรศิลปศาสตรบัณฑิต สาขาวิชาการจัดการมรดกวัฒนธรรมและอตุ สาหกรรมสร้างสรรค์ หน้า 44 หมวดอุตสาหกรรมสร้างสรรค์\nจวอ. 336 อุตสาหกรรมสร้างสรรค์ในบริบทสากล 3(3-0-6)\nHIM 336 Global Creative Industries\nหลักการจัดการ พัฒนาการ นิยาม ประเภทและนโยบายการส่งเสริมอุตสาหกรรมสร้างสรรค์\nของนานาประเทศ ศึกษาและวิเคราะห์ปัจจัยความสำเร็จ เพื่อหาต้นแบบการบริหารจัดการที่สามารถ\nนำมาปรับใช้ในประเทศไทย ทั้งในประเด็นเศรษฐกิจสร้างสรรค์ เมืองสร้างสรรค์ และชนชั้นสร้างสรรค์\nPrinciples, development, definitions, classification and policies of promoting\ncreative industires of many countries, study and analyze key success factors in order to\ndefine models that could possibly be used in those of industries in Thailand, including\nissues of creative economy, creative city and creative class.\nจวอ. 337 อุตสาหกรรมภาพยนตร์ โลกาภิวัตน์ และอัตลักษณ์ 3(3-0-6)\nHIM 337 Film Industry, Globalization and Identities\nพัฒนาการอุตสาหกรรมภาพยนตร์ในบริบทชาติและนานาชาติอัตลักษณ์ของผู้ชมภาพยนตร์แต่ละ\nประเทศ การจัดการอุตสาหกรรมภาพยนตร์ การร่วมทุนและการร่วมสร้างภาพยนตร์ระหว่างประเทศใน\nบริบทโลกาภิวัตน์ การเผยแพร่ภาพยนตร์ในช่องทางต่าง ๆ ทั้งโรงภาพยนตร์ เทศกาลภาพยนตร์ และ\nแพลตฟอร์มวิดีโอสตรีมมิ่ง\nDevelopment of film industries in national and international context, identities of\nfilm audience in each country, management in film industries, co-funding and co-\nproduction of films in global contexts, film distribution in theatres, film festivals and\nvideo streaming platforms.\nจวอ. 338 อุตสาหกรรมโทรทัศน์และสื่อใหม่ในยุคดิจิทัล 3(3-0-6)\nHIM 338 Television Industry and New Media in the Digital Era\nหลักการการจัดการสื่อที่คำนึงถึงผลกำไรและผลประโยชน์สาธารณะ กระบวนการผลิต การจัด\nจำหน่าย การตลาด สภาพแวดล้อมที่มีผลต่ออุตสาหกรรมโทรทัศน์ สื่อข้ามชาติการรวมสื่อ ไปจนถึงการ\nสร้างมูลค่าในสื่อ และความท้าทายของอุตสาหกรรมโทรทัศน์และสื่อใหม่ในยุคดิจิทัล\nConcepts and theories in managing media by considering their stakeholders in\nconsideration of balancing profit and public interest, production, distribution and\nmarketing procedures, environment that affects television industry, transnational media,\nand media convergence, value creation of media content, and challenges of television\nand new media in the digital era.\nมคอ. 2 หลักสูตรศิลปศาสตรบัณฑิต สาขาวิชาการจัดการมรดกวัฒนธรรมและอตุ สาหกรรมสร้างสรรค์ หน้า 45 จวอ. 339 ศิลปะการแสดง: จากวัฒนธรรมสู่อุตสาหกรรม 3(3-0-6)\nHIM 339 Performing Arts: from Culture to Industry\nหลักและพัฒนาการของศิลปะการแสดง นาฏศิลป์ การละคร และการแสดงพื้นบ้าน ความ\nมาของการแสดง ตั้งแต่การแสดงแบบดั้งเดิมจนถึงการแสดงร่วมสมัย วิเคราะห์บริบททางสังคมและ\nวัฒนธรรมที่กระทบต่อเนื้อหา เทคนิค และผู้ชม การพัฒนาศิลปะการแสดงมาอุตสาหกรรมสร้างสรรค์\nPrinciples and evolutions of performing arts including dance, drama and folk\nperformance, the developments of performing arts in both classical and contemporary\nones, analyze how social and cultural factors affect texts, techniques and audiences and\nhow performing arts have been industrialized and are a part of creative industries.\nจวอ. 437 การจัดการศิลปะการแสดง 3(3-0-6)\nHIM 437 Performing Arts Management\nการจัดการศิลปะการแสดง ตั้งแต่การเลือกเนื้อหา รูปแบบของการแสดง การคัดเลือกนักแสดง\nการออกแบบเพื่อการแสดง การกำกับการแสดง การจัดการงานเทศกาลและกิจกรรมประเภทต่างๆ\nรวมถึงการประชาสัมพันธ์ การต่อยอดการแสดงสดไปสู่สื่อออนไลน์\nPerforming arts management including selecting content and form of\nperformance, casting, designing and directing performance, performing art management\nfor festival and events as well as public relation, developing live performance to online\ncontent.\nจวอ. 438 การจัดการศิลปิน 3(3-0-6)\nHIM 438 Artist Management\nการจัดการศิลปินในงานมรดกวัฒนธรรมและอุตสาหกรรมสร้างสรรค์ กระบวนการคัดสรรผู้ที่มี\nความสามารถเพื่อสร้างศิลปินในงานศิลปวัฒนธรรมประเภทต่าง ๆ การสร้างและการจัดการความสามารถ\nและลักษณะเฉพาะตัวของศิลปิน การสืบสานและการถ่ายทอดภูมิปัญญาของศิลปิน ตลอดจนการรักษา\nภาพลักษณ์ประเด็นทางกฎหมาย และกลยุทธ์ในการประชาสัมพันธ์ที่เกี่ยวข้องกับการจัดการศิลปิน\nการจัดการศิลปินเสมือนจริงในยุคดิจิทัล\nArtist management in cultural heritage and creative industries, selecting talented\npersons who can be developed as artists in various fields of arts and culture, creating\nand managing talents and specific characteristics of artists, inheritance of artists' local\nwisdom, maintaining artist image, legal issues, and strategies that relate to artist\nmanagement, and virtual artist management in digital era.\nมคอ. 2 หลักสูตรศิลปศาสตรบัณฑิต สาขาวิชาการจัดการมรดกวัฒนธรรมและอตุ สาหกรรมสร้างสรรค์ หน้า 46 จวอ. 439 การจัดการผู้ชม 3(3-0-6)\nHIM 439 Audience Management\nการจัดการความสัมพันธ์ระหว่างองค์กรกับผู้ชม ลักษณะและธรรมชาติของผู้ชมงานวัฒนธรรม\nและอุตสาหกรรมสร้างสรรค์ ปัจจัยสำคัญในการพัฒนาความสัมพันธ์ระหว่างองค์กรกับผู้ชม การเพิ่ม\nจำนวนผู้ชมและการบริโภคงานวัฒนธรรมที่หลากหลาย โดยอาศัยทักษะด้านการตลาด การประชาสัมพันธ์\nการสื่อสาร และการดูแลกลุ่มผู้ชม\nManagement of relationship between audiences and cultural organizations, key\nfactors to develop relationship between orginzations and audiences, increasing numbers\nof audiences and consumption of cultures by employing marketing, public relations,\ncommunication, and customer relationship management.\nวิชาเลือกเสรี\nจวอ. 396 การเขียนเชิงสร้างสรรค์เพื่องานวัฒนธรรม 3(3-0-6)\nHIM 396 Creative Writings for Culture\nความหมายของงานเขียนเชิงสร้างสรรค์ เรียนรู้ลักษณะของงานเขียนสร้างสรรค์ประเภทต่างๆ\nกระบวนการการเขียนที่เริ่มต้นจากแนวคิดไปจนถึงกลวิธีในการเล่าเรื่อง ฝึกปฏิบัติเขียนงานสร้างสรรค์\nอาทิคอนเทนต์เชิงสร้างสรรค์ บทเพื่ออุตสาหกรรมสร้างสรรค์ และนวนิยายเพื่อเผยแพร่ในรูปแบบ\nสิ่งพิมพ์และสื่อออนไลน์\nDefinitions of creative writing, study characteristics of creative writing, processes\nof creative writing starting from concepts to storytelling techniques, practices in creative\nwriting works such as creative contents, scripts for creative industries, and novels for\npublishing offline and online\nจวอ. 397 การสร้างแบรนด์สินค้าทางวัฒนธรรมเพื่อการจัดการมรดกวัฒนธรรม 3(3-0-6)\nและอุตสาหกรรมสร้างสรรค์\nHIM397 Brand Product for Management of Cultural Heritage\nand Creative Industries\nศึกษาความหมาย ความสำคัญ หลักการจัดการแบรนด์สินค้าทางวัฒนธรรม อัตลักษณ์ วิสัยทัศน์\nแก่นแท้การกำหนดตำแหน่ง และบุคลิกภาพของแบรนด์สินค้าทางวัฒนธรรม วิเคราะห์กลุ่มผู้รับสาร\nเทคนิคและกลยุทธ์การสร้างแบรนด์สินค้าทางวัฒนธรรมอย่างมีประสิทธิภาพ เพื่อให้ที่รู้จัก จดจำ และ\nภักดีตลอดจนการสื่อสารแบรนด์ในเชิงบูรณาการเพื่อสร้างคุณค่าแบรนด์สินค้าทางวัฒนธรรมอย่างยั่งยืน\nDevelopment of brand for cultural product would focus on the study of\ndefinitions, importance, management principles of brand for cultural product, identities,\nมคอ. 2 หลักสูตรศิลปศาสตรบัณฑิต สาขาวิชาการจัดการมรดกวัฒนธรรมและอตุ สาหกรรมสร้างสรรค์ หน้า 47 visions, cores, positioning and personality of brand for cultural product, audience\nanalysis, effective techniques and strategies for development of brand for cultural\nproduct in order for the brand to be recognized, remembered and won customer\nloyalty, as well as to conduct integrated communication to create sustainable values for\nbrand for cultural product.\nจวอ. 398 ผู้ประกอบการทางวัฒนธรรมและอุตสาหกรรมสร้างสรรค์ 3(3-0-6)\nHIM 398 Entrepreneurship in Culture and Creative Industries\nความหมาย แนวคิด ทฤษฎีที่เกี่ยวข้องกับการผู้ประกอบการทางสังคมและวัฒนธรรม\nคุณลักษณะสำคัญของธุรกิจเพื่อสังคม หลักการด้านความยั่งยืนในการประกอบการ และหลักกฎหมายที่\nเกี่ยวข้องกับการผู้ประกอบการทางสังคมและวัฒนธรรม กรณีศึกษาผู้ประกอบการทางสังคมทั้งใน\nและต่างประเทศ\nDefinitions, concepts, and theories that relate to entrepreneurship in society\nand culture, characteristics of social entrepreneur, principles for sustainable\nmanagement, and law principles for being entrepreneur for society and culture, case\nstudies of social entreprenure in Thailand and other countries\nจวอ. 399 นวัตกรรมการจัดการแฟชั่นในยุคดิจิทัล 3(3-0-6)\nHIM 399 Innovation of Fashion Management in Digital Era\nวิวัฒนาการเสื้อผ้าและแฟชั่น บทบาทของแฟชั่นในฐานะการผลิต การดำเนินธุรกิจแฟชั่น\nการออกแบบ การวางแผนการขาย การจัดจำหน่าย การสร้างตราสินค้าและการตลาด และแฟชั่นในฐานะ\nการบริโภคในชีวิตประจำวัน ความต้องการของผู้บริโภคและสุนทรียศาสตร์ในยุคดิจิทัล\nEvolution of textiles and fashion, role of fashion as production, business model,\ndesign, merchandising, distribution, branding and marketing, and fashion as everyday\nconsumption, consumers demand and aesthetic in digital era\nจวอ. 496 การออกแบบและการสร้างสรรค์สื่อใหม่ 3(3-0-6)\nHIM 496 Design and Creativity for New Media\nทฤษฎีและแนวปฏิบัติในการออกแบบสื่อสร้างสรรค์สำหรับสื่อใหม่ในยุคดิจิทัล ความคิด\nสร้างสรรค์และการพัฒนาแนวคิดหลักการออกแบบสื่อ การออกแบบเชิงโต้ตอบในสื่อต่างๆ ในยุคดิจิทัล\nเพื่องานมรดกวัฒนธรรมและอุตสาหกรรมสร้างสรรค์\nมคอ. 2 หลักสูตรศิลปศาสตรบัณฑิต สาขาวิชาการจัดการมรดกวัฒนธรรมและอตุ สาหกรรมสร้างสรรค์ หน้า 48 Theory and practice of creative media design for new media in digital era,\ncreativity & concept development, interactive design for various media of digital era for\ncultural heritage and creative industries.\nจวอ. 497 การออกแบบนิทรรศการ 3(3-0-6)\nHIM 497 Exhibition Design\nหลักพื้นฐานการออกแบบนิทรรศการในพิพิธภัณฑสถานและกิจกรรมต่าง ๆ ที่เน้นการวางแผนใน\nจัดทำนิทรรศการ การออกแบบ การจัดทำโครงการ ทักษะ วิธี และเทคนิคในการนำเสนอนิทรรศการ\nเนื้อหานิทรรศการ การสื่อสารผ่านนิทรรศการ การปฏิสัมพันธ์ระหว่างนิทรรศการและผู้ชม รวมทั้งการ\nนำเสนอ นิทรรศการเพื่อการศึกษาอย่างไม่ทางการ\nFoundations of museum and event exhibition development and design that\nfocused on developing museum exhibition planning, design, project organization,\npresentation skills/ techniques, content, communication, interaction, and informal\neducation.\nจวอ. 498 ธุรกิจดนตรี 3(3-0-6)\nHIM 498 Music Business\nโครงสร้างและกระแสของอุตสาหกรรมดนตรีการจัดการรายได้ระหว่างศิลปิน นักเขียนเพลง\nและเจ้าของทรัพย์สินทางปัญญา การจัดการการแสดงดนตรีการปรับตัวของศิลปินและองค์กรในบริบท\nความเปลี่ยนแปลงของเทคโนโลยี และสื่อใหม่\nStructure and trends of music industry. Revenue management for artists,\nsongwriters, and intellectual property owners. Music festival management. Adaptation on\nchanged context of technology and new media for artists and organizations.\nจวอ. 499 หัวข้อเฉพาะในการจัดการมรดกวัฒนธรรมและอุตสาหกรรมสร้างสรรค์ 3(3-0-6)\nHIM 499 Selected Topics in Management of Cultural Heritage and Creative Industries\nหัวข้อในสถานการณ์ปัจจุบัน เพื่อวิเคราะห์และสร้างองค์ความรู้เพื่อการจัดการมรดกวัฒนธรรม\nและอุตสาหกรรมสร้างสรรค์\nCurrent topics to analyze and develop knowledge bodies for management of\ncultural heritage and creative industries.\nมคอ. 2 หลักสูตรศิลปศาสตรบัณฑิต สาขาวิชาการจัดการมรดกวัฒนธรรมและอตุ สาหกรรมสร้างสรรค์ หน้า 49",
    "หมวดที่ 5": "หมวดที่ 5 การจัดกระบวนการเรียนรู้\nลำดับ ผลลัพธ์การเรียนรู้ของหลักสูตร (PLOs) การจัดกระบวนการเรียนรู้วิธีการวัดและประเมินผล\nด้านความรู้ (Knowledge)\nผู้เรยีนมีความรู้ความเข้าใจเรื่องแนวคิด ทฤษฎี และหลักการด้านการ การบรรยายและการอภิปรายกลุ่ม ประเมินผลจากการแลกเปลี่ยนความ\nK 1\nจัดการทางวัฒนธรรม คิดเห็นของนักศึกษาในชั้นเรียน\nผู้เรยีนมีความรู้ความเข้าใจเรื่องแนวคิดเชิงสร้างสรรค์ หรือการคดิ ใน การใช้กรณีศึกษาต่าง ๆ ในการฝึกทักษะการวิเคราะห์ การ ประเมินผลจากงานที่ไดรั้บมอบหมาย\nK 2\nเชิงสร้างสรรค์ สังเคราะห์ข้อมูล ทั้งงานกลุ่มและงานเดี่ยว\nK 3\nผู้เรยีนมีความรู้ความเข้าใจเรื่องการทำวิจัย การศึกษาดูงานเพื่อเรียนรู้จากผู้มปีระสบการณ์ ประเมินผลจากการสอบย่อย (Quiz)\nและการสอบข้อเขียน\nผู้เรยีนมีความรู้ความเข้าใจในการวางแผนกลยุทธ์การจัดการทาง การเรยีนรู้จากวิทยากรพิเศษและผู้เชี่ยวชาญ ประเมินผลจากการฝึกภาคปฏิบตั ใิน\nK 4\nวัฒนธรรม การจัดการโครงการทางวัฒนธรรม\nผู้เรยีนมีความรู้ความเข้าใจ และสามารถประยุกต์ใช้เทคโนโลยีในการ การมอบหมายงานวิจัย รายงานกลุ่ม รายงานบคุ คล\nK 5\nจัดการทางวัฒนธรรม\nการมอบหมายให้อ่านเอกสารประกอบการเรียนล่วงหน้าเพื่อ\nอภิปรายร่วมกันในชั้นเรียน\nการฝึกภาคปฏิบตัิในการจดัการโครงการทางวัฒนธรรม\nสามารถนำข้อมูลทางเศรษฐกิจที่เกี่ยวข้องกับการจัดการทางวัฒนธรรม การใช้กรณีศึกษาต่าง ๆ ในการฝึกทักษะการวิเคราะห์และ ประเมินผลจากการนำ เสนอผลการ\nK 6\nมาวิเคราะห์เพื่อประยุกต์ใช้ในการจัดการทางวัฒนธรรมได้อย่างมีการสังเคราะห์ข้อมลู ทำงานกลุ่มและการทำงานเดี่ยว\nประสิทธภิาพ\nด้านทักษะ (Skills)\nผู้เรยีนสามารถคดิวิเคราะห์ปัญหาภายใตส้ถานการณ์ต่าง ๆ ได้อย่าง การใช้กรณีศึกษาต่าง ๆ ในการฝึกทักษะการวิเคราะห์และ ประเมินผลจากคณุ ภาพของผลงานที่\nS 1\nมคอ. 2 หลักสูตรศิลปศาสตรบัณฑิต สาขาวิชาการจัดการมรดกวัฒนธรรมและอตุ สาหกรรมสร้างสรรค์ หน้า 50 ลำดับ ผลลัพธ์การเรียนรู้ของหลักสูตร (PLOs) การจัดกระบวนการเรียนรู้วิธีการวัดและประเมินผล\nสร้างสรรค์ การสังเคราะห์ข้อมลู ได้รับมอบหมายทั้งงานกลุ่มและงาน\nเดี่ยว\nS 2\nผู้เรยีนสามารถประเมินผลกระทบจากการดำเนินงานต่าง ๆ และ การศึกษาดูงานเพื่อเรียนรู้จากผู้มปีระสบการณ์ ประเมินผลจากการสอบข้อเขียน\nสามารถนำความรู้มาประยุกต์ใช้ได้ โจทย์ที่ต้องใช้ทักษะทางปัญญาในการ\nวิเคราะห์\nผู้เรยีนสามารถใช้ความรู้ในการแกไ้ขปัญหาเฉพาะหน้าได้อย่างมีการมอบหมายงานค้นคว้าและการนำเสนอรายงานจากการ ประเมินผลจากงานค้นคว้า การฝกึ\nS 3\nประสิทธภิาพ เหมาะสมกับสถานการณ์ ค้นคว้า ปฏิบัติจริง และการสร้างโครงการ\nจำลอง\nS 4\nผู้เรยีนสามารถพัฒนาและสร้างสรรค์องค์ความรสู้หวิทยาการทาง การฝึกปฏิบัติจริงจากการประยุกต์ใช้ความรู้ในแต่ละรายวิชา ประเมินผลจากคณุ ภาพของผลงานที่\nวัฒนธรรม ได้รับมอบหมายทั้งงานกลุ่มและงาน\nเดี่ยว\nสามารถวิเคราะห์ข้อมลู ต่าง ๆ ด้านการเงินและการตลาดเพื่อ การมอบหมายให้อ่านเอกสารประกอบการเรียนล่วงหน้าเพื่อ ทดสอบทักษะการวิเคราะห์ข้อมูลเชิง\nS 5\nประกอบการตัดสินใจในการดำเนนิงานด้านการจัดการทางวัฒนธรรม อภิปรายร่วมกันในชั้นเรียน ตัวเลขโดยการทำรายงานหรือการทำ\nข้อสอบ\nสามารถประยุกต์ใช้เทคโนโลยสีารสนเทศเพื่อเครื่องมือในการ การใช้กรณีศึกษาต่าง ๆ ในการฝึกทักษะการวิเคราะห์และ สามารถประยุกต์ใช้เทคโนโลยี\nS 6\nจัดการและการสื่อสารข้อมลู ต่าง ๆ ได้อย่างเหมาะสมและมีการสังเคราะห์ข้อมลู สารสนเทศเพื่อเครื่องมือในการ\nประสิทธภิาพ จัดการและการสื่อสารข้อมลู ต่าง ๆ\nได้อย่างเหมาะสมและมีประสิทธิภาพ\nด้านจริยธรรม (Ethic)\nE 1\nผู้เรยีนมีความรู้ความเข้าใจเรื่องการอนุรักษ์ศิลปวัฒนธรรมอย่างยั่งยืน การบรรยายและการอภิปรายกลุ่ม ประเมินผลจากความรับผดิชอบใน\nงานที่ได้รับมอบหมาย ทั้งงานกลุ่ม\nมคอ. 2 หลักสูตรศิลปศาสตรบัณฑิต สาขาวิชาการจัดการมรดกวัฒนธรรมและอตุ สาหกรรมสร้างสรรค์ หน้า 51 ลำดับ ผลลัพธ์การเรียนรู้ของหลักสูตร (PLOs) การจัดกระบวนการเรียนรู้วิธีการวัดและประเมินผล\nและงานเดยี่ว\nผู้เรยีนมีความรู้และตระหนักในความรับผิดชอบต่อสังคมและ การศึกษาดูงานเพื่อเรียนรู้จากหนว่ยงานหรือผู้ที่มีประเมินผลจากผลงานที่ได้รับ\nE 2\nวัฒนธรรม ประสบการณ์ มอบหมาย\nสังเกตจากแนวความคิดของนักศึกษา\nที่สะท้อนให้เห็นจากงานที่ได้รับ\nมอบหมายและการอภิปรายในชั้น\nเรียน\nด้านลักษณะบุคคล (Character)\nC 1\nผู้เรยีนมีภาวะความผู้นำและผตู้ามในกลุ่ม ตลอดจนการทำงาน การมอบหมายงานกลุ่มเพื่อฝึกการทำงานร่วมกันทีม ประเมินผลจากความรับผดิชอบใน\nร่วมกันทีม สามารถทำงานร่วมกับผู้อื่นและมีมนุษยสัมพันธ์ที่ดีกบังานที่ได้รับมอบหมายทั้งงานกลุ่มและ\nผู้ร่วมงาน งานเดี่ยว\nผู้เรยีนมีความรับผดิชอบในการกระทำของตนเองและรับผิดชอบงาน การมอบหมายให้อ่านเอกสารประกอบการเรียนล่วงหน้าเพื่อ สังเกตจากการทำงานร่วมกันทีม\nC 2\nกลุ่ม อภิปรายร่วมกันในชั้นเรียน การแสดงความคิดเห็น และการ\nอภิปรายในชั้นเรยีน\nผู้เรยีนมีความกล้าในการแสดงความคิดเห็นและการยอมรับความ การฝึกปฏิบัติจริงกลุ่มจากการประยุกต์ใช้ความรู้ในแต่\nC 3\nคิดเห็นของผู้อื่น ละรายวิชา\nC 4\nสามารถใช้ทักษะทางการสื่อสารได้อย่างชัดเจนและมีประสิทธภิาพ การนำเสนอผลงานทไี่ด้รบัมอบหมายโดยเน้นการใช้ทักษะ ประเมินผลจากการประยุกต์ใช้\nการสื่อสารอย่างชัดเจนและมีประสิทธิภาพ เทคโนโลยีสารสนเทศในการนำเสนอ\nผลงาน\nมคอ. 2 หลักสูตรศิลปศาสตรบัณฑิต สาขาวิชาการจัดการมรดกวัฒนธรรมและอตุ สาหกรรมสร้างสรรค์ หน้า 52",
    "หมวดที่ 6": "หมวดที่ 6 ความพร้อมและศักยภาพในการบริหารจัดการหลักสูตร\nหลักสูตรมีความพร้อมในด้านต่าง ๆ ตามกฎกระทรวงมาตรฐานการจัดการศึกษาระดับอุดมศึกษา\nพ.ศ.2565 ข้อ 6 ที่ประกอบด้วย 4 ด้าน ได้แก่\n6.1 ด้านกายภาพ\nวิทยาลัยนวัตกรรมมีความพร้อมด้านกายภาพ โดยประกอบด้วยห้องเรียน ห้องอเนกประสงค์ ห้อง\nCommon Room สำหรับนักศึกษา ตามรายละเอียดดังนี้\nรายละเอียด จำนวน\n1. ห้องเรียน ขนาด 60 ที่นั่ง 4 ห้อง\n2. ห้องเรียน ขนาด 100 ที่นั่ง 3 ห้อง\n3. ห้องเรียน ขนาด 170 ที่นั่ง 1 ห้อง\n4. ห้องอเนกประสงค์ Innovative 1 ห้อง\n5. ห้อง Common Room 4 ห้อง\n6. ห้องพักอาจารย์ 9 ห้อง\n7. กล้องวงจรปิด CCTV 38 ตำแหน่ง\n8. แม่บ้านดูแลความสะอาด 3 คน\n9. เจ้าหน้าที่รักษาความปลอดภัย 2 คน\nสำหรับสิ่งอำนวยความสะดวกเพื่อการเรียนรู้นักศึกษาสามารถใช้บริการจากสำนักหอสมุด และ\nห้องสมุดคณะต่าง ๆ ทั้งที่ศูนย์ท่าพระจันทร์และศูนย์รังสิต ซึ่งมีตำรา หนังสือทั้งภาษาไทยและ\nภาษาอังกฤษ วารสารภาษาไทยและภาษาอังกฤษ รวมถึงสื่ออิเล็กทรอนิกส์ต่าง ๆ อย่างพอเพียง ดังนี้\nหนังสือภาษาไทย จำนวน 20,994 เล่ม\nหนังสือภาษาอังกฤษ จำนวน 8,323 เล่ม\nวารสาร จำนวน 82 ชื่อ\n- ภาษาไทย จำนวน 40 ชื่อ\n- ภาษาอังกฤษ จำนวน 42 ชื่อ\nโสตทัศนวัสดุประเภทต่าง ๆ จำนวน 700 ชิ้น\nหนังสือพิมพ์ จำนวน 16 ชื่อ\n- ภาษาไทย จำนวน 14 ชื่อ\n- ภาษาอังกฤษ จำนวน 2 ชื่อ\nฐานข้อมูลออนไลน์ จำนวน 19 ฐาน\nวิทยานิพนธ์อิเล็กทรอนิกส์ของ มธ. จำนวน 13,476 เล่ม\nหนังสือหายากอิเล็กทรอนิกส์ จำนวน 361 เล่ม\nมคอ. 2 หลักสูตรศิลปศาสตรบัณฑิต สาขาวิชาการจัดการมรดกวัฒนธรรมและอตุ สาหกรรมสร้างสรรค์ หน้า 53 นักศึกษาสามารถขอใช้บริการได้ที่หอสมุดแห่งชาติสำนักหอสมุดของมหาวิทยาลัยทุกแห่งใน\nส่วนกลาง ห้องสมุดหรือศูนย์เอกสารของหน่วยงานราชการและเอกชน\n6.2 ด้านวิชาการ\n(จำนวนผลงานวิชาการ สิ่งประดิษฐ์ ผลงานอื่น ๆ ของอาจารย์ประจำหลักสูตร ในรอบ 5 ปีย้อนหลัง)\nสัดส่วนอาจารย์ :\nจำนวนผลงานทางวิชาการ\nผลงาน\nจำนวนอาจารย์\nงานวิจัยหรือ ผลงานทางวิชาการอื่น ๆ รวมผลงานทาง\nประจำหลักสูตร\nบทความวิจัย (ชิ้น) เช่น ตำรา หนังสือ/ วิชาการ\n(คน) วิจัย อื่น ๆ\nบทความวิชาการอื่น ๆ ทั้งหมด (ชิ้น)\nสิ่งประดิษฐ์ ต้น (ชิ้น)\n12 3 9 5 1 : 2.4 1 : 2.4\nรวม : 1 : 4.8\n6.3 ด้านการเงินและการบัญชี\n6.3.1 งบอุดหนุนจากคณะ/มหาวิทยาลัย\nวิทยาลัยนวัตกรรมหน่วยงานเงินรายได้การจัดสรรงบประมาณสำหรับหลักสูตรในการบริหาร\nจัดการมาจากเงินรายได้ 100%\n6.3.2 ทุนสนับสนุนการศึกษาอาจารย์และนักศึกษา\nวิทยาลัยนวัตกรรมมีการสนับสนุนทุนประเภทต่าง ๆ สำหรับอาจารย์และนักศึกษา จากกองทุน\n3 ประเภท ดังนี้\n1) กองทุนค่าธรรมเนียมเพื่อการพัฒนาการศึกษา\n2) กองทุนการศึกษาวิทยาลัยนวัตกรรม\n3) กองทุนวิจัยวิทยาลัยนวัตกรรม\n6.3.3 ประมาณการรายได้และค่าใช้จ่ายนักศึกษาของหลักสูตร\nการประมาณการรายได้ของวิทยาลัยกำหนดตามจำนวนเป้ารับนักศึกษาที่กำหนดใน มคอ.2 โดย\nค่าใช้จ่ายแบ่ง ค่าใช้จ่ายคงที่ และค่าใช้จ่ายผันแปร ตามรายละเอียดดังนี้\nปี 2567 ปี 2568 ปี 2569 ปี 2570 ปี 2571\nงบประมาณรายรับ\nต.ค. 66 - ก.ย. 67 ต.ค. 67 - ก.ย. 68 ต.ค. 68 - ก.ย. 69 ต.ค. 69 - ก.ย. 70 ต.ค. 70 - ก.ย. 71\n1 ค่าสมัครสอบ 150,000 150,000 150,000 150,000 150,000\n2 ค่าหน่วยกิต 7,020,000 12,366,000 18,684,000 23,058,000 23,058,000\n3 ค่าธรรมเนียมพิเศษ 3,600,000 6,840,000 10,080,000 13,320,000 13,320,000\n4 ค่าธรรมเนียมการศึกษา 679,200 1,247,280 1,839,660 2,407,740 2,407,740\nรวมรายรับทั้งสิ้น 11,449,200 20,603,280 30,753,660 38,935,740 43,618,740\nมคอ. 2 หลักสูตรศิลปศาสตรบัณฑิต สาขาวิชาการจัดการมรดกวัฒนธรรมและอตุ สาหกรรมสร้างสรรค์ หน้า 54 งบประมาณรายจ่าย ปี 2567 ปี 2568 ปี 2569 ปี 2570 ปี 2571\nค่าใช้จ่ายคงที่ต.ค. 66 - ก.ย. 67 ต.ค. 67 - ก.ย. 68 ต.ค. 68 - ก.ย. 69 ต.ค. 69 - ก.ย. 70 ต.ค. 70 - ก.ย. 71\n1. ค่าตอบแทนบุคลากร 1,961,200 2,885,600 3,894,700 4,656,145 4,676,982\n2. ค่าใช้สอย 1,300,000 1,300,000 1,400,000 1,500,000 1,600,000\n3. ค่าวัสดุ 200,000 200,000 200,000 200,000 200,000\n4. ค่าใช้จ่ายเบ็ดเตลด็ 60,000 60,000 60,000 60,000 60,000\nรวมค่าใช้จ่ายคงที่ทั้งสิ้น 3,521,200 4,445,600 5,554,700 6,416,145 6,536,982\nงบประมาณรายจ่าย ปี 2567 ปี 2558 ปี 2569 ปี 2570 ปี 2571\nค่าใช้จ่ายผันแปร ต.ค. 66 - ก.ย. 67 ต.ค. 67 - ก.ย. 68 ต.ค. 68 - ก.ย. 69 ต.ค. 69 - ก.ย. 70 ต.ค. 70 - ก.ย. 71\n1. ค่าบำรุงมหาวิทยาลัย\n- ค่าหน่วยกิต (นำส่ง 15%) 1,053,000 1,854,900 2,802,600 3,458,700 3,458,700\n- ค่าธรรมเนยีมพิเศษ (นำส่ง\n540,000 1,026,000 1,512,000 1,998,000 1,998,000\n15%)\n2. ค่าธรรมเนียมการศึกษา\n679,200 1,247,280 1,839,660 2,407,740 2,407,740\nนำส่ง 100%\n3. ค่าใช้จ่ายในการ\n420,000 420,000 420,000 420,000 420,000\nปฐมนิเทศ\n4. ค่าจัดทำเอกสาร\n156,000 300,000 456,000 504,000 504,000\nประกอบการสอน\n5. ค่าใช้จ่ายในการปจัฉิม\n- - - - 240,000\nนิเทศ\nรวมค่าใช้จ่ายผันแปรทั้งสิ้น 2,848,200 4,848,180 7,030,260 8,788,440 10,159,440\nค่าใช้จ่ายต่อหัวนักศึกษาตลอดระยะเวลาหลักสูตร คือ 325,680 บาทต่อคน โดยมีการบริหาร\nจัดการโครงการบริการการศึกษา (เพื่อรับปริญญา) (โครงการพิเศษ) นักศึกษามีค่าใช้จ่ายหลักได้แก่\nค่าหน่วยกิต ๆ ละ 1,500 บาท และค่าธรรมเนียมอื่น ๆ ของวิทยาลัยนวัตกรรม รายละเอียดดังนี้\nค่าธรรมเนียมพิเศษ ภาคการศึกษาปกติภาคฤดูร้อน (ถ้ามี)\nสำหรับนักศึกษาไทย (ยกเว้นภาคฤดูร้อน) 10,000 บาท -\nสำหรับนักศึกษาต่างชาติ (ยกเว้นภาคฤดูร้อน) 10,000 บาท -\nทั้งนี้ค่าใช้จ่ายต่อหัวนักศึกษาตลอดระยะเวลาหลักสูตรนี้ยังไม่รวมค่าใช้จ่ายในการศึกษาดูงาน\nต่างประเทศ\nมคอ. 2 หลักสูตรศิลปศาสตรบัณฑิต สาขาวิชาการจัดการมรดกวัฒนธรรมและอตุ สาหกรรมสร้างสรรค์ หน้า 55 6.4 ด้านการบริหารจัดการ\nปัจจุบันวิทยาลัยนวัตกรรมมีบุคลากรสายวิชาการ สายสนับสนุนวิชาการ จำนวน 59 คน ตาม\nรายละเอียดดังนี้\n6.4.1 จำนวนอาจารย์ (ประจำ/พิเศษ)\nพนักงานมหาวิทยาลัย (ส่วนงาน) พนักงานเงินรายได้\n22 คน 8 คน\n6.4.2 จำนวนเจ้าหน้าที่\nพนักงานมหาวิทยาลัย (ส่วนงาน) พนักงานเงินรายได้\n27 คน 2 คน\n6.4.3 กำกับดูแลและประเมินผล\nหลักสูตรมีการกำกับดูแลและประเมินผลของการดำเนินงานโดยคณะกรรมการบริหารหลักสูตร\nประกอบด้วย ผู้อำนวยการหลักสูตร และอาจารย์ประจำหลักสูตร โดยจะมีการประชุมร่วมกันเพื่อหารือ\nประเด็นต่าง ๆ และประเมินผลการดำเนินงานที่ผ่านมา อย่างน้อยภาคการศึกษาละ 2 ครั้ง นอกจากนั้น\nวิทยาลัยนวัตกรรมมีคณะกรรมการบริหารวิชาการ และทำนุบำรุงศิลปะวัฒนธรรม ซึ่งกรรมการ\nประกอบด้วย คณบดีรองคณบดีผู้อำนวยการหลักสูตรทุกหลักสูตร ประชุมหารือในเรื่องต่าง ๆ ประจำ\nทุก ๆ 2 เดือน ซึ่งการติดตามประเมินผลการดำเนินงานของแต่ละหลักสูตร และเปิดโอกาสให้มีเวทีใน\nการหารือนโยบาย แนวปฏิบัติ และประเด็นร่วมต่าง ๆ ระหว่างหลักสูตร\nมคอ. 2 หลักสูตรศิลปศาสตรบัณฑิต สาขาวิชาการจัดการมรดกวัฒนธรรมและอตุ สาหกรรมสร้างสรรค์ หน้า 56 6.5 อาจารย์ผู้รับผิดชอบหลักสูตรและอาจารย์ประจำหลักสูตร\nตำแหน่งทาง สำเร็จการศึกษาจาก\nลำดับที่ชื่อ - สกุล คุณวุฒิสาขาวิชา\nวิชาการ สถาบัน ปีพ.ศ.\n1. อาจารย์ กาญจนา เหล่า โชคชัยกุล สม.ม. มานุษยวทิยา มหาวิทยาลยัธรรมศาสตร์ 2552\nศศ.บ. การพัฒนาชุมชน มหาวิทยาลยัทักษิณ 2548\n2. ผู้ช่วย เวฬุรีย์ เมธาวีวินิจ Ph.D. Film Studies University of London, UK 2558\nศาสตราจารย์ ศศ.ม. การบริหารงานวฒันธรรม มหาวิทยาลยัธรรมศาสตร์ 2545\nB.S. Accounting Thammasat University 2542\n3. อาจารย์ พิชชากานต์ ช่วงชัย Ph.D. Creative Industries University of Warwick, UK 2563\nM.A. Cultural and Creative King’s College London, UK 2559\nIndustries\nศศ.บ. ภาษาอังกฤษ มหาวิทยาลยั เชียงใหม่ 2556\n4. ผู้ช่วย ระวีวรรณ ทรัพย์อินทร์ M.A. Multimedia Academy of Art University, 2554\nศาสตราจารย์ Communication USA\nรปม. รัฐประศาสนศาสตร์ จุฬาลงกรณ์มหาวทิยาลัย 2549\nวส.บ. วิทยุ-โทรทัศน์ มหาวิทยาลยัธรรมศาสตร์ 2545\n5. อาจารย์ รัฐศาสตร์ กรสูต ปร.ด Curriculum and Instruction มหาวิทยาลยั เกษตรศาสตร์ 2554\nM.S. Information Systems University of Wisconsin- 2545\nStout, USA\nศศ.บ. บริหารรัฐกิจ มหาวิทยาลยัธรรมศาสตร์ 2540\n(ระบุอาจารย์ผู้รับผิดชอบหลักสูตรและอาจารย์ประจำหลักสูตรอย่างน้อย 5 คน กรณีจบการศึกษาต่างประเทศให้ใช้ภาษาอังกฤษ และระบุประเทศในช่องสถาบันด้วย อาจารย์ประจำหลักสูตรต้องมีคุณวุฒิตรงหรือสัมพันธ์กับสาขาวิชาที่เปิดสอนโดยให้มีคุณวุฒิและจำนวนสอดคล้องกับเกณฑ์มาตรฐานหลักสูตร)\nมคอ. 2 หลักสูตรศิลปศาสตรบัณฑิต สาขาวิชาการจัดการมรดกวัฒนธรรมและอตุ สาหกรรมสร้างสรรค์ หน้า 57",
    "หมวดที่ 7": "หมวดที่ 7 การประเมินผลการเรียนและเกณฑ์การสำเร็จการศึกษา\n7.1 การประเมินผลการเรียนของนักศึกษา\nการประเมินผลการเรียน ให้ไปตามข้อบังคับมหาวิทยาลัยธรรมศาสตร์ ว่าด้วยการศึกษาระดับ\nปริญญาตรีพ.ศ. 2561 หมวด 8 และหมวด 9\n7.1.1 การวัดผลการศึกษา แบ่ง 8 ระดับ มีชื่อและค่าระดับต่อหนึ่งหน่วยกิตดังต่อไปนี้\nระดับ A B+ B C+ C D+ D F\nค่าระดับ 4.00 3.50 3.00 2.50 2.00 1.50 1.00 0.00\n7.1.2 การวัดผลการศึกษาวิชา จวอ. 400 การศึกษาเฉพาะเรื่อง แบ่งออก 2 ระดับ คือ S (ใช้ได้)\nและระดับ U (ใช้ไม่ได้)\n7.1.3 การวัดผลการศึกษาวิชา จวอ. 411 การฝึกปฏิบัติงานด้านการจัดการทางวัฒนธรรมและ\nอุตสาหกรรมสร้างสรรค์ แบ่งออก 2 ระดับ คือ S (ใช้ได้) และระดับ U (ใช้ไม่ได้)\n7.2 เกณฑ์การสารเ็จการศึกษาตามหลักสูตร\n7.2.1 สอบผ่านและได้รับหน่วยกิตสะสมรายวิชาครบตามโครงสร้างหลักสูตร\n7.2.2 ได้ค่าระดับเฉลี่ยสะสมไม่ต่ำกว่า 2.00 (จากระบบ 4 ระดับคะแนน)\n7.2.3 ได้ค่าระดับ S (ใช้ได้) ในรายวิชา จวอ. 400 การศึกษาเฉพาะเรื่อง และ จวอ. 411 การฝึก\nปฏิบัติงานด้านการจัดการทางวัฒนธรรมและอุตสาหกรรมสร้างสรรค์\n7.2.4 ต้องปฏิบัติตามเงื่อนไขอื่นๆ ที่วิทยาลัยนวัตกรรมและมหาวิทยาลัยธรรมศาสตร์กำหนด\nมคอ. 2 หลักสูตรศิลปศาสตรบัณฑิต สาขาวิชาการจัดการมรดกวัฒนธรรมและอตุ สาหกรรมสร้างสรรค์ หน้า 58",
    "หมวดที่ 8": "หมวดที่ 8 การประกันคุณภาพหลักสูตร\nหลักสูตรใช้ระบบประกันคุณภาพการศึกษาตามที่สภามหาวิทยาลัยเห็นชอบ\nหมวดที่ 9 ระบบและกลไกในการพัฒนาหลักสูตร\n9.1 ผลการรับฟังความคิดเห็นจากผู้ใช้บัณฑิต ผู้เรียน และนักเรียนที่ต้องการเข้าศึกษาในหลักสูตร\nหลักสูตรให้ความสำคัญกับการรับฟังความคิดเห็นจากผู้เรียนและลูกค้ากลุ่มอื่น ๆ โดยผลที่ได้จาก\nการรับฟังเสียงจากภาคส่วนต่าง ๆ ทำให้ได้ข้อมูลที่นำไปสู่การพัฒนาหลักสูตร การปรับปรุงกระบวนการ\nเรียนการสอน การพัฒนาบริการด้านการศึกษา การกำหนดนโยบายการสนับสนุนการวิจัย และการ\nจัดบริการวิชาการแก่สังคมและชุมชน โดยในแต่ละปีจะดำเนินการสำรวจความคิดเห็นจากผู้ที่เกี่ยวข้อง\nต่าง ๆ ดังนี้\nแหล่งข้อมูล ประเภทข้อมูล วิธีการได้มาซึ่งข้อมูล การใช้ประโยชน์\nความพึงพอใจ ไม่พึงพอใจและ - แบบประเมินรายวิชา ใช้เพื่อการปรับปรุงหลักสูตร\nนักศึกษา\nข้อคิดเห็นต่อหลักสูตร การจัดการ - แบบประเมินการสอน และจัดการเรียนการสอน\nเรียนการสอน สภาพแวดล้อม - นักศึกษาพบผู้บริหาร\nทางการศึกษา อาจารย์ผู้สอน - ช่องทางการสื่อสารอื่นๆ\nรูปแบบการสอนของผู้สอน สิ่ง เช่น เพจ facebook\nสนับสนุนการเรียนรู้ระบบการ คณะกรรมการนักศึกษา\nพัฒนานักศึกษา ต้น\nความพึงพอใจต่อคุณภาพบัณฑิต - แบบประเมินผลการใช้หลักสูตรใช้ข้อมูลเพื่อการ\nผู้ใช้บัณฑิต\nงานบัณฑิต ปรับปรุงหลักสูตร และการ\nจัดกระบวนการเรียนการ\nสอน\nข้อเสนอแนะการจัดการเรียนการ - แบบสำรวจข้อมูลสำหรับ หลักสูตรใช้ข้อมูลเพื่อการ\nศิษย์เก่า\nสอนแหล่งฝึกประสบการณ์ ศิษย์เก่า ปรับปรุงหลักสูตร และการ\nทุนการศึกษา จัดกระบวนการเรียนการ\nและความต้องการพัฒนาตนเอง สอนแหล่งฝึกงาน\nทุนการศึกษา และการ\nพัฒนาศิษย์เก่าตลอดชีพ\nข้อเสนอแนะการจัดการเรียนการ - แบบประเมิน/สำรวจ เพื่อการปรับปรุงหลักสูตร\nผู้ปกครอง\nสอน ความพึงพอใจผู้ปกครอง และการจัดกระบวนการ\nเรียนการสอน\nความต้องการของแหล่งทุนภายนอก - แบบสำรวจ เพื่อวางแผนและมอบหมาย\nการวิจัย\nมคอ. 2 หลักสูตรศิลปศาสตรบัณฑิต สาขาวิชาการจัดการมรดกวัฒนธรรมและอตุ สาหกรรมสร้างสรรค์ หน้า 59",
    "หมวดที่ 9": "หมวดที่ 8 การประกันคุณภาพหลักสูตร\nหลักสูตรใช้ระบบประกันคุณภาพการศึกษาตามที่สภามหาวิทยาลัยเห็นชอบ\nหมวดที่ 9 ระบบและกลไกในการพัฒนาหลักสูตร\n9.1 ผลการรับฟังความคิดเห็นจากผู้ใช้บัณฑิต ผู้เรียน และนักเรียนที่ต้องการเข้าศึกษาในหลักสูตร\nหลักสูตรให้ความสำคัญกับการรับฟังความคิดเห็นจากผู้เรียนและลูกค้ากลุ่มอื่น ๆ โดยผลที่ได้จาก\nการรับฟังเสียงจากภาคส่วนต่าง ๆ ทำให้ได้ข้อมูลที่นำไปสู่การพัฒนาหลักสูตร การปรับปรุงกระบวนการ\nเรียนการสอน การพัฒนาบริการด้านการศึกษา การกำหนดนโยบายการสนับสนุนการวิจัย และการ\nจัดบริการวิชาการแก่สังคมและชุมชน โดยในแต่ละปีจะดำเนินการสำรวจความคิดเห็นจากผู้ที่เกี่ยวข้อง\nต่าง ๆ ดังนี้\nแหล่งข้อมูล ประเภทข้อมูล วิธีการได้มาซึ่งข้อมูล การใช้ประโยชน์\nความพึงพอใจ ไม่พึงพอใจและ - แบบประเมินรายวิชา ใช้เพื่อการปรับปรุงหลักสูตร\nนักศึกษา\nข้อคิดเห็นต่อหลักสูตร การจัดการ - แบบประเมินการสอน และจัดการเรียนการสอน\nเรียนการสอน สภาพแวดล้อม - นักศึกษาพบผู้บริหาร\nทางการศึกษา อาจารย์ผู้สอน - ช่องทางการสื่อสารอื่นๆ\nรูปแบบการสอนของผู้สอน สิ่ง เช่น เพจ facebook\nสนับสนุนการเรียนรู้ระบบการ คณะกรรมการนักศึกษา\nพัฒนานักศึกษา ต้น\nความพึงพอใจต่อคุณภาพบัณฑิต - แบบประเมินผลการใช้หลักสูตรใช้ข้อมูลเพื่อการ\nผู้ใช้บัณฑิต\nงานบัณฑิต ปรับปรุงหลักสูตร และการ\nจัดกระบวนการเรียนการ\nสอน\nข้อเสนอแนะการจัดการเรียนการ - แบบสำรวจข้อมูลสำหรับ หลักสูตรใช้ข้อมูลเพื่อการ\nศิษย์เก่า\nสอนแหล่งฝึกประสบการณ์ ศิษย์เก่า ปรับปรุงหลักสูตร และการ\nทุนการศึกษา จัดกระบวนการเรียนการ\nและความต้องการพัฒนาตนเอง สอนแหล่งฝึกงาน\nทุนการศึกษา และการ\nพัฒนาศิษย์เก่าตลอดชีพ\nข้อเสนอแนะการจัดการเรียนการ - แบบประเมิน/สำรวจ เพื่อการปรับปรุงหลักสูตร\nผู้ปกครอง\nสอน ความพึงพอใจผู้ปกครอง และการจัดกระบวนการ\nเรียนการสอน\nความต้องการของแหล่งทุนภายนอก - แบบสำรวจ เพื่อวางแผนและมอบหมาย\nการวิจัย\nมคอ. 2 หลักสูตรศิลปศาสตรบัณฑิต สาขาวิชาการจัดการมรดกวัฒนธรรมและอตุ สาหกรรมสร้างสรรค์ หน้า 59 แหล่งข้อมูล ประเภทข้อมูล วิธีการได้มาซึ่งข้อมูล การใช้ประโยชน์\nโดยสอดคล้องต่อองค์ความรู้ใน - การประชุมร่วม งานที่สอดคล้องกับความ\nลักษณะพหุวิทยาการของแต่ละ เชี่ยวชาญของหลักสูตร\nหลักสูตร\nความต้องการของผู้ขอรับบริการ - แบบสำรวจ เพื่อวางแผนและมอบหมาย\nการบริการ\nโดยสอดคล้องกับองค์ความรู้ใน - การประชุมร่วม งานที่สอดคล้องกับความ\nวิชาการ\nลักษณะพหุวิทยาการของแต่ละ เชี่ยวชาญของหลักสูตร\nหลักสูตร\nผลการสำรวจความคิดเห็นของภาคส่วนต่าง ๆ มีข้อสังเกต ข้อเสนอแนะดังนี้\nนักศึกษา\n- นักศึกษามีความคิดเห็นว่าวิชาบังคับเกี่ยวกับองค์ความรู้ด้านวัฒนธรรมมากกว่าด้านการจัดการ จึง\nต้องการให้หลักสูตรเพิ่มวิชาบังคับภาคปฏิบัติและวิชาเฉพาะด้านมากขึ้น รวมถึงปรับบางวิชาให้มีความ\nเชื่อมโยงกับหลักสูตรมากขึ้น เช่น วิชาการบัญชีและวิชาเศรษฐศาสตร์\n- นักศึกษาต้องการให้เพิ่มวิชาเลือกด้านอุตสาหกรรมสร้างสรรค์ และควรมีวิชาที่บูรณาการระหว่างวิชาด้าน\nมรดกวัฒนธรรมและอุตสาหกรรมสร้างสรรค์มากขึ้น\n- นักศึกษาต้องการให้หลักสูตรเพิ่มวิชาเลือกเสรีให้มีความหลากหลาย ตรงตามความสนใจของนักศึกษา\nและส่งเสริมทักษะเฉพาะทางมากขึ้น เช่น วิชาสร้างแบรนด์สินค้าทางวัฒนธรรม วิชาผู้ประกอบการทาง\nวัฒนธรรม และวิชาการเงินส่วนบุคคล\nศิษย์เก่า\n- ศิษย์เก่ามีความคิดเห็นสอดคล้องกับนักศึกษาปัจจุบันคือหลักสูตรควรเพิ่มวิชาบังคับภาคปฏิบัติและวิชา\nเฉพาะด้านมากขึ้น เช่น วิชาผู้ประกอบการด้านวัฒนธรรม รวมถึงเพิ่มวิชาด้านอุตสาหกรรมสร้างสรรค์\n- ศิษย์เก่าส่วนมากมีความคิดเห็นว่าควรมีวิชาเลือกที่บูรณาการระหว่างวิชาด้านมรดกวัฒนธรรมและ\nอุตสาหกรรมสร้างสรรค์มากขึ้น\n- ศิษย์เก่าเสนอแนะให้หลักสูตรเพิ่มวิชาเลือกเสรีให้มีความหลากหลาย ตรงตามความสนใจของนักศึกษา\nและส่งเสริมทักษะเฉพาะทางมากขึ้น เช่น วิชาสร้างแบรนด์สินค้าทางวัฒนธรรม วิชาการเขียนเชิง\nสร้างสรรค์ วิชาการเงินส่วนบุคคล และวิชาผู้ประกอบการทางวัฒนธรรม\nผู้ใช้งานบัณฑิต\n- นักศึกษามีความรู้เฉพาะทางด้านการจัดการมรดกวัฒนธรรมค่อนข้างดีมีความเข้าใจในกระบวนการทาง\nวัฒนธรรมอย่างดีถือจุดเด่นของหลักสูตร ทำงานด้านบริหารจัดการทั่วไปได้อย่างดีทั้งนี้ควร\nเพิ่มวิชาการจัดการทรัพยากรวัฒนธรรมเปรียบเทียบองค์ความรู้ในด้านการบริหารนโยบายสาธารณะ และ\nการพัฒนาทักษะภาษาอังกฤษสำหรับการสื่อสารเฉพาะเรื่อง โดยเฉพาะภาษาอังกฤษในระดับเชี่ยวชาญ\nมคอ. 2 หลักสูตรศิลปศาสตรบัณฑิต สาขาวิชาการจัดการมรดกวัฒนธรรมและอตุ สาหกรรมสร้างสรรค์ หน้า 60 - องค์กรต้องการบุคลากรที่มีทักษะในการสร้างสรรค์ผลงานที่อยู่ภายใต้ข้อจำกัด แต่สามารถนำไปใช้ได้จริง\nทักษะการจับประเด็น ทักษะการคิดวิเคราะห์ การคิดเชื่อมโยง รวมถึงการแก้ปัญหาเฉพาะหน้า การสื่อสาร\nจิตวิทยา ศิลปะการพูด การทำงานร่วมกันทีม การติดต่อประสานงาน ความรู้ด้านเทคโนโลยีความรู้\nด้านผู้ประกอบการทางวัฒนธรรม การจัดการวัฒนธรรมเชิงพาณิชย์รวมถึงการฝึกปฏิบัติเพื่อการสื่อสารทาง\nวัฒนธรรมให้สาธารณชนเข้าใจได้\n9.2 การวิเคราะห์ความเสี่ยงและผลกระทบภายนอก\nหลักสูตรศิลปศาสตรบัณฑิต สาขาวิชาการจัดการมรดกวัฒนธรรมและอุตสาหกรรมสร้างสรรค์\nเผชิญกับปัจจัยภายนอกที่ก่อให้เกิดผลกระทบต่อการบริหารหลักสูตร ประกอบไปด้วย อัตราการเกิดใน\nประเทศไทยไทยต่ำลง การก้าวเข้าสู่สังคมผู้สูงอายุ ความนิยมในการเรียนเพื่อรับปริญญาลดลง ความนิยม\nในการเรียนหลักสูตรระยะสั้นและหลักสูตรแบบไม่รับปริญญาเพิ่มขึ้น ความนิยมในการเรียนผ่านช่องทาง\nออนไลน์เพิ่มขึ้นโดยเฉพาะหลักสูตรจากมหาวิทยาลัยในต่างประเทศ แม้ว่าหลักสูตรยังคงสามารถรับ\nนักศึกษาไปตามเป้าหมายส่งผลให้ยังสามารถจัดการหลักสูตรได้คุ้มกับต้นทุน อย่างไรก็ตาม หลักสูตร\nกลับเผชิญกับสภาวะที่มีจำนวนผู้สมัครจำนวนลดลงส่งผลให้ขาดโอกาสในการคัดเลือกผู้เรียนที่เหมาะสม\nกับปรัชญาของหลักสูตร หลักสูตร ฯ จึงต้องทำการแสวงหาตลาดใหม่ประกอบไปด้วย การคัดเลือก\nนักศึกษาต่างชาติเพื่อควบคุมความเสี่ยงเกี่ยวกับอัตราการเกิดที่ลดลงและการก้าวเข้าสู่สังคมผู้สูงอายุโดย\nทำการขยายส่วนตลาด (Market Segmentation) ไปยังผู้เรียนในนานาชาติการจัดการเรียนการสอนใน\nลักษณะ Accredited ทั้งในรูปแบบ Offline และรูปแบบ Online เพื่อควบคุมความเสี่ยงในเรื่องของความ\nนิยมในการเรียนหลักสูตรระยะสั้นและหลักสูตรแบบไม่รับปริญญา\n9.3 ผลการดำเนินงานของหลักสูตร/ผลการประกันคุณภาพการศึกษา\nหลักสูตรศิลปศาสตรบัณฑิต สาขาวิชาการจัดการมรดกวัฒนธรรมและอุตสาหกรรมสร้างสรรค์ มี\nวัตถุประสงค์เพื่อผลิตบัณฑิตให้มีคุณภาพภายใต้การควบคุมกำกับมาตรฐานตามประกาศคณะกรรมการ\nมาตรฐานการอุดมศึกษา เรื่อง เกณฑ์มาตรฐานหลักสูตรระดับปริญญาตรีพ.ศ. 2565 โดยในแต่ละปี\nวิทยาลัยมีการแต่งตั้งคณะกรรมการประเมินคุณภาพการศึกษาภายในระดับหลักสูตร เพื่อตรวจสอบผลการ\nดำเนินงานของหลักสูตรในแต่ละปี โดยผลการดำเนินงานของหลักสูตรย้อนหลัง 3 ปีการศึกษา มีดังนี้\nหลักสูตร ปีการศึกษา 2562 ปีการศึกษา 2563 ปีการศึกษา 2564\nBMCI 3.95 4.00 4.05\nมคอ. 2 หลักสูตรศิลปศาสตรบัณฑิต สาขาวิชาการจัดการมรดกวัฒนธรรมและอตุ สาหกรรมสร้างสรรค์ หน้า 61 9.4 แผนปรับปรุงและพัฒนาหลักสูตร\nการพัฒนาหลักสูตร วิธีการดำเนินการ\nจุดเด่น\n1) การมีส่วนร่วมในการส่งเสริมและอนุรักษ์ 1) การจัดหรือเข้าร่วมงานสัมมนา หรือการให้\nมรดกวัฒนธรรมในประเทศไทยและ คำปรึกษาด้านวิชาการและวิจัยของ\nนานาชาติคณาจารย์\n2) การสนับสนุนให้นักศึกษามีส่วนร่วมในการ 2) การจัดกิจกรรมหรือโครงการของนักศึกษา\nส่งเสริมและอนุรักษ์งานศิลปวัฒนธรรมใน ร่วมกับชุมชนและสังคม\nประเทศไทยและนานาชาติ\nจุดด้อย\n1) การทำการตลาดและการประชาสัมพันธ์ 1) การศึกษากลุ่มเป้าหมายของหลักสูตร การ\nเชิงรุก เจาะตลาดกลุ่มเป้าหมายโดยใช้เทคนิค\n2) การส่งเสริมการแลกเปลี่ยนนักศึกษา ขา การตลาดเชิงรุก การจัดการประชาสัมพันธ์\nเข้า – ขาออก และการแข่งขันในระดับ ที่มีประสิทธิภาพสอดคล้องกับ\nนานาชาติเพื่อเพิ่มพูนความรู้และ กลุ่มเป้าหมาย การจัดสัมมนาวิชาการ การ\nประสบการณ์ของนักศึกษา ฝึกอบรม หรือการประชุมเชิงปฏิบัติการใน\nเรื่องที่เกี่ยวข้องกับการจัดการมรดก\nวัฒนธรรมและอุตสาหกรรมสร้างสรรค์\n2) การสนับสนุนให้นักศึกษาเข้าร่วมโครงการ\nแลกเปลี่ยนนักศึกษา ขาเข้า - ขาออก และ\nการแข่งขันในระดับชาติและนานาชาติ\nมคอ. 2 หลักสูตรศิลปศาสตรบัณฑิต สาขาวิชาการจัดการมรดกวัฒนธรรมและอตุ สาหกรรมสร้างสรรค์ หน้า 62 ภาคผนวก\nภาคผนวก 1 ผลงานทางวิชาการ (ย้อนหลัง 5 ปี) ของอาจารย์ผู้รับผิดชอบหลักสูตรและอาจารย์\nประจำหลักสูตร (ถ้ามี)\n1. อาจารย์ กาญจนา เหล่าโชคชัยกุล\nผลงานวิจัยที่หน่วยงานหรือองค์กรระดับชาติว่าจ้างให้ดานเินการ : 1.00\nกาญจนา เหล่าโชคชัยกุล. (2562). โครงการวิจัยเรื่อง ความเหลื่อมล้ำและคนจนเมือง เรื่อง บทเรียนสู่\nข้อเสนอเชิงนโยบาย กรณีศึกษานโยบายและแนวทงการเคลื่อนไหวเพื่อปกป้องสิทธิทางสังคมและ\nวัฒนธรรมของชุมชนวัฒนธรรมและย่านประวัติศาสตร์ในกรุงเทพมหานคร\nกาญจนา เหล่าโชคชัยกุล. (2561). โครงการวิจัยเรื่อง การศึกษาข้อมูลทางประวัติศาสตร์ สังคมและ\nวัฒนธรรมชุมชนเพื่อสนับสนุนงานพัฒนาและเสริมสร้างการท่องเที่ยวเชิงอนุรักษ์ของชุมชนปากน้ำ\nประแส. (ทุนกองทุนวิจัยมหาวิทยาลัยธรรมศาสตร์) หน้า 1-320\nบทความวิจัยหรือบทความวิชาการฉบับสมบูรณ์ที่ตีพิมพ์ในวารสารวิชาการระดับนานาชาติที่ไม่\nอยู่ในฐานข้อมูล ตามประกาศ ก.พ.อ. หรือระเบียบคณะกรรมการการอุดมศึกษาว่าด้วย หลักเกณฑ์การ\nพิจารณาวารสารทางวิชาการสำหรับการเผยแพร่ผลงานทางวิชาการ พ.ศ.2556 แต่สถาบันนำเสนอสภา\nสถาบันอนุมัติและจัดทำประกาศให้ทราบการทั่วไป และแจ้งให้ก.พ.อ./กกอ. ทราบภายใน 30\nวันนับแต่วันที่ออกประกาศ (ซึ่งไม่อยู่ใน Beall’s list) หรือตีพิมพ์ในวารสารวิชาการที่ปรำกฎใน\nฐานข้อมูล TCI กลุ่มที่ 1 : 0.80\nกาญจนา เหล่าโชคชัยกุล. (2564) จาก OTOP ถึง OTOP นวัตวิถี: นโยบายการพัฒนาที่มีชุมชนฐาน?.\nวารสารไทยคดีศึกษา ปีที่ 18 ฉบับที่ 2 (กรกฎาคม - สิงหาคม 2564). หน้า 114—46\nบทความวิจัยหรือบทความวิชาการฉบับสมบูรณ์ที่ตีพิมพ์ในวารสารวิชาการที่ปรากฏใน\nฐานข้อมูล TCI กลุ่มที่ 2 : 0.60\nอริสรา โฉมงาม, กาญจนา เหล่าโชคชัยกุล. (2566). มองภาพ “ความชาย” ผ่านตัวละครเอกในซีรีส์\nบอยเลิฟ. วารสารสหวิทยาการวิจัยและวิชาการ ปีที่ 3 ฉบับที่ 1 (มกราคม - กุมภาพันธ์ 2566)\nหน้า 113-126.\nบทความวิจัยหรือบทความวิชาการฉบับสมบูรณ์ที่ตีพิมพ์ในรายงานสืบเนื่องจากการประชุม\nวิชาการระดับชาติ : 0.20\nภัฎศราวรินทร์ โอบอ้อม, กาญจนา เหล่าโชคชัยกุล. (2561). ความเปลี่ยนแปลงและผลกระทบจากการ\nท่องเที่ยวที่มีต่อชุมชนชาติพันธุ์กาเกอะญอ กรณีศึกษาหมาบ้านกุยเลอตอ ต.แม่จัน อ.อุ้มผาง จ.\nมคอ. 2 หลักสูตรศิลปศาสตรบัณฑิต สาขาวิชาการจัดการมรดกวัฒนธรรมและอตุ สาหกรรมสร้างสรรค์ หน้า 63 ตาก. การประชุมวิชาการระดับชาติครั้งที่ 7 ประจำปี 2561 “Gastronomy, Hospitality and\nCulture in ASEAN”. ณ สำนักงานใหญ่บริษัท การบินไทย จำกัด (มหาชน) วันที่ 7 กันยายน\n2561\n2. ผู้ช่วยศาสตราจารย์ ดร.เวฬุรีย์ เมธาวีวินิจ\nบทความวิจัยหรือบทความวิชาการฉบับสมบูรณ์ที่ตีพิมพ์ในวารสารวิชาการระดับนานาชาติที่\nปรำกฎในฐานข้อมูลระดับนานาชาติตามประกาศ ก.พ.อ. หรือระเบียบคณะกรรมการการอุดมศึกษา\nว่าด้วยหลักเกณฑ์การพิจารณาวารสารทางวิชาการสำหรับการเผยแพร่ผลงานทางวิชาการ พ.ศ.2556\n: 1.00 (SCOPUS)\nVeluree Metaveerinij. (2019). Negotiating representation: gender, city and nation in South\nEast Asian transnational cinema. South East Asia Research Volume 27, Issue 2,\n2019, Pages 133-149\nVeluree Metaveerinij. (2019). Consuming modernity and nostalgia: A case study of cross\nborder representations and fandom of Thailand-Myanmar transnational cinema.\nPlaridel Volume 16, Issue 2, 1 July 2019, Pages 1-23\nบทความวิจัยหรือบทความวิชาการฉบับสมบูรณ์ที่ตีพิมพ์ในวารสารวิชาการที่ปรำกฎใน\nฐานข้อมูล TCI กลุ่มที่ 2 : 0.60\nVeluree Metaveevinij. (2019). Representation and Relationship of Girls in Song Lyrics of Girl\nGroups and Duos: From Sao Sao Sao to BNK48’. Dhurakij Punbit Communication\nArts Journal. 13(1): 80-129.\nบทความวิจัยหรือบทความวิชาการฉบับสมบูรณ์ที่ตีพิมพ์ในรายงานสืบเนื่องจากการประชุม\nวิชาการระดับชาติ : 0.20\nพิมพกานต์ ศรีสวัสดิ์, เวฬุรีย์ เมธาวีวินิจ. (2564). ภาพตัวแทนความอีสานที่ปรำกฎในภาพยนตร์ไท\nบ้านเดอะซีรีส์, การประชุมวิชาการระดับชาติครั้งที่ 10 ประจำปีพ.ศ.2564 \"Reshaping\nThailand Tourism and Service through New Paradigm\", วันที่ 10 กันยายน 2564, หน้า\n53-66\nธนาภา รัตนวรรณ, เวฬุรีย์ เมธาวีวินิจ. (2564). อิทธิพลของวัฒนธรรมกระแสนิยมผ่านอำนาจละมุนในซีรีส์\nจีนย้อนยุค, การประชุมวิชาการระดับชาติครั้งที่ 10 ประจำปีพ.ศ.2564 \"Reshaping Thailand\nTourism and Service through New Paradigm\", วันที่ 10 กันยายน 2564, หน้า 255-267\nมคอ. 2 หลักสูตรศิลปศาสตรบัณฑิต สาขาวิชาการจัดการมรดกวัฒนธรรมและอตุ สาหกรรมสร้างสรรค์ หน้า 64 ปิณจุฑา รัชตเมธาวิน และ เวฬุรีย์ เมธาวีวินิจ. (2564). อุดมการณ์เศรษฐกิจแบบชาตินิยมผ่านละครท่อง\nเวลากรณีศึกษา รักแลกภพ (2563). การประชุมวิชาการระดับชาติและนานาชาติ (HUSOC14)\nครั้งที่ 14, มหาวิทยาลัยนเรศวร. วันที่ 15-16 กรกฎาคม 2564. หน้า 907-921\nพลสิทธิ์ ลีลาอภินันท์ และ เวฬุรีย์ เมธาวีวินิจ. (2564). การศึกษาภาพแทนความชายในภาพยนตร์ชุด\nเจมส์ บอนด.์ การประชุมวิชาการระดับชาติและนานาชาติ (HUSOC14) ครั้งที่ 14, มหาวิทยาลัย\nนเรศวร. วันที่ 15-16 กรกฎาคม 2564. หน้า 335-349\nอมรดา ยุตาคม และ เวฬุรีย์ เมธาวีวินิจ. (2564). ปัจจัยการเลือกรับชมพิพิธภัณฑ์เสมือนจริง (Virtual\nMuseum) ระหว่างสถานการณ์โควิด19 ของเจเนเรชั่นวายและ เจเนอเรชั่นแซด. การประชุม\nวิชาการระดับชาติและนานาชาติ (HUSOC14) ครั้งที่ 14, มหาวิทยาลัยนเรศวร. วันที่ 15-16\nกรกฎาคม 2564. หน้า 611-628\nชูพงษ์ แสงเพชร และ เวฬุรีย์ เมธาวีวินิจ. (2562). ทวิภพ (2547) และ พี่มาก..พระโขนง (2556):\nสุนทรียภาพแบบหลังสมัยใหม่ในภาพยนตร์รีเมกแนวทบทวนวิพากษ์. งานประชุมวิชาการ\nระดับชาติอุตสาหกรรมประสานศิลป์: วรรณกรรม วัฒนธรรมสกรีน และการเดินทางข้ามสื่อ,\nมหาวิทยาลัยเกษตรศาสตร์. กองทุนส่งเสริมศิลปะร่วมสมัย สำนักงานศิลปวัฒนธรรมร่วมสมัย.\nวันที่ 2 กันยายน 2562 หน้า 151-185\nอนินทยา ประสิทธิมี, เวฬุรีย์ เมธาวีวินิจ. (2562). พฤติกรรมและอัตลักษณ์บนสื่อออนไลน์ของแฟนคลับ\nศิลปินเกาหลีวง WANNA ONE ในประเทศไทย, การประชุมหาดใหญ่วิชาการระดับชาติและ\nนานาชาติครั้งที่ 10 มหาวิทยาลัยหาดใหญ่ (นำเสนอภาคโปสเตอร์). วันที่ 12-13 กรกฎาคม\n2562, มหาวิทยาลัยหาดใหญ่. หน้า 196-197\nผลงานสร้างสรรค์ (นวนิยาย)\nเวฬุรีย์ เมธาวีวินิจ. (2564). แอปซ่อนรัก.กรุงทพฯ : กู๊ดเฮด พริ้นท์ติ้ง แอนด์ แพคเกจจิ้ง\nเวฬุรีย์ เมธาวีวินิจ. (2565) คดีรักร้าง. กรุงเทพฯ : กรู๊ฟ พับลิชชิ่ง\n3. อาจารย์ ดร.พิชชากานต์ ช่วงชัย\nบทความวิจัยหรือบทความวิชาการฉบับสมบูรณ์ที่ตีพิมพ์ในวารสารวิชาการระดับนานาชาติที่ไม่\nอยู่ในฐานข้อมูล ตามประกาศ ก.พ.อ. หรือระเบียบคณะกรรมการการอุดมศึกษาว่าด้วย หลักเกณฑ์การ\nพิจารณาวารสารทางวิชาการสำหรับการเผยแพร่ผลงานทางวิชาการ พ.ศ.2556 แต่สถาบันนำเสนอสภา\nสถาบันอนุมัติและจัดทำประกาศให้ทราบการทั่วไป และแจ้งให้ก.พ.อ./กกอ. ทราบภายใน 30\nวันนับแต่วันที่ออกประกาศ (ซึ่งไม่อยู่ใน Beall’s list) หรือตีพิมพ์ในวารสารวิชาการที่ปรำกฎใน\nฐานข้อมูล TCI กลุ่มที่ 1 : 0.80\nมคอ. 2 หลักสูตรศิลปศาสตรบัณฑิต สาขาวิชาการจัดการมรดกวัฒนธรรมและอตุ สาหกรรมสร้างสรรค์ หน้า 65 Phitchakan Chuangchai. (2019). The problem of democracy in the ASEAN Creative City:\nthe cases of Chiang Mai, Bandung, Cebu, and George Town, Journal of Law, Social\nJustice and Global Development (Special Issue, ‘Democracy, Development and\nCulture’, ed. John Clammier and Jonathan Vickery), Issue 24: 2019: 43-68.\nบทความวิจัยหรือบทความวิชาการฉบับสมบูรณ์ที่ตีพิมพ์ในรายงานสืบเนื่องจากการประชุม\nวิชาการระดับนานาชาติหรือในวารสารทางวิชาการระดับชาติที่ไม่อยู่ในฐานข้อมูล ตามประกาศ\nก.พ.อ. หรือระเบียบคณะกรรมการการอุดมศึกษาว่าด้วย หลักเกณฑ์การพิจารณาวารสารทางวิชาการ\nสำหรับการเผยแพร่ผลงานทางวิชาการ พ.ศ.2556 แต่สถาบันนำสเนอสภาสถาบันอนุมัติและจัดทำ\nประกาศให้ทราบการทั่วไป และแจ้งให้ก.พ.อ./กกอ. ทราบภายใน 30 วันนับแต่วันที่ออกประกาศ\n: 0.40\nPhitchakan Chuangchai. (2021). Rhetoric of the Creative City in the Global South : The\nCase of Bangkok City of Design, Proceeding of 16th International Conference on\nth th\nHumanities and Social Sciences 2021, 18 -19 November 2021, Faculty of\nHumanities and Social Sciences, Khon Kaen University, Thailand. Pages 316-331\nตำราหรือหนังสือหรืองานแปลที่ผ่านการพิจารณาตามหลักเกณฑ์การประเมินตำแหน่งทาง\nวิชาการ แต่ไม่ได้นำมาขอรับการประเมินตำแหน่งทางวิชาการ : 1.00\nPhitchakan Chuangchai. (2020). Creative City Policy in Second-Tier Cities: The Case of\nChiang Mai, Thailand, in Gu, X. et al. (eds.) Re-Imagining Creative Cities in Twenty-\nFirst Century Asia. London: Palgrave Macmillan, Pages 239-252.\n4. ผู้ช่วยศาสตราจารย์ ระวีวรรณ ทรัพย์อินทร์\nผลงานวิจัยที่หน่วยงานหรือองค์กรระดับชาติว่าจ้างให้ดานเินการ : 1.00\nระวีวรรณ ทรัพย์อินทร์. (2565). โครงการวิจัยเรื่อง จ้างดำเนินการศึกษาพัฒนาแนวทางและการจัดอบรม\nพัฒนาศักยภาพบุคลากรด้านสื่อส้าหรับเด็กปฐมวัย (อายุ 3-6 ปี) ประจำปีงบประมาณ 2564. (ทุน\nกองทุนพัฒนาสื่อปลอดภัยและสร้างสรรค์)\nระวีวรรณ ทรัพย์อินทร์. (2564). โครงการวิจัยเรื่อง จ้างดำเนินการศึกษาและพัฒนาสื่อส้าหรับเด็กปฐมวัย\n(อายุ 3-6 ปี) ระยะที่ 2. (ทุนกองทุนพัฒนาสื่อปลอดภัยและสร้างสรรค์)\nระวีวรรณ ทรัพย์อินทร์. (2564). โครงการวิจัยเรื่อง อบรมพัฒนาศักยภาพบุคคลากรด้านสื่อส้าหรับเด็ก\nปฐมวัย (อายุ 3-6 ปี) . (ทุนกองทุนพัฒนาสื่อปลอดภัยและสร้างสรรค์)\nมคอ. 2 หลักสูตรศิลปศาสตรบัณฑิต สาขาวิชาการจัดการมรดกวัฒนธรรมและอตุ สาหกรรมสร้างสรรค์ หน้า 66 บทความวิจัยหรือบทความวิชาการฉบับสมบูรณ์ที่ตีพิมพ์ในวารสารวิชาการที่ปรำกฎใน\nฐานข้อมูล TCI กลุ่มที่ 2 : 0.60\nวิไลวรรณ จงวิไลเกษม, ประชา คุณธรรมดี, ระวีวรรณ ทรัพย์อินทร์. (2564). ผลตอบแทนทางสังคมจาก\nการขับเคลื่อนประเด็น “สารเคมีการเกษตร” ของไทยพีบีเอส, วารสารศาสตร์ ปีที่ 14 ฉบับที่ 3\nเดือน กันยายน-ธันวาคม 2564\n5. อาจารย์ ดร. รัฐศาสตร์ กรสูต\nผลงานวิจัยที่หน่วยงานหรือองค์กรระดับชาติว่าจ้างให้ดานเินการ : 1.00\nรัฐศาสตร์ กรสูต (2564). โครงการวิจัยเรื่อง ส่งเสริมทักษะการวิเคราะห์ข้อมูลส้าหรับบุคลากรและกำลังคน\nเพื่อเพิ่มประสิทธิภาพการท้างาน (Data Analytics for Upskilling). (ทุนสถาบันเทคโนโลยีแห่ง\nเอเชีย (AIT))\nมคอ. 2 หลักสูตรศิลปศาสตรบัณฑิต สาขาวิชาการจัดการมรดกวัฒนธรรมและอตุ สาหกรรมสร้างสรรค์ หน้า 67 ภาคผนวก 2 ตารางเปรียบเทียบโครงสร้างและองค์ประกอบของหลักสูตร ฉบับ พ.ศ. 2561 กับ\nฉบับ พ.ศ. 2566 (ใช้สำหรับหลักสูตรปรับปรุง) ขอให้เปรียบเทียบรายละเอียดของ\nหลักสูตร ดังนี้\nหลักสูตร ฉบบัพ.ศ. 2561 หลักสูตร ฉบบัพ.ศ. 2566 สรุปการ\nเปลี่ยนแปลง\n1) ชื่อหลักสูตรและชื่อปริญญชื่ำอ ภาษาไทย: คงเดิม\n1.1) ชื่อหลักสูตรภาษาไทย: 1.1) ชื่อหลักสูตรภาษาไทย:\nหลักสูตรศิลปศาสตรบัณฑิต หลักสูตรศิลปศาสตรบัณฑิต สาขาวิชาการ\nสาขาวชิาการจัดการมรดกวัฒนธรรมและ จัดการมรดกวัฒนธรรมและอุตสาหกรรม\nอุตสาหกรรมสร้างสรรค์ (หลักสูตรพหุ สร้างสรรค์ (หลักสูตรพหุวิทยาการ)\nวิทยาการ)\nชื่อภาษาอังกฤษ: ชื่อภาษาอังกฤษ:\nBachelor of Arts Program in Bachelor of Arts Program in\nManagement of Cultural Heritage and Management of Cultural Heritage and\nCreative Industries (Multidisciplinary) Creative Industries (Multidisciplinary)\n1.2) ชื่อปริญญา: 1.2) ชื่อปริญญา:\nศิลปศาสตรบัณฑิต (การจัดการมรดก ศิลปศาสตรบัณฑิต (การจัดการมรดก\nวัฒนธรรมและอุตสาหกรรมสร้างสรรค์) วัฒนธรรมและอุตสาหกรรมสร้างสรรค์)\nศศ.บ. (การจัดการมรดกวัฒนธรรมและ ศศ.บ. (การจัดการมรดกวัฒนธรรมและ\nอุตสาหกรรมสร้างสรรค์) อุตสาหกรรมสร้างสรรค์)\nBachelor of Arts (Cultural Heritage and Bachelor of Arts (Cultural Heritage and\nCreative Industries) Creative Industries)\nB.A. (Cultural Heritage and Creative B.A. (Cultural Heritage and Creative\nIndustries) Industries)\nมคอ. 2 หลักสูตรศิลปศาสตรบัณฑิต สาขาวิชาการจัดการมรดกวัฒนธรรมและอตุ สาหกรรมสร้างสรรค์ หน้า 68 หลักสูตร ฉบบัพ.ศ. 2561 หลักสูตร ฉบบัพ.ศ. 2566 สรุปการ\nเปลี่ยนแปลง\n2) ปรัชญาและ/หรือวัตถุประสงค์ของหลักสูตร คงเดิม\nปรัชญา ปรัชญา\nพัฒนาตนและสร้างองค์ความรู้พหุวิทยาการ พัฒนาตนและสร้างองค์ความรู้พหุวิทยาการ\nด้านวัฒนธรรมและการจัดการ ก้าวทันความ ด้านวัฒนธรรมและการจัดการ ก้าวทันความ\nเปลี่ยนแปลง ก้าวข้ามเส้นแบ่งความรู้ก้าวสู่ เปลี่ยนแปลง ก้าวข้ามเส้นแบ่งความรู้ก้าวสู่\nความเลิศระดับสากล บนพื้นฐานคุณธรรม ความเลิศระดับสากล บนพื้นฐานคุณธรรม\nจริยธรรม และรับใช้สังคม จริยธรรม และรับใช้สังคม\nวัตถุประสงค์ของหลักสูตร วัตถุประสงค์ของหลักสูตร\nเพื่อให้บัณฑิตที่สำเร็จการศึกษาในหลักสูตรมี เพื่อให้บัณฑิตที่สำเร็จการศึกษาในหลักสูตรมี\nลักษณะ ดังนี้ลักษณะ ดังนี้\n1. นักจัดการด้านวฒันธรรมทมี่ 1. นักจัดการด้านวฒันธรรมทมี่\nความรู้ความสามารถ และทักษะเชิง ความรู้ความสามารถ และทักษะ\nพหุวิทยาการ เชิงพหุวิทยาการ\n2. สามารถบูรณาการองค์ความรู้ด้าน 2. สามารถบูรณาการองค์ความรู้ด้าน\nวัฒนธรรม และอุตสาหกรรม วัฒนธรรม และอุตสาหกรรม\nสร้างสรรค์ได้สร้างสรรค์ได้\n3. มีศักยภาพในระดับอาเซียนและสากล 3. มีศักยภาพในระดับอาเซียนและ\n4. มีความรับผิดชอบต่อสังคมบน สากล\nพื้นฐานคุณธรรม จริยธรรม และรับ 4. มีความรับผิดชอบต่อสังคมบน\nใช้สังคม พื้นฐานคุณธรรม จริยธรรม และรับ\nใช้สังคม\n3) คุณสมบัติของผู้เข้าศึกษา ปรับการคัดเลือก\nให้ไปตาม\nคุณสมบัติของผู้เข้าศึกษา คุณสมบัติของผู้เข้าศึกษา\nคุณสมบัติของผู้เข้าศึกษาต้องไปตาม คุณสมบัติของผู้เข้าศึกษาต้องไปตาม ระเบียบการ\nข้อบังคับมหาวิทยาลัยธรรมศาสตร์ว่าด้วย ข้อบังคับมหาวิทยาลัยธรรมศาสตร์ ว่าด้วย คัดเลือกเพื่อเข้า\nการศึกษาชั้นปริญญาตรีการศึกษาชั้นปริญญาตรีพ.ศ. 2561 ข้อ 14 ศึกษาใน\nสถาบนัการศึกษา\nขั้นอุดมศึกษาของ\nการคัดเลือกผู้เข้าศึกษา การคัดเลือกผู้เข้าศึกษา\nการคัดเลือกผู้เข้าศึกษาให้ไปตามวิธีการที่การคัดเลือกผู้เข้าศึกษาให้ไปตามระเบียบ ส่วนราชการหรือ\nมหาวิทยาลัยกำหนดโดยความเห็นชอบของ คัดเลือกเพื่อเข้าศึกษาในสถาบันการศึกษาขั้น หน่วยงานอื่น\nสภามหาวิทยาลัย หรือให้ไปตามระเบียบ อุดมศึกษาของส่วนราชการหรือหน่วยงานอื่น ดำเนินการตามการ\nการคัดเลือกบุคคลเพื่อเข้าศึกษาใน ดำเนินการตามการมอบหมายของ มอบหมายของ\nมคอ. 2 หลักสูตรศิลปศาสตรบัณฑิต สาขาวิชาการจัดการมรดกวัฒนธรรมและอตุ สาหกรรมสร้างสรรค์ หน้า 69 หลักสูตร ฉบบัพ.ศ. 2561 หลักสูตร ฉบบัพ.ศ. 2566 สรุปการ\nเปลี่ยนแปลง\nสถาบันการศึกษาขั้นอุดมศึกษาของสำนักงาน มหาวิทยาลัยหรือตามข้อตกลง หรือ การ มหาวิทยาลยัหรือ\nคณะกรรมการอุดมศึกษา คัดเลือกตามวิธีการที่มหาวิทยาลัยกำหนดโดย ตามข้อตกลง หรือ\nความเห็นชอบของสภามหาวิทยาลัย และ การคัดเลือกตาม\nออกประกาศมหาวิทยาลัย วิธีการที่\nมหาวิทยาลยั\nกำหนดโดยความ\nเห็นชอบของสภา\nมหาวิทยาลยั และ\nออกประกาศ\nมหาวิทยาลยั\n4) จำนวนการรับนักศึกษา คงเดิม\nรับนักศึกษาปลีะ 120 คน รับนักศึกษาปลีะ 120 คน\n5) ระบบการศึกษา กำหนดระบบ\nการศึกษาเฉพาะ\nระบบ ระบบ\nใช้ระบบการศึกษาแบบทวิภาค โดย 1 ปี หลักสูตรแบบเต็มเวลา ใช้ระบบ ภาคปกติ\nการศึกษาแบ่งออก 2 ภาคการศึกษาปกติการศึกษาแบบทวิภาค โดย 1 ปีการศึกษา\nซึ่ง 1 ภาคการศึกษาปกติมีระยะเวลาศึกษาไม่ แบ่งออก 2 ภาคการศึกษาปกติ 1 ภาค\nน้อยกว่า 15 สัปดาห์ และอาจเปิดภาคฤดูร้อน การศึกษาปกติมีระยะเวลาศึกษาไม่น้อยกว่า\nได้ โดยใช้เวลาการศึกษาไม่น้อยกว่า 6 สัปดาห์ 15 สัปดาห์\nแต่ให้เพิ่มชั่วโมงการศึกษาในแต่ละรายวิชาให้\nเท่ากับภาคการศึกษาปกติ\nระบบการศึกษา\n(เลือกเพียง 1 ระบบ)\nระบบการศึกษา\n\n<include> แบบชั้นเรียน</include>\n\n<include> แบบชั้นเรียน (Onsite)</include>\n\n<exclude> แบบทางไกลผ่านสื่อสิ่งพิมพ์หลัก</exclude>\n\n<exclude> แบบทางไกล (Online)</exclude>\n\n<exclude> แบบทางไกลผ่านสื่อแพร่ภาพและเสียง</exclude>\n\n<exclude> แบบประสมประสาน (Hybrid)</exclude>\nสื่อหลัก\n\n<include> อื่นๆ (ระบุ)</include>\n\n<exclude> แบบทางไกลทางอิเล็กทรอนิกส์สื่อ</exclude>\nหลัก (E-Learning)\nนอกเหนือจากระบบการศึกษาแบบชนั้ เรียน\n\n<exclude> แบบทางไกลทางอินเทอร์เน็ต</exclude>\nหลักสูตรจะใช้เทคนิคการเรียนการสอนแบบ\n\n<include> อื่น ๆ</include>\nผสมผสาน เพื่อสร้างการเรียนรู้ที่มี\nนอกเหนือจากระบบการศึกษาแบบชนั้ เรียน\nประสิทธิภาพให้แก่นักศึกษา โดยเทคนิคที่จะ\nหลักสูตรจะใช้เทคนิคการเรียนการสอน\nใช้ในการสร้างการเรียนรู้ประกอบด้วย การ\nแบบผสมผสาน เพื่อสร้างการเรียนรู้ที่มี\nเรียนรู้เชิงรุก (Active learning) การเรียนรู้\nมคอ. 2 หลักสูตรศิลปศาสตรบัณฑิต สาขาวิชาการจัดการมรดกวัฒนธรรมและอตุ สาหกรรมสร้างสรรค์ หน้า 70 หลักสูตร ฉบบัพ.ศ. 2561 หลักสูตร ฉบบัพ.ศ. 2566 สรุปการ\nเปลี่ยนแปลง\nประสิทธิภาพให้แก่นักศึกษา โดยเทคนิคที่จากปัญหาที่เผชิญอยู่ในปจัจุบนั (Problem-\nจะใช้ในการสร้างการเรียนรู้ประกอบด้วย based learning) การเรียนรู้ด้วยการทำ\nการเรียนรู้เชิงรุก (Active learning) การ โครงงาน (Project-based learning) การ\nเรียนรู้จากปัญหาที่เผชิญอยู่ในปจัจุบัน ทำงานกลุ่ม การทำ งานวิจัย โครงการเดี่ยว\n(Problem-based learning) การเรียนรู้การวิเคราะห์กรณีศึกษา การฝึกงานผ่านการ\nด้วยการทำโครงงาน (Project-based ปฏิบัติจริง รวมถึงการศึกษาดงูาน\nlearning) การทำงานกลุ่ม การทำงานวิจัย\nโครงการเดี่ยว การวิเคราะห์กรณีศึกษา\nการฝึกงานผ่านการปฏบิัติจริง รวมถึง\nการศึกษาดูงาน\n6) เกณฑ์การสำเร็จการศึกษา ปรับเงื่อนไข จาก\nศึกษารายวิชาครบ\nเกณฑ์การสำเร็จการศึกษาตามหลักสูตร เกณฑ์การสำเร็จการศึกษาตามหลักสูตร\n1. ศึกษารายวิชาต่าง ๆ ครบตามโครงสร้าง 1. สอบผ่านและได้รับหน่วยกิตสะสมรายวิชา ตามโครงสร้าง\nหลักสูตร และมีหน่วยกิตสะสมไม่น้อยกว่า 132 ครบตามโครงสร้างหลักสูตร  สอบผ่านและ\nหน่วยกิต 2. ได้ค่าระดับเฉลี่ยสะสมไม่ต่ำกว่า 2.00 ได้รับหน่วยกิต\n2. ได้ค่าระดับเฉลี่ยสะสมไม่ต่ำกว่า 2.00 (จาก (จากระบบ 4 ระดับคะแนน) สะสมรายวิชาครบ\nระบบ 4 ระดับคะแนน) 3. ได้ค่าระดับ S (ใช้ได้) ในรายวิชา จวอ. ตามโครงสร้าง\n3. ได้ค่าระดับ S (ใช้ได้) ในรายวิชา 400 การศึกษาเฉพาะเรื่อง และ จวอ. 411\nจวอ. 400 การศึกษาเฉพาะเรื่อง และ การฝึกปฏิบัติงานด้านการจัดการทาง\nจวอ. 411 การฝึกปฏิบัติงานด้านการจัดการ วัฒนธรรมและอุตสาหกรรมสร้างสรรค์\nทางวัฒนธรรม 4. ต้องปฏิบัติตามเงื่อนไขอื่นๆ ที่วิทยาลัย\n4. ปฏิบัตติามเงื่อนไขอื่น ๆ ที่วทิยาลัย นวัตกรรมและมหาวิทยาลัยธรรมศาสตร์\nนวัตกรรมและมหาวิทยาลัยธรรมศาสตร์ กำหนด\nกำหนด\n7) โครงสร้างและองค์ประกอบของหลักสูตร ปรับลดจา นวน\nหน่วยกิตรวม 3\nโครงสร้างหลักสูตร โครงสร้างหลักสูตร\nนักศึกษาจะต้องจดทะเบียนศึกษารายวิชา หน่วยกิต โดยลด\nรวมไม่น้อยกว่า 129 หน่วยกิต โดยศึกษา หน่วยกิตวิชาบังคับ\nรายวิชาต่าง ๆ ครบตามโครงสร้าง 6 หน่วยกิต และ\nองค์ประกอบ และข้อกำหนดของหลักสูตร เพิ่มหน่วยกิตวิชา\nดังนี้ เลือกเสรี 3 หน่วย\nกิต\nมคอ. 2 หลักสูตรศิลปศาสตรบัณฑิต สาขาวิชาการจัดการมรดกวัฒนธรรมและอตุ สาหกรรมสร้างสรรค์ หน้า 71 หลักสูตร ฉบบัพ.ศ. 2561 หลักสูตร ฉบบัพ.ศ. 2566 สรุปการ\nเปลี่ยนแปลง\n1) หมวดวิชาศึกษาทั่วไป 30 หน่วยกิต 1) หมวดวิชาศึกษาทั่วไป 30 หน่วยกิต\n2) หมวดวิชาเฉพาะ 96 หน่วยกิต 2) หมวดวิชาเฉพาะ 90 หน่วยกิต\n2.1) วิชาบังคบั 72 หน่วยกิต 2.1) วิชาบังคบั 66 หน่วยกิต\n2.2) วิชาบังคบั เลือก 9 หน่วยกิต 2.2) วิชาบังคบั เลือก 9 หน่วยกิต\n2.3) วิชาเลือก 15 หน่วยกิต 2.3) วิชาเลือก 15 หน่วยกิต\n3) หมวดวิชาเลือกเสรี 6 หน่วยกิต 3) หมวดวิชาเลือกเสรี 9 หน่วยกิต\nรวม 132 หน่วยกิต รวม 129 หน่วยกิต\n8) รายวิชาตามโครงสร้างของหลักสูตร\n1. วิชาศึกษาทั่วไป 1. วิชาศึกษาทั่วไป 30 หน่วยกิต ปรับวิชาศึกษาทั่วไป\nนักศึกษาจะต้องศึกษารายวิชาในหลักสตู รวิชา นักศึกษาทุกคนสามารถเลือกเรียนได้ทุกรายวิชา ตามเล่มหลักสตู ร\nศึกษาทั่วไป รวมแล้วไม่น้อยกว่า 30 หน่วยกิต ในแต่ละหมวด โดยต้องเลือกเรียนให้ครบทั้ง 5 ศึกษาทั่วไป ฉบับ\nตามโครงสร้างและองค์ประกอบของหลักสูตรวิชา หมวด ได้แก่ 1) หมวดความเท่าทันโลกและสังคม ปรับปรุง พ.ศ. 2566\nศึกษาทั่วไป ซึ่งแบ่ง 2 ส่วน คือ 2) หมวดสุนทรียะและทักษะการสื่อสาร 3)\nหมวดคณิตศาสตร์ วิทยาศาสตร์ และเทคโนโลยี\nส่วนที่ 1: หลักสตู รกลางของมหาวิทยาลยัที่ 4) หมวดสุขภาวะและทักษะแห่งอนาคต 5)\nกำหนดให้นักศึกษาทุกคนต้องเรยีน จำนวน 21 หมวดการบริการสังคมและการเรียนรู้จากการ\nหน่วยกิต ปฏิบัติจำนวนรวมทั้งสิ้น 30 หน่วยกิต ตาม\nโครงสร้างและองค์ประกอบของหลักสูตรวิชา\nศึกษาทั่วไปที่วิทยาลัยกำหนดไว้ดังนี้\nหมวดวชิา จำนวนหน่วยกิต หมวดวชิา จำนวนหน่วยกิต\n1. สังคมศาสตร์ 6 หน่วยกิต 1) หมวดความเท่าทันโลก 6 หน่วยกิต\nและสังคม\n2. มนุษยศาสตร์ 3 หน่วยกิต\n2) หมวดสุนทรียะและทักษะ 12 หน่วยกิต\n3. วิทยาศาสตร์กบั 3 หน่วยกิต\nการสื่อสาร\nคณิตศาสตร์\n3) หมวดคณิตศาสตร์ 6 หน่วยกิต\n4. ภาษา 9 หน่วยกิต\nวิทยาศาสตร์ และเทคโนโลยี\nรวม 21 หนว่ยกิต 4) หมวดสุขภาวะและทกัษะ 3 หน่วยกิต\nแห่งอนาคต\n5) หมวดการบริการสังคม 3 หน่วยกิต\nและการเรียนรู้จากการ\nปฏิบัติ\nรวม 30 หน่วยกิต\nมคอ. 2 หลักสูตรศิลปศาสตรบัณฑิต สาขาวิชาการจัดการมรดกวัฒนธรรมและอตุ สาหกรรมสร้างสรรค์ หน้า 72 หลักสูตร ฉบบัพ.ศ. 2561 หลักสูตร ฉบบัพ.ศ. 2566 สรุปการ\nเปลี่ยนแปลง\nส่วนที่ 1\n1. หมวดสังคมศาสตร์ บังคับ 2 วิชา\n6 หน่วยกิต\nมธ.100 พลเมืองกับการลงมือ 3 (3-0-6) มธ.100 พลเมืองกับการลงมือ 3 (3-0-6) คงเดิม\nแก้ปัญหา แก้ปัญหา (5)\nTU100 Civic Engagement TU100 Civic Engagement (5)\nมธ.101 โลก อาเซียนและไทย 3 (3-0-6) มธ.101 โลก อาเซียนและไทย (1) 3 (3-0-6) คงเดิม\nTU101 Thailand, ASEAN TU101 Thailand, ASEAN\nand the World and the World (1)\nหรือ มธ.109 นวัตกรรมกับกระบวน 3 (3-0-6) คงเดิม\nมธ.109 นวัตกรรมกับกระบวน 3 (3-0-6) คิดผู้ประกอบการ (1)\nคิดผู้ประกอบการ TU109 Innovation and Entrepreneurial\nTU109 Innovation and Entrepreneurial mindset (1)\nmindset\n2.หมวดมนุษยศาสตร์ บังคับ 1 วิชา\n3 หน่วยกิต\nมธ.102 ทักษะชีวิตทางสังคม 3 (3-0-6) มธ.102 ชีวิตกับสุนทรียภาพ (2) 3 (3-0-6) ปรับชื่อวิชาและ\nTU102 Social Life Skills TU102 Life & Aesthetics (2) คำอธิบาย\nหรือ\nมธ.108 การพัฒนาและ 3 (3-0-6) ปิดวิชา\nจัดการตนเอง\nTU108 Self-Development and\nManagement\n3. หมวดวิทยาศาสตร์กับคณิตศาสตร์\nบังคับ 1 วิชา 3 หน่วยกิต\nมธ.103 ชีวิตกับความยั่งยืน 3 (3-0-6) มธ.103 ชีวิตกับความยั่งยืน (3) 3 (3-0-6) คงเดิม\nTU103 Life and Sustainability TU103 Life and Sustainability (3)\nหรือ คงเดิม\nมธ.107 ทักษะดิจิทัลกบัการ 3 (3-0-6) มธ.107 ทักษะดิจิทัลกบัการ 3 (3-0-6)\nแก้ปัญหา\nแก้ปัญหา (3)\nTU107 Digital Skill and Problem TU107 Digital Skill and Problem\nSolving\nSolving (3)\nมคอ. 2 หลักสูตรศิลปศาสตรบัณฑิต สาขาวิชาการจัดการมรดกวัฒนธรรมและอตุ สาหกรรมสร้างสรรค์ หน้า 73 หลักสูตร ฉบบัพ.ศ. 2561 หลักสูตร ฉบบัพ.ศ. 2566 สรุปการ\nเปลี่ยนแปลง\n4. หมวดภาษา บังคับ 3 วิชา 9 หน่วยกิต\nมธ.050 การพัฒนาทักษะ ไม่นับหน่วยกิต - ยกเลิก\nภาษาอังกฤษ\nTU050 English Skill Development\nมธ.104 การคิด อ่าน และเขียน 3 (3-0-6) ศศ.101 การคิด อ่าน และเขียน 3 (3-0-6) ปรับรหัสวิชา\nอย่างมีวิจารณญาณ อย่างมีวิจารณญาณ (2)\nTU104 Critical Thinking, Reading, and LAS101 Critical Thinking, Reading, and\nWriting Writing (2)\nมธ.105 ทักษะการสื่อสารด้วย 3 (3-0-6) สษ.105 ทักษะการสื่อสาร 3 (3-0-6) ปรับรหัส, ชื่อวิชา\nภาษาอังกฤษ ทางภาษาอังกฤษ (2) ภาษาอังกฤษ และ\nTU105 Communication Skills in English EL105 English Communication Skills (2) คำอธบิายรายวิชา\nมธ.106 ความคิดสร้างสรรค์และ 3 (3-0-6) มธ.106 ความคิดสร้างสรรค์และ 3 (3-0-6) คงเดิม\nTU106 การสื่อสาร การสื่อสาร (2)\nCreativity and Communication TU106 Creativity and Communication (2)\n- มธ.201 ความรู้ทางการเงินสำหรับ 3 (3-0-6) เปิดวิชาใหม่\nบุคคล (4)\nTU201 Financial Literacy for Individuals(4)\nส่วนที่ 2\nนักศึกษาต้องศึกษารายวิชาที่วิทยาลัยฯ กำหนด\nจำนวน 3 วิชา 9 หน่วยกิต ดังนี้\nมธ.115 มนุษย์กับผลงาน 3 (3-0-6) - ปิดรายวิชา\nสร้างสรรคด์้านวรรณกรรม\nTU115 Man and his Literary Creativity\nอซ.125 ความรู้ทั่วไปเกี่ยวกับ 3 (3-0-6) - ปิดรายวิชา\nอาเซียน\nAS125 Introduction to ASEAN\nดท.100 นวัตกรรมดิจิทัล 3 (3-0-6) - ปิดรายวิชา\nDX100 Digital Innovation\nลดหน่วยกติวิชา\n2 หมวดวิชาเฉพาะ 96 หน่วยกิต 2 หมวดวชิาเฉพาะ 90 หน่วยกิต\nเฉพาะ 6 หน่วยกิต\nมคอ. 2 หลักสูตรศิลปศาสตรบัณฑิต สาขาวิชาการจัดการมรดกวัฒนธรรมและอตุ สาหกรรมสร้างสรรค์ หน้า 74 หลักสูตร ฉบบัพ.ศ. 2561 หลักสูตร ฉบบัพ.ศ. 2566 สรุปการ\nเปลี่ยนแปลง\nลดหน่วยกติวิชา\nหมวดวิชาบังคับ หมวดวิชาบังคับ\nนักศึกษาต้องศึกษารายวิชาในหมวดวิชาบังคับ นักศึกษาต้องศึกษารายวิชาในหมวดวิชาบังคับ บังคับ 6 หน่วยกิต\nจำนวน 72 หน่วยกิตตามรายวิชาที่กำหนดไว้ดังนี้จำนวน 66 หน่วยกิต ตามรายวิชาที่กำหนดไว้\nดังนี้\nจวอ.200 แนวคิดและทฤษฎดี้าน 3 (3-0-6) จวอ.200 แนวคิดและทฤษฎดี้าน 3 (3-0-6) คงเดิม\nมรดกวัฒนธรรมและอุตสาหกรรม มรดกวัฒนธรรมและอุตสาหกรรม\nสร้างสรรค์ สร้างสรรค์\nHIM200 Concepts and Theories of HIM200 Concepts and Theories of\nCultural Heritage and Cultural Heritage and\nCreative Industries Creative Industries\nจวอ.201 การบัญชีและการเงิน 3 (3-0-6) จวอ.201 การบัญชีและการเงิน 3 (3-0-6) ปรับชื่อวิชา และ\nเพื่อการจัดการทางวัฒนธรรม เพื่อการจัดการมรดกวัฒนธรรม คำอธิบายรายวิชา\nHIM201 Accounting and Finance for และอุตสาหกรรมสร้างสรรค์\nCultural Management HIM201 Accounting and Finance for\nManagement of Cultural\nHeritage and Creative\nIndustries\nจวอ.202 ประวัติศาสตร์ศิลปะ 3 (3-0-6) จวอ.202 ศิลปะเพื่อการสร้าง 3 (3-0-6) ปรับชื่อวิชา และ\nเพื่อการสร้างสรรค์ทางวัฒนธรรม สรรค์นวัตกรรม คำอธิบายรายวิชา\nHIM202 History of Arts for Cultural HIM202 Art for Creative Innovation\nCreativity\nจวอ.203 โลกแห่งอารยธรรม 3 (3-0-6) จวอ.203 อารยธรรม การเปลี่ยน 3 (3-0-6) ปรับชื่อวิชา และ\nและการเปลยี่นแปลงทาง แปลงและนวตักรรม คำอธิบายรายวิชา\nวัฒนธรรม HIM203 Civilization, Transformation,\nHIM203 World Civilization and and Innovation\nCultural Change\nจวอ.204 แนวคิดทางมานุษย 3 (3-0-6) จวอ.204 มานุษยวิทยาประยุกต์ 3 (3-0-6) ปรับชื่อวิชา\nวิทยาเพื่องานวัฒนธรรม เพื่อการจัดการมรดกวัฒนธรรม\nHIM204 Anthropological Concepts of และอุตสาหกรรมสร้างสรรค์\nCulture HIM204 Applied Anthropology for\nManagement of Cultural\nHeritage and Creative\nIndustries\nจวอ.205 หลักเศรษฐศาสตร์ 3 (3-0-6) จวอ.205 หลักเศรษฐศาสตร์เพื่อ 3 (3-0-6) ปรับชื่อวิชา และ\nมคอ. 2 หลักสูตรศิลปศาสตรบัณฑิต สาขาวิชาการจัดการมรดกวัฒนธรรมและอตุ สาหกรรมสร้างสรรค์ หน้า 75 หลักสูตร ฉบบัพ.ศ. 2561 หลักสูตร ฉบบัพ.ศ. 2566 สรุปการ\nเปลี่ยนแปลง\nเบื้องต้น การจัดการมรดกวัฒนธรรมและ คำอธิบายรายวิชา\nHIM205 Principles of Economics อุตสาหกรรมสร้างสรรค์\nHIM205 Principles of Economics for\nManagement of Cultural\nHeritage and Creative\nIndustries\nจวอ.210 หลักการตลาดเพื่อการ 3 (3-0-6) จวอ.210 หลักการตลาดเพื่อ 3 (3-0-6) ปรับชื่อวิชา\nจัดการทางวัฒนธรรม การจัดการมรดกวัฒนธรรมและ\nHIM210 Marketing Principles for อุตสาหกรรมสร้างสรรค์\nCultural HIM210 Marketing Principles for\nManagement of Cultural\nHeritage and Creative Industries\nจวอ.212 การจัดการทรัพยากร 3 (3-0-6) จวอ.212 การจัดการทรัพยากร 3 (3-0-6) คงเดิม\nทางวัฒนธรรม ทางวัฒนธรรม\nHIM212 Cultural Resource HIM212 Cultural Resource\nManagement Management\nจวอ.214 สื่อและวัฒนธรรมเชิง 3 (3-0-6) จวอ.214 สื่อและวัฒนธรรมเชิง 3 (3-0-6) คงเดิม\nวิพากษ์ วิพากษ์\nHIM214 Critical Media and Cultural HIM214 Critical Media and Cultural\nStudies Studies\nจวอ.215 ทัศนวัฒนธรรมร่วมสมยั 3 (3-0-6) จวอ.215 ทัศนวัฒนธรรมร่วมสมยั 3 (3-0-6) ปรับคำอธิบาย\nHIM215 Contemporary Visual Culture HIM215 Contemporary Visual Culture รายวิชา\nจวอ.230 กระบวนการสร้างสรรค์ 3 (3-0-6) จวอ.230 กระบวนการสร้างสรรค์ 3 (3-0-6) คงเดิม\nและการผลิตในอุตสาหกรรมสื่อ และการผลิตในอุตสาหกรรมสื่อ\nHIM230 Creative Process and HIM230 Creative Process and\nProduction in Media Production in Media\nIndustries Industries\nจวอ.300 นโยบายทางวัฒนธรรม 3 (3-0-6) จวอ.300 นโยบายทางวัฒนธรรม 3 (3-0-6) คงเดิม\nHIM300 Cultural Policy HIM300 Cultural Policy\nจวอ.301 การจัดการความรู้และ 3 (3-0-6) จวอ.301 การจัดการความรู้และ 3 (3-0-6) คงเดิม\nความคิดสร้างสรรค์ ความคิดสร้างสรรค์\nมคอ. 2 หลักสูตรศิลปศาสตรบัณฑิต สาขาวิชาการจัดการมรดกวัฒนธรรมและอตุ สาหกรรมสร้างสรรค์ หน้า 76 หลักสูตร ฉบบัพ.ศ. 2561 หลักสูตร ฉบบัพ.ศ. 2566 สรุปการ\nเปลี่ยนแปลง\nHIM301 Knowledge and Creativity HIM301 Knowledge and Creativity\nManagement Management\nจวอ.302 ระเบียบวิธีวิจยั เพื่อการ 3 (3-0-6) จวอ.302 ระเบียบวิธีวิจยั เพื่อการ 3 (3-0-6) ปรับชื่อวิชา\nจัดการทางวัฒนธรรม จัดการทางมรดกวัฒนธรรมและ\nHIM302 Research Methodology for อุตสาหกรรมสร้างสรรค์\nCultural Management HIM302 Research Methodology for\nManagement of Cultural\nHeritage and Creative\nIndustries\nจวอ.303 การจัดการโครงการทาง 3 (3-0-6) จวอ.303 การจัดการโครงการ 3 (3-0-6) ปรับชื่อวิชา\nวัฒนธรรม ทางมรดกวัฒนธรรมและ\nHIM303 Management of Cultural อุตสาหกรรมสร้างสรรค์\nProjects HIM303 Project Management for\nCultural Heritage and\nCreative Industries\nจวอ.304 การจัดการเชิงกลยุทธ์ 3 (3-0-6) จวอ.304 กลยุทธ์การจดัการเพื่อ 3 (3-0-6) ปรับชื่อวิชา และ\nเพื่องานวัฒนธรรม มรดกวัฒนธรรมและอุตสาหกรรม คำอธิบายรายวิชา\nHIM304 Strategic Management for สร้างสรรค์\nCulture HIM304 Strategic Management for\nCultural Heritage and\nCreative Industries\nจวอ.310 หลักการจดัการและ 3 (3-0-6) - ปิดวิชา เนอื่งจากยุบ\nการจัดการองค์การเพื่องาน รวม จวอ.304/310\nวัฒนธรรม\nHIM310 Principle for Management\nand Organization\nManagement for Culture\nจวอ.320 การจัดการมรดกภูมิ 3 (3-0-6) จวอ.320 การจัดการมรดกภูมิ 3 (3-0-6) คงเดิม\nปัญญาทางวัฒนธรรม ปัญญาทางวัฒนธรรม\nHIM320 Intangible Cultural Heritage HIM320 Intangible Cultural Heritage\nManagement Management\nมคอ. 2 หลักสูตรศิลปศาสตรบัณฑิต สาขาวิชาการจัดการมรดกวัฒนธรรมและอตุ สาหกรรมสร้างสรรค์ หน้า 77 หลักสูตร ฉบบัพ.ศ. 2561 หลักสูตร ฉบบัพ.ศ. 2566 สรุปการ\nเปลี่ยนแปลง\nจวอ.340 ภาษาอังกฤษ 3 (3-0-6) จวอ.340 ภาษาอังกฤษเพื่อการ 3 (3-0-6) ปรับชื่อวิชา และ\nเพื่อการจัดการทางวัฒนธรรม จัดการทางมรดกวัฒนธรรมและ คำอธิบายรายวิชา\nHIM340 English for Cultural อุตสาหกรรมสร้างสรรค์\nManagement HIM340 English for Management of\nCultural Heritage and\nCreative Industries\nจวอ.400 การศึกษาเฉพาะเรื่อง 1 3 (3-0-6) จวอ.400 การศึกษาเฉพาะเรื่อง ปรับชื่อวิชา และ\nHIM400 Special Project 1 HIM400 Special Project คำอธิบายรายวิชา\nจวอ.401 การศึกษาเฉพาะเรื่อง 2 3 (3-0-6) ปิดวิชา เนื่องจากยุบ\nHIM401 Special Project 2 รวม จวอ.400/401\nจวอ.410 กฎหมายและจริยธรรม 3 (3-0-6) จวอ.410 กฎหมายและจริยธรรมในการ ปรับชื่อวิชา และ\nในการจัดการทางวัฒนธรรม จัดการมรดกวัฒนธรรมและ คำอธิบายรายวิชา\nอุตสาหกรรมสร้างสรรค์\nHIM410 Laws and Ethics in Cultural HIM410 Laws and Ethics in\nManagement Management of Cultural\nHeritage and Creative\nIndustries\nจวอ.411 การฝึกปฏิบัติงานด้านการจัดการ จวอ.411 การฝึกปฏิบัติงานด้านการจัดการ ปรับชื่อวิชา และ\nทางวัฒนธรรม มรดกวัฒนธรรมและอุตสาหกรรม คำอธิบายรายวิชา\n3 (ฝึกงาน 250 ชม.) สร้างสรรค์\n3 (ฝึกงาน 250 ชม.)\nHIM411 Internship for Cultural HIM411 Internship for Cultural\nManagement Heritage Management and\nCreative Industries\nจวอ.413 การสื่อสารข้าม 3 (3-0-6) จวอ.313 การสื่อสารข้าม 3 (3-0-6) ปรับรหสัวิชำ และ\nวัฒนธรรม วัฒนธรรม คำอธิบายรายวิชา\nHIM413 Cross-Cultural HIM313 Cross-Cultural\nCommunication Communication\nวิชาบังคับเลือก 9 หน่วยกิต วิชาบังคับเลือก 9 หน่วยกิต ยกเลิกการกำหนด\nนักศึกษาต้องศึกษารายวิชาในหมวดวิชาบังคับ นักศึกษาต้องศึกษารายวิชาในหมวดวิชาบังคับ รายละเอียดกลุ่ม\nเลือก จำนวน 9 หน่วยกิต โดยเลือกศึกษาจาก เลือก จำนวน 9 หน่วยกิต โดยเลือกศึกษาจาก วิชาในเงื่อนไขวิชา\nรายวิชาที่กำหนดไว้ในกลุ่มใดกลุ่มหนึ่ง ดังนี้กลุ่ม รายวิชาที่กำหนดไว้เฉพาะกลุ่มใดกลุ่มหนึ่ง ดังนี้บังคับเลือก\nมคอ. 2 หลักสูตรศิลปศาสตรบัณฑิต สาขาวิชาการจัดการมรดกวัฒนธรรมและอตุ สาหกรรมสร้างสรรค์ หน้า 78 หลักสูตร ฉบบัพ.ศ. 2561 หลักสูตร ฉบบัพ.ศ. 2566 สรุปการ\nเปลี่ยนแปลง\nภาษาและวัฒนธรรมเขมร กลุ่มภาษาและ\nวัฒนธรรมพม่า กลุ่มภาษาและวัฒนธรรม\nเวียดนาม กลุ่มภาษาและวัฒนธรรมลาว กลมุ่\nภาษาและวัฒนธรรมอินโดนีเซีย กลุ่มภาษาและ\nวัฒนธรรมจีน กลมุ่ภาษาและวัฒนธรรมเกาหลี\nกลุ่มภาษาและวัฒนธรรมเขมร กลุ่มภาษาและวัฒนธรรมเขมร\nจวอ.250 ภาษาและวัฒนธรรมเขมรเบื้องต้น จวอ.250 ทักษะการสื่อสารภาษาและ เปลี่ยนชื่อวิชา และ\nHIM250 Basic Khmer Language and วัฒนธรรมเขมรเบื้องต้น คำอธิบายรายวิชา\nCulture 3 (3-0-6) HIM250 Basic Communicative Skills\non Khmer Language and\nCulture 3 (3-0-6)\nจวอ.350 ภาษาและวัฒนธรรมเขมร จวอ.350 ทักษะการสื่อสารภาษาและ เปลี่ยนชื่อวิชา และ\nระดับกลาง วัฒนธรรมเขมรระดับกลาง คำอธิบายรายวิชา\nHIM350 Intermediate Khmer HIM350 Intermediate Communicative\nLanguage and Culture Skills on Khmer Language\n3 (3-0-6) and Culture 3 (3-0-6)\nจวอ.370 ภาษาและวัฒนธรรมเขมรระดับสูง จวอ.370 ทักษะการสื่อสารภาษาและ เปลี่ยนชื่อวิชา และ\nHIM370 Advanced Khmer Language วัฒนธรรมเขมรระดับสูง คำอธิบายรายวิชา\nand Culture 3 (3-0-6) HIM370 Advanced Communicative\nSkills on Khmer Language\nand Culture 3 (3-0-6)\nกลุ่มภาษาและวัฒนธรรมพม่า กลุ่มภาษาและวัฒนธรรมพม่า\nจวอ.251 ภาษาและวัฒนธรรมพม่าเบื้องต้น จวอ.251 ทักษะการสื่อสารภาษาและ เปลี่ยนชื่อวิชา และ\nHIM251 Basic Burmese Language and วัฒนธรรมพม่าเบื้องต้น คำอธิบายรายวิชา\nCulture 3 (3-0-6) HIM251 Basic Communicative Skills\non Burmese Language and\nCulture 3 (3-0-6)\nจวอ.351 ภาษาและวัฒนธรรมพม่า จวอ.351 ทักษะการสื่อสารภาษาและ เปลี่ยนชื่อวิชา และ\nระดับกลาง วัฒนธรรมพม่าระดับกลาง คำอธิบายรายวิชา\nHIM351 Intermediate Burmese Language HIM351 Intermediate Communicative\nand Culture 3 (3-0-6) Skills on Burmese Language\nand Culture 3 (3-0-6)\nจวอ.371 ภาษาและวัฒนธรรมพม่าระดับสูง จวอ.371 ทักษะการสื่อสารภาษาและ เปลี่ยนชื่อวิชา และ\nHIM371 Advanced Burmese Language วัฒนธรรมพม่าระดับสูง คำอธิบายรายวิชา\nand Culture 3 (3-0-6) HIM371 Advanced Communicative\nมคอ. 2 หลักสูตรศิลปศาสตรบัณฑิต สาขาวิชาการจัดการมรดกวัฒนธรรมและอตุ สาหกรรมสร้างสรรค์ หน้า 79 หลักสูตร ฉบบัพ.ศ. 2561 หลักสูตร ฉบบัพ.ศ. 2566 สรุปการ\nเปลี่ยนแปลง\nSkills on Burmese Language\nand Culture 3 (3-0-6)\nกลุ่มภาษาและวัฒนธรรมมลายู กลุ่มภาษาและวัฒนธรรมมลายู\nจวอ.252 ภาษาและวัฒนธรรมมลายู จวอ.252 ทักษะการสื่อสารภาษาและ เปลี่ยนชื่อวิชา และ\nเบื้องต้น วัฒนธรรมมลายเูบื้องต้น คำอธิบายรายวิชา\nHIM252 Basic Malay Language and HIM252 Basic Communicative Skills\nCulture 3 (3-0-6) on Malay Language and\nCulture 3 (3-0-6)\nจวอ.352 ภาษาและวัฒนธรรมมลายู จวอ.352 ทักษะการสื่อสารภาษาและ เปลี่ยนชื่อวิชา และ\nระดับกลาง วัฒนธรรมมลายรูะดับกลาง คำอธิบายรายวิชา\nHIM352 Intermediate Malay HIM352 Intermediate Communicative\nLanguage and Culture Skills on Malay Language\n3 (3-0-6) and Culture 3 (3-0-6)\nจวอ.372 ภาษาและวัฒนธรรมมลายู จวอ.372 ทักษะการสื่อสารภาษาและ เปลี่ยนชื่อวิชา และ\nระดับสูง วัฒนธรรมมลายรูะดับสูง คำอธิบายรายวิชา\nHIM372 Advanced Malay Language HIM372 Advanced Communicative\nand Culture 3 (3-0-6) Skills on Malay Language\nand Culture 3 (3-0-6)\nกลุ่มภาษาและวัฒนธรรมเวียดนาม กลุ่มภาษาและวัฒนธรรมเวียดนาม\nจวอ.253 ภาษาและวัฒนธรรมเวียดนาม จวอ.253 ทักษะการสื่อสารภาษาและ เปลี่ยนชื่อวิชา และ\nเบื้องต้น วัฒนธรรมเวียดนามเบื้องต้น คำอธิบายรายวิชา\nHIM253 Basic Vietnamese Language Basic Communicative Skills\nHIM253\nand Culture 3 (3-0-6) on Vietnamese Language\nand Culture 3 (3-0-6)\nจวอ.353 ภาษาและวัฒนธรรมเวียดนาม จวอ.353 ทักษะการสื่อสารภาษาและ เปลี่ยนชื่อวิชา และ\nระดับกลาง วัฒนธรรมเวียดนามระดับกลาง คำอธิบายรายวิชา\nHIM353 Intermediate Vietnamese HIM353 Intermediate Communicative\nLanguage and Culture Skills on Vietnamese Language\n3 (3-0-6) and Culture 3 (3-0-6)\nจวอ.373 ภาษาและวัฒนธรรมเวียดนาม จวอ.373 ทักษะการสื่อสารภาษาและ เปลี่ยนชื่อวิชา และ\nระดับสูง วัฒนธรรมเวียดนามระดับสูง คำอธิบายรายวิชา\nHIM373 Advanced Vietnamese HIM373 Advanced Communicative\nLanguage and Culture 3 (3-0-6) Skills on Vietnamese Language\nมคอ. 2 หลักสูตรศิลปศาสตรบัณฑิต สาขาวิชาการจัดการมรดกวัฒนธรรมและอตุ สาหกรรมสร้างสรรค์ หน้า 80 หลักสูตร ฉบบัพ.ศ. 2561 หลักสูตร ฉบบัพ.ศ. 2566 สรุปการ\nเปลี่ยนแปลง\nand Culture 3 (3-0-6)\nกลุ่มภาษาและวัฒนธรรมลาว กลุ่มภาษาและวัฒนธรรมลาว\nจวอ.254 ภาษาและวัฒนธรรมลาวเบื้องต้น จวอ.254 ทักษะการสื่อสารภาษาและ เปลี่ยนชื่อวิชา และ\nHIM254 Basic Lao Language and วัฒนธรรมลาวเบื้องต้น คำอธิบายรายวิชา\nCulture HIM254 Basic Communicative Skills\non Lao Language and\nCulture\nจวอ.354 ภาษาและวัฒนธรรมลาว จวอ.354 ทักษะการสื่อสารภาษาและ เปลี่ยนชื่อวิชา และ\nระดับกลาง วัฒนธรรมลาวระดับกลาง คำอธิบายรายวิชา\nHIM354 Intermediate Lao Language HIM354 Intermediate Communicative\nand Culture Skills on Lao Language and\nCulture\nจวอ.374 ภาษาและวัฒนธรรมลาวระดับสูง จวอ.374 ทักษะการสื่อสารภาษาและ เปลี่ยนชื่อวิชา และ\nHIM374 Advanced Lao Language and วัฒนธรรมลาวระดับสูง คำอธิบายรายวิชา\nCulture HIM374 Advanced Communicative\nSkills on Lao Language and\nCulture\nกลุ่มภาษาและวัฒนธรรมอินโดนเีซีย กลุ่มภาษาและวัฒนธรรมอินโดนเีซีย\nจวอ.255 ภาษาและวัฒนธรรมอินโดนีเซีย จวอ.255 ทักษะการสื่อสารภาษาและ เปลี่ยนชื่อวิชา และ\nเบื้องต้น วัฒนธรรมอินโดนีเซียเบื้องต้น คำอธิบายรายวิชา\nHIM255 Basic Indonesian Language HIM255 Basic Communicative Skills\nand Culture on Indonesian Language and\nCulture\nจวอ.355 ภาษาและวัฒนธรรมอินโดนีเซีย จวอ.355 ทักษะการสื่อสารภาษาและ เปลี่ยนชื่อวิชา และ\nระดับกลาง วัฒนธรรมอินโดนีเซียระดบักลาง คำอธิบายรายวิชา\nHIM355 Intermediate Indonesian HIM355 Intermediate Communicative\nLanguage and Culture Skills on Indonesian\nLanguage and Culture\nจวอ.375 ภาษาและวัฒนธรรมอินโดนีเซีย จวอ.375 ทักษะการสื่อสารภาษาและ เปลี่ยนชื่อวิชา และ\nระดับสูง วัฒนธรรมอินโดนีเซียระดบัสูง คำอธิบายรายวิชา\nHIM375 Advanced Indonesian HIM375 Advanced Communicative\nLanguage and Culture Skills on Indonesian\nLanguage and Culture\nกลุ่มภาษาและวัฒนธรรมจนีกลุ่มภาษาและวัฒนธรรมจนี\nจวอ.260 ภาษาและวัฒนธรรมจีนเบื้องต้น จวอ.260 ทักษะการสื่อสารภาษาและ เปลี่ยนชื่อวิชา และ\nมคอ. 2 หลักสูตรศิลปศาสตรบัณฑิต สาขาวิชาการจัดการมรดกวัฒนธรรมและอตุ สาหกรรมสร้างสรรค์ หน้า 81 หลักสูตร ฉบบัพ.ศ. 2561 หลักสูตร ฉบบัพ.ศ. 2566 สรุปการ\nเปลี่ยนแปลง\nHIM260 Basic Chinese Language and วัฒนธรรมจีนเบื้องต้น คำอธิบายรายวิชา\nCulture HIM260 Basic Communicative Skills\non Chinese Language and\nCulture\nจวอ.360 ภาษาและวัฒนธรรมจีน จวอ.360 ทักษะการสื่อสารภาษาและ เปลี่ยนชื่อวิชา และ\nระดับกลาง วัฒนธรรมจีนระดับกลาง คำอธิบายรายวิชา\nHIM360 Intermediate Chinese HIM360 Intermediate Communicative\nLanguage and Culture Skills on Chinese Language\nand Culture\nจวอ.380 ภาษาและวัฒนธรรมจีนระดับสูง จวอ.380 ทักษะการสื่อสารภาษาและ เปลี่ยนชื่อวิชา และ\nHIM380 Advanced Chinese Language วัฒนธรรมจีนระดับสูง คำอธิบายรายวิชา\nand Culture HIM380 Advanced Communicative\nSkills on Chinese Language\nand Culture\nกลุ่มภาษาและวัฒนธรรมเกาหลีกลุ่มภาษาและวัฒนธรรมเกาหลี\nนบ.271 ภาษาและวัฒนธรรมเกาหลีเบื้องต้น จวอ.261 ทักษะการสื่อสารภาษาและ เปลี่ยนรหัส, ชื่อวิชา\nSV271 Basic Korean Language and วัฒนธรรมเกาหลีเบื้องต้น และคำอธิบาย\nCulture HIM261 Basic Communicative Skills on รายวิชา\nKorean Language and Culture\nนบ.272 ภาษาและวัฒนธรรมเกาหลีระดับกลาง จวอ.361 ทักษะการสื่อสารภาษาและ เปลี่ยนรหัส, ชื่อวิชา\nSV272 Intermediate Korean Language วัฒนธรรมเกาหลีระดับกลาง และคำอธิบาย\nand Culture HIM361 Intermediate Communicative รายวิชา\nSkills on Korean Language\nand Culture\nนบ.273 ภาษาและวัฒนธรรมเกาหลีระดับสูง จวอ.381 ทักษะการสื่อสารภาษาและ เปลี่ยนรหัส, ชื่อวิชา\nSV273 Advanced Korean Language วัฒนธรรมเกาหลีระดับสูง และคำอธิบาย\nand Culture HIM381 Advanced Communicative รายวิชา\nSkills on Korean Language\nand Culture\nวิชาเลือก วิชาเลือก 15 หน่วยกิต คงเดิม\nนักศึกษาต้องศึกษาวิชาเลือก จำนวนไม่น้อยกว่า นักศึกษาต้องศึกษาวิชาเลือก จำนวนไม่น้อยกว่า\n15 หน่วยกิต จากหมวดวิชาทั้ง 2 หมวด ดังนี้ 15 หน่วยกิต จากหมวดวิชาทั้ง 2 หมวด ดังนี้\nหมวดมรดกทางวัฒนธรรม หมวดมรดกทางวัฒนธรรม\nจวอ.227 การจัดการมรดกทางโบราณคดีจวอ.227 การจัดการมรดกทางโบราณคดีคงเดิม\nHIM227 Archaeological Heritage HIM227 Archaeological Heritage\nManagement Management\nมคอ. 2 หลักสูตรศิลปศาสตรบัณฑิต สาขาวิชาการจัดการมรดกวัฒนธรรมและอตุ สาหกรรมสร้างสรรค์ หน้า 82 หลักสูตร ฉบบัพ.ศ. 2561 หลักสูตร ฉบบัพ.ศ. 2566 สรุปการ\nเปลี่ยนแปลง\nจวอ.326 การอนุรักษ์และการพัฒนามรดก จวอ.326 การพัฒนาและการจัดการมรดก เปลี่ยนชื่อวิชา และ\nทางวัฒนธรรมเพื่อความยั่งยืน ทางวัฒนธรรมเชิงบูรณาการ คำอธิบายรายวิชา\nHIM326 Cultural Heritage HIM326 Integrated Cultural Heritage\nConservation and Management and\nDevelopment for Development\nSustainability\nจวอ.328 การจัดการสารสนเทศและ จวอ.328 การจัดการข้อมูลดิจิทัลทาง เปลี่ยนชื่อวิชา และ\nฐานข้อมูลทางวัฒนธรรม วัฒนธรรม คำอธิบายรายวิชา\nHIM328 Cultural Information and HIM328 Management of Digitalized\nDatabase Management Data for Culture\nจวอ.329 การจัดการภูมิทัศน์วัฒนธรรม จวอ.329 การจัดการภูมิทัศน์วัฒนธรรม เปลี่ยนคำอธิบาย\nHIM329 Cultural Landscape HIM329 Cultural Landscape รายวิชา\nManagement Management\nจวอ.426 การจัดการการท่องเที่ยว จวอ.426 การจัดการการท่องเที่ยว เปลี่ยนคำอธิบาย\nวัฒนธรรม วัฒนธรรม รายวิชา\nHIM426 Cultural Tourism HIM426 Cultural Tourism\nManagement Management\nจวอ.427 การจัดการพิพิธภัณฑสถานและ จวอ.427 การจัดการพิพิธภัณฑ์และแหล่ง เปลี่ยนชื่อวิชา และ\nแหล่งเรียนรู้ทางวัฒนธรรม เรียนรู้ทางวัฒนธรรม คำอธิบายรายวิชา\nHIM427 Museum and Cultural HIM427 Museum and Cultural\nLearning Center Learning Center\nManagement Management\nจวอ.428 การจัดการมรดกเมือง จวอ.428 การจัดการมรดกเมือง เปลี่ยนคำอธิบาย\nHIM428 Urban Heritage Management HIM428 Urban Heritage Management รายวิชา\nหมวดอุตสาหกรรมสร้างสรรค์ หมวดอุตสาหกรรมสร้างสรรค์\nจวอ.336 การจัดการอุตสาหกรรม จวอ.336 อุตสาหกรรมสร้างสรรค์ในบริบท เปลี่ยนชื่อวิชา\nสร้างสรรค์ในบริบทสากล สากล\nHIM336 Global Creative Industries HIM336 Global Creative Industries\nManagement\nจวอ.337 อุตสาหกรรมภาพยนตร์ โลกาภิจวอ.337 อุตสาหกรรมภาพยนตร์ โลกาภิ เปลี่ยนคำอธิบาย\nวัตน์ และอตัลักษณ์ วัตน์ และอัตลักษณ์ รายวิชา\nHIM337 Film Industry, Globalization HIM337 Film Industry, Globalization\nมคอ. 2 หลักสูตรศิลปศาสตรบัณฑิต สาขาวิชาการจัดการมรดกวัฒนธรรมและอตุ สาหกรรมสร้างสรรค์ หน้า 83 หลักสูตร ฉบบัพ.ศ. 2561 หลักสูตร ฉบบัพ.ศ. 2566 สรุปการ\nเปลี่ยนแปลง\nand Identities and Identities\nจวอ.338 อุตสาหกรรมโทรทัศน์และสื่อใหม่จวอ.338 อุตสาหกรรมโทรทัศน์และสื่อใหม่คงเดิม\nในยุคดิจิทัล ในยุคดิจิทัล\nHIM338 Television industry and New HIM338 Television industry and New\nMedia in the Digital Era Media in the Digital Era\nจวอ.339 ศิลปะการแสดง: จากวัฒนธรรมสู่จวอ.339 ศิลปะการแสดง: จากวัฒนธรรมสู่คงเดิม\nอุตสาหกรรม อุตสาหกรรม\nHIM339 Performing Arts: from HIM339 Performing Arts: from\nCulture to Industry Culture to Industry\nจวอ.437 การจัดการศิลปะการแสดง จวอ.437 การจัดการศิลปะการแสดง เปลี่ยนคำอธิบาย\nHIM437 Performing Arts Management HIM437 Performing Arts Management รายวิชา\nจวอ.438 การจัดการศิลปิน จวอ.438 การจัดการศิลปิน เปลี่ยนคำอธิบาย\nHIM438 Artist Management HIM438 Artist Management รายวิชา\nจวอ.439 การจัดการผู้ชม จวอ.439 การจัดการผู้ชม คงเดิม\nHIM439 Audience Management HIM439 Audience Management\nวิชาเลือกเสรี 6 หน่วยกิต วิชาเลือกเสรี 9 หน่วยกิต เพิ่มหน่วยกิตวิชา\nนักศึกษาสามารถเลือกศึกษาวิชาใดก็ได้ที่เปดิสอน นักศึกษาสามารถเลือกศึกษาวิชาใดก็ได้ที่เปิด เลือกเสรี 3 หน่วย\nในมหาวิทยาลัยธรรมศาสตร์วชิาเลือกเสรีสอนในมหาวิทยาลัยธรรมศาสตร์วิชาเลือก กิต และยกเลิกการ\nหรือเลือกศึกษาจากวิชาที่คณะเปดิสอนจำนวนไม่ เสรีหรือเลือกศึกษาจากวิชาที่คณะเปิดสอน ไม่นับหน่วยกติวิชา\nน้อยกว่า 6 หน่วยกิต ทั้งนี้ให้หมายรวมถึงวิชา จำนวนไม่น้อยกว่า 9 หน่วยกิต ท.162, ท.163\nศึกษาทั่วไป หมวดภาษาต่างประเทศด้วย นักศึกษาไม่สามารถนำรายวิชาในหลักสูตรวิชา วิชาเลือกเสรี\nนักศึกษาไมส่ำมารถนำวิชาต่อไปนมี้านับวิชา ศึกษาทั่วไปที่รหัสระดับ 100 ไปนับวิชา\nเลือกเสรไีด้ เลือกเสรีหรือวิชาเลือกหรือวิชาโท\n-วิชาในหลักสูตรวิชาศึกษาทั่วไปทั้งส่วนที่ 1 และ\nส่วนที่ 2 ที่ใช้รหัสย่อ “มธ.” ระดบั 100 คือ มธ.\n100 - มธ.156 วิชา ท.162 การเขียนรายงานทาง\nวิชาการ และ ท.163 การเขียนเพอื่การสื่อสารใน\nองค์กร\nวิชาเลือกเสรีที่คณะเปิดสอนมดีังนี้\nวิชาเลือกเสรีที่คณะเปิดสอนมดีังนี้\nจวอ.399 แฟชั่น: การออกแบบ จวอ.399 นวัตกรรมการจดัการแฟชั่นในยุค เปลี่ยนชื่อวิชา และ\nอุตสาหกรรม และวัฒนธรรม ดิจิทัล คำอธิบายรายวิชา\nHIM399 Fashion: Design, Industry and HIM399 Innovation of Fashion\nCulture Management in Digital Era\nจวอ.496 การออกแบบและสร้างสรรค์สื่อ จวอ.496 การออกแบบและสร้างสรรค์สื่อ เปลี่ยนคำอธิบาย\nใหม่ ใหม่รายวิชา\nHIM496 Design and Creativity for HIM496 Design and Creativity for\nมคอ. 2 หลักสูตรศิลปศาสตรบัณฑิต สาขาวิชาการจัดการมรดกวัฒนธรรมและอตุ สาหกรรมสร้างสรรค์ หน้า 84 หลักสูตร ฉบบัพ.ศ. 2561 หลักสูตร ฉบบัพ.ศ. 2566 สรุปการ\nเปลี่ยนแปลง\nNew Media New Media\nจวอ.497 การออกแบบนิทรรศการ จวอ.497 การออกแบบนิทรรศการ เปลี่ยนคำอธิบาย\nHIM497 Exhibition Design HIM497 Exhibition Design รายวิชา\nจวอ.498 ธุรกิจดนตรีจวอ.498 ธุรกิจดนตรีคงเดิม\nHIM498 Music Business HIM498 Music Business\n- จวอ.396 การเขียนเชิงสร้างสรรค์เพื่องาน เปิดวิชาใหม่\nวัฒนธรรม\nHIM396 Creative Writings for Culture\n- จวอ.397 การสร้างแบรนดสิ์นคำเพื่อการ เปิดวิชาใหม่\nจัดการมรดกวัฒนธรรมและ\nอุตสาหกรรมสร้างสรรค์\nHIM397 Brand Product for\nManagement of Cultural\nHeritage and Creative\nIndustries\n- จวอ.398 ผู้ประกอบการทางวัฒนธรรมและ เปิดวิชาใหม่\nอุตสาหกรรมสร้างสรรค์\nHIM398 Entrepreneurship in Culture\nand Creative Industries\n- จวอ.499 หัวขอ้ เฉพาะในการจัดการมรดก เปิดวิชาใหม่\nวัฒนธรรมและอุตสาหกรรม\nสร้างสรรค์\nHIM499 Selected Topics in\nManagement of Cultural\nHeritage and Creative\nIndustries\nภาคผนวก 3 ตารางเทียบรายวิชาในหลักสูตรศิลปศาสตรบัณฑิต สาขาวิชาการจัดการมรดก\nวัฒนธรรมและอุตสาหกรรมสร้างสรรค์ ฉบับปรับปรุง พ.ศ. 2561 กับ ฉบับปรับปรุง พ.ศ. 2566\nรายวิชาในหลักสูตร พ.ศ. 2561 รายวิชาในหลักสูตร พ.ศ. 2566\nมคอ. 2 หลักสูตรศิลปศาสตรบัณฑิต สาขาวิชาการจัดการมรดกวัฒนธรรมและอตุ สาหกรรมสร้างสรรค์ หน้า 85 รายวิชาในหลักสูตร พ.ศ. 2561 รายวิชาในหลักสูตร พ.ศ. 2566\nรายวิชาที่เทียบได้รายวิชาที่เทียบได้\nจวอ.200 แนวคิดและทฤษฎดี้าน (3 หน่วยกิต) จวอ.200 แนวคิดและทฤษฎดี้าน (3 หน่วยกิต)\nมรดกวัฒนธรรม มรดกวัฒนธรรม\nและอุตสาหกรรมสร้างสรรค์ และอุตสาหกรรมสร้างสรรค์\nHIM200 Concepts and Theories of HIM200 Concepts and Theories of\nCultural Heritage and Creative Cultural Heritage and\nIndustries Creative Industries\nจวอ.201 การบัญชีและการเงิน (3 หน่วยกิต) จวอ.201 การบัญชีและการเงิน (3 หน่วยกิต)\nเพื่อการจัดการทางวัฒนธรรม เพื่อการจัดการมรดกวัฒนธรรม\nHIM201 Accounting and Finance for และอุตสาหกรรมสร้างสรรค์\nCultural Management HIM201 Accounting and Finance for\nManagement of Cultural\nHeritage and Creative Industries\nจวอ.202 ประวัติศาสตร์ศิลปะเพื่อการ (3 หน่วยกิต) จวอ.202 ศิลปะเพื่อการสร้างสรรค์ (3 หน่วยกิต)\nสร้างสรรค์ทางวัฒนธรรม นวัตกรรม\nHIM202 History of Arts for Cultural HIM202 Art for Creative Innovation\nCreativity\nจวอ.203 โลกแห่งอารยธรรมและการ (3 หน่วยกิต) จวอ.203 อารยธรรม การเปลี่ยนแปลงและ (3 หน่วยกิต)\nเปลี่ยนแปลงทางวัฒนธรรม นวัตกรรม\nHIM203 World Civilization and HIM203 Civilization, Tranformation,\nCultural Change and Innovation\nจวอ.204 แนวคิดทางมานุษยวิทยาเพื่องาน (3 หน่วยกิต) จวอ.204 มานุษยวิทยาประยุกต์เพื่อการ (3 หน่วยกิต)\nวัฒนธรรม จัดการมรดกวัฒนธรรมและ\nHIM204 Anthropological Concepts of อุตสาหกรรมสร้างสรรค์\nCulture HIM204 Applied Anthropology for\nManagement of Cultural\nHeritage and Creative\nIndustries\nจวอ.205 หลักเศรษฐศาสตร์เบื้องต้น (3 ห น่ว ย กิต) จวอ.205 หลักเศรษฐศาสตร์เพื่อการจัดการ (3 หน่วยกิต)\nHIM205 Principles of Economics มรดกวัฒนธรรมและอุตสาหกรรม\nสร้างสรรค์\nHIM205 Principles of Economics for\nManagement of Cultural\nHeritage and Creative Industries\nจวอ.210 หลักการตลาดเพื่อการจดัการทาง (3 หน่วยกิต) จวอ.210 หลักการตลาดเพื่อการจดัการ (3 หน่วยกิต)\nวัฒนธรรม มรดกวัฒนธรรมและอุตสาหกรรม\nHIM210 Marketing Principles for สร้างสรรค์\nมคอ. 2 หลักสูตรศิลปศาสตรบัณฑิต สาขาวิชาการจัดการมรดกวัฒนธรรมและอตุ สาหกรรมสร้างสรรค์ หน้า 86 รายวิชาในหลักสูตร พ.ศ. 2561 รายวิชาในหลักสูตร พ.ศ. 2566\nCultural Management HIM210 Marketing Principles for\nManagement of Cultural\nHeritage and Creative\nIndustries\nจวอ.212 การจัดการทรัพยากร (3 หน่วยกิต) จวอ.212 การจัดการทรัพยากร (3 หน่วยกิต)\nทางวัฒนธรรม ทางวัฒนธรรม\nHIM212 Cultural Resource HIM212 Cultural Resource\nManagement Management\nจวอ.214 สื่อและวัฒนธรรมเชิง (3 หน่วยกิต) จวอ.214 สื่อและวัฒนธรรมเชิง (3 หน่วยกิต)\nวิพากษ์ วิพากษ์\nHIM214 Critical Media and Cultural HIM214 Critical Media and Cultural\nStudies Studies\nจวอ.215 ทัศนวัฒนธรรมร่วมสมยั (3 หน่วยกิต) จวอ.215 ทัศนวัฒนธรรมร่วมสมยั (3 หน่วยกิต)\nHIM215 Contemporary Visual Culture HIM215 Contemporary Visual Culture\nจวอ.230 กระบวนการสร้างสรรค์ (3 หน่วยกิต) จวอ.230 กระบวนการสร้างสรรค์ (3 หน่วยกิต)\nและการผลิตในอุตสาหกรรมสื่อ และการผลิตในอุตสาหกรรมสื่อ\nHIM230 Creative Process and HIM230 Creative Process and\nProduction in Media Industries Production in Media Industries\nจวอ.300 นโยบายทางวัฒนธรรม (3 หน่วยกิต) จวอ.300 นโยบายทางวัฒนธรรม (3 หน่วยกิต)\nHIM300 Cultural Policy HIM300 Cultural Policy\nจวอ.301 การจัดการความรู้และ (3 หน่วยกิต) จวอ.301 การจัดการความรู้และ (3 หน่วยกิต)\nความคิดสร้างสรรค์ ความคิดสร้างสรรค์\nHIM301 Knowledge and Creativity HIM301 Knowledge and Creativity\nManagement Management\nจวอ.302 ระเบียบวิธีวิจยั เพื่อการ (3 หน่วยกิต) จวอ.302 ระเบียบวิธีวิจยั เพื่อการจดัการ (3 หน่วยกิต)\nจัดการทางวัฒนธรรม มรดกวัฒนธรรมและอุตสาหกรรม\nHIM302 Research Methodology for สร้างสรรค์\nCultural Management HIM302 Research Methodology for\nManagement Management of Cultural\nHeritage and Creative\nIndustries\nจวอ.303 การจัดการโครงการทางวัฒนธรรม (3 หน่วยกิต) จวอ.303 การจัดการโครงการทางมรดก (3 หน่วยกิต)\nHIM303 Management of Cultural วัฒนธรรมและอุตสาหกรรม\nProjects สร้างสรรค์\nHIM303 Project Management for\nCultural Heritage and\nCreative Industries\nมคอ. 2 หลักสูตรศิลปศาสตรบัณฑิต สาขาวิชาการจัดการมรดกวัฒนธรรมและอตุ สาหกรรมสร้างสรรค์ หน้า 87 รายวิชาในหลักสูตร พ.ศ. 2561 รายวิชาในหลักสูตร พ.ศ. 2566\nจวอ.304 การจัดการเชิงกลยุทธ์ (3 หน่วยกิต) จวอ.304 กลยุทธ์การจัดการเพอื่มรดก (3 หน่วยกิต)\nเพื่องานวัฒนธรรม วัฒนธรรมและอุตสาหกรรม\nHIM304 Strategic Management for สร้างสรรค์\nCulture HIM304 Strategic Management for\nCultural Heritage and Creative\nIndustries\nจวอ.320 การจัดการมรดกภูมิ 3 (3-0-6) (3 หน่วยกิต) จวอ.320 การจัดการมรดกภูมิ 3 (3-0-6) (3 หน่วยกิต)\nปัญญาทางวัฒนธรรม ปญัญาทางวัฒนธรรม\nHIM320 Intangible Cultural Heritage HIM320 Intangible Cultural Heritage\nManagement Management\nจวอ.340 ภาษาอังกฤษ 3 (3-0-6) (3 หน่วยกิต) จวอ.340 ภาษาอังกฤษ 3 (3-0-6) (3 หน่วยกิต)\nเพื่อการจัดการทางวัฒนธรรม เพื่อการจัดการทางมรดก\nHIM340 English for Cultural วัฒนธรรมและอุตสาหกรรม\nManagement สร้างสรรค์\nHIM340 English for Management of\nCultural Heritage and\nCreative\nจวอ.400 การศึกษาเฉพาะเรื่อง 1 3 (3-0-6) (3 หน่วยกิต) จวอ.400 การศึกษาเฉพาะเรื่อง 3 (3-0-6) (3 หน่วยกิต)\nHIM400 Special Project 1 HIM400 Special Project\nจวอ.410 กฎหมายและจริยธรรม 3 (3-0-6) (3 หน่วยกิต) จวอ.410 กฎหมายและจริยธรรม 3 (3-0-6) (3 หน่วยกิต)\nในการจัดการทางวัฒนธรรม ในการจัดการมรดกวัฒนธรรมและ\nHIM410 Laws and Ethics in Cultural อุตสาหกรรมสร้างสรรค์\nManagement HIM410 Laws and Ethics in\nManagement of Cultural\nHeritage and Creative\nจวอ.411 การฝึกปฏิบัติงานด้านการจัดการ (3 หน่วยกิต) จวอ.411 การฝึกปฏิบัติงานด้านการจัดการ (3 หน่วยกิต)\nทางวัฒนธรรม มรดกวัฒนธรรมและอุตสาหกรรม\n3 (ไม่น้อยกว่า 250 ชม.) สร้างสรรค์\nHIM411 Internship for Cultural 3 (ไม่น้อยกว่า 250 ชม.)\nManagement HIM411 Internship for Management\nof Cultural Heritage and\nCreative\nจวอ.413 การสื่อสารข้ามวัฒนธรรม (3 หน่วยกิต) จวอ.313 การสื่อสารข้ามวัฒนธรรม (3 หน่วยกิต)\nHIM413 Cross-Cultural Communication HIM313 Cross-Cultural Communication\nหมวดวิชาบังคับเลือก หมวดวิชาบังคับเลือก\nจวอ.250 ภาษาและวัฒนธรรมเขมรเบื้องต้น (3 หน่วยกิต) จวอ.250 ทักษะการสื่อสารภาษาและ (3 หน่วยกิต)\nHIM250 Basic Khmer Language and วัฒนธรรมเขมรเบื้องต้น\nมคอ. 2 หลักสูตรศิลปศาสตรบัณฑิต สาขาวิชาการจัดการมรดกวัฒนธรรมและอตุ สาหกรรมสร้างสรรค์ หน้า 88 รายวิชาในหลักสูตร พ.ศ. 2561 รายวิชาในหลักสูตร พ.ศ. 2566\nCulture HIM250 Basic Communicative Skills\non Khmer Language and\nCulture\nจวอ.350 ภาษาและวัฒนธรรมเขมร (3 หน่วยกิต) จวอ.350 ทักษะการสื่อสารภาษาและ (3 หน่วยกิต)\nระดับกลาง วัฒนธรรมเขมรระดับกลาง\nHIM350 Intermediate Khmer HIM350 Intermediate Communicative\nLanguage and Culture Skills on Khmer Language\nand Culture\nจวอ.370 ภาษาและวัฒนธรรมเขมรระดับสูง (3 หน่วยกิต) จวอ.370 ทักษะการสื่อสารภาษาและ (3 หน่วยกิต)\nHIM370 Advanced Khmer Language วัฒนธรรมเขมรระดับสูง\nand Culture HIM370 Advanced Communicative\nSkills on Khmer Language\nand Culture\nจวอ.251 ภาษาและวัฒนธรรมพม่าเบื้องต้น (3 หน่วยกิต) จวอ.251 ทักษะการสื่อสารภาษาและ (3 หน่วยกิต)\nHIM251 Basic Burmese Language and วัฒนธรรมพม่าเบื้องต้น\nCulture HIM251 Basic Communicative Skills on\nBurmese Language and Culture\nจวอ.351 ภาษาและวัฒนธรรมพม่าระดับกลาง (3 หน่วยกิต) จวอ.351 ทักษะการสื่อสารภาษาและ (3 หน่วยกิต)\nHIM351 Intermediate Burmese วัฒนธรรมพม่าระดบักลาง\nLanguage and Culture HIM351 Intermediate Communicative\nSkills on Burmese Language\nand Culture\nจวอ.371 ภาษาและวัฒนธรรมพม่าระดับสูง (3 หน่วยกิต) จวอ.371 ทักษะการสื่อสารภาษาและ (3 หน่วยกิต)\nHIM371 Advanced Burmese วัฒนธรรมพม่าระดบัสูง\nLanguage and Culture HIM371 Advanced Communicative\nSkills on Burmese Language\nand Culture\nจวอ.252 ภาษาและวัฒนธรรมมลายู (3 หน่วยกิต) จวอ.252 ทักษะการสื่อสารภาษาและ (3 หน่วยกิต)\nเบื้องต้น วัฒนธรรมมลายเูบื้องต้น\nHIM252 Basic Malay Language and HIM252 Basic Communicative Skills\nCulture on Malay Language and\nCulture\nจวอ.352 ภาษาและวัฒนธรรมมลายู (3 หน่วยกิต) จวอ.352 ทักษะการสื่อสารภาษาและ (3 หน่วยกิต)\nมคอ. 2 หลักสูตรศิลปศาสตรบัณฑิต สาขาวิชาการจัดการมรดกวัฒนธรรมและอตุ สาหกรรมสร้างสรรค์ หน้า 89 รายวิชาในหลักสูตร พ.ศ. 2561 รายวิชาในหลักสูตร พ.ศ. 2566\nระดับกลาง วัฒนธรรมมลายรูะดับกลาง\nHIM352 Intermediate Malay HIM352 Intermediate Communicative\nLanguage and Culture Skills on Malay Language\nand Culture\nจวอ.372 ภาษาและวัฒนธรรมมลายู (3 หน่วยกิต) จวอ.372 ทักษะการสื่อสารภาษาและ (3 หน่วยกิต)\nระดับสูง วัฒนธรรมมลายรูะดับสูง\nHIM372 Advanced Malay Language HIM372 Advanced Communicative\nand Culture Skills on Malay Language\nand Culture\nจวอ.253 ภาษาและวัฒนธรรมเวียดนาม (3 หน่วยกิต) จวอ.253 ทักษะการสื่อสารภาษาและ (3 หน่วยกิต)\nเบื้องต้น วัฒนธรรมเวียดนามเบื้องต้น\nHIM253 Basic Vietnamese Language HIM253 Basic Communicative Skills\nand Culture on Vietnamese Language\nand Culture\nจวอ.353 ภาษาและวัฒนธรรมเวียดนาม (3 หน่วยกิต) จวอ.353 ทักษะการสื่อสารภาษาและ (3 หน่วยกิต)\nระดับกลาง วัฒนธรรมเวียดนามระดับกลาง\nHIM353 Intermediate Vietnamese HIM353 Intermediate Communicative\nLanguage and Culture Skills on Vietnamese Language\nand Culture\nจวอ.373 ภาษาและวัฒนธรรมเวียดนาม (3 หน่วยกิต) จวอ.373 ทักษะการสื่อสารภาษาและ (3 หน่วยกิต)\nระดับสูง วัฒนธรรมเวียดนามระดับสูง\nHIM373 Advanced Vietnamese HIM373 Advanced Communicative\nLanguage and Culture Skills on Vietnamese Language\nand Culture\nจวอ.254 ภาษาและวัฒนธรรมลาวเบื้องต้น (3 หน่วยกิต) จวอ.254 ทักษะการสื่อสารภาษาและ (3 หน่วยกิต)\nHIM254 Basic Lao Language and วัฒนธรรมลาวเบื้องต้น\nCulture HIM254 Basic Communicative Skills on\nLao Language and Culture\nจวอ.354 ภาษาและวัฒนธรรมลาว (3 หน่วยกิต) จวอ.354 ทักษะการสื่อสารภาษาและ (3 หน่วยกิต)\nระดับกลาง วัฒนธรรมลาวระดับกลาง\nHIM354 Intermediate Lao Language HIM354 Intermediate Communicative\nมคอ. 2 หลักสูตรศิลปศาสตรบัณฑิต สาขาวิชาการจัดการมรดกวัฒนธรรมและอตุ สาหกรรมสร้างสรรค์ หน้า 90 รายวิชาในหลักสูตร พ.ศ. 2561 รายวิชาในหลักสูตร พ.ศ. 2566\nand Culture Skills on Lao Language and\nCulture\nจวอ.374 ภาษาและวัฒนธรรมลาวระดับสูง (3 หน่วยกิต) จวอ.374 ทักษะการสื่อสารภาษาและ (3 หน่วยกิต)\nHIM374 Advanced Lao Language and วัฒนธรรมลาวระดับสูง\nCulture HIM374 Advanced Communicative\nSkills on Lao Language and\nCulture\nจวอ.255 ภาษาและวัฒนธรรมอินโดนีเซีย (3 หน่วยกิต) จวอ.255 ทักษะการสื่อสารภาษาและ (3 หน่วยกิต)\nเบื้องต้น วัฒนธรรมอินโดนีเซียเบื้องต้น\nHIM255 Basic Indonesian Language HIM255 Basic Communicative Skills\nand Culture on Indonesian Language and\nCulture\nจวอ.355 ภาษาและวัฒนธรรมอินโดนีเซีย (3 หน่วยกิต) จวอ.355 ทักษะการสื่อสารภาษาและ (3 หน่วยกิต)\nระดับกลาง วัฒนธรรมอินโดนีเซียระดบักลาง\nHIM355 Intermediate Indonesian HIM355 Intermediate Communicative\nLanguage and Culture Skills on Indonesian\nLanguage and Culture\nจวอ.375 ภาษาและวัฒนธรรมอินโดนีเซีย (3 หน่วยกิต) จวอ.375 ทักษะการสื่อสารภาษาและ (3 หน่วยกิต)\nระดับสูง วัฒนธรรมอินโดนีเซียระดบัสูง\nHIM375 Advanced Indonesian HIM375 Advanced Communicative\nLanguage and Culture Skills on Indonesian\nLanguage and Culture\nจวอ.260 ภาษาและวัฒนธรรมจีนเบื้องต้น (3 หน่วยกิต) จวอ.260 ทักษะการสื่อสารภาษาและ (3 หน่วยกิต)\nHIM260 Basic Chinese Language and วัฒนธรรมจีนเบื้องต้น\nCulture HIM260 Basic Communicative Skills\non Chinese Language and\nCulture\nจวอ.360 ภาษาและวัฒนธรรมจีน (3 หน่วยกิต) จวอ.360 ทักษะการสื่อสารภาษาและ (3 หน่วยกิต)\nระดับกลาง วัฒนธรรมจีนระดับกลาง\nHIM360 Intermediate Chinese HIM360 Intermediate Communicative\nLanguage and Culture Skills on Chinese Language\nมคอ. 2 หลักสูตรศิลปศาสตรบัณฑิต สาขาวิชาการจัดการมรดกวัฒนธรรมและอตุ สาหกรรมสร้างสรรค์ หน้า 91 รายวิชาในหลักสูตร พ.ศ. 2561 รายวิชาในหลักสูตร พ.ศ. 2566\nand Culture\nจวอ.380 ภาษาและวัฒนธรรมจีนระดับสูง (3 หน่วยกิต) จวอ.380 ทักษะการสื่อสารภาษาและ (3 หน่วยกิต)\nHIM380 Advanced Chinese Language วัฒนธรรมจีนระดับสูง\nand Culture HIM380 Advanced Communicative\nSkills on Chinese Language\nand Culture\nนบ.271 ภาษาและวัฒนธรรมเกาหลีเบื้องต้น (3 หน่วยกิต) จวอ.261 ทักษะการสื่อสารภาษาและ (3 หน่วยกิต)\nSV271 Basic Korean Language and วัฒนธรรมเกาหลีเบื้องต้น\nCulture HIM261 Basic Communicative Skills\non Korean Language and\nCulture\nนบ.272 ภาษาและวัฒนธรรมเกาหลีระดับกลาง (3 หน่วยกิต) จวอ.361 ทักษะการสื่อสารภาษาและ (3 หน่วยกิต)\nSV272 Intermediate Korean Language วัฒนธรรมเกาหลีระดับกลาง\nand Culture HIM361 Intermediate Communicative\nSkills on Korean Language\nand Culture\nนบ.273 ภาษาและวัฒนธรรมเกาหลีระดับสูง (3 หน่วยกิต) จวอ.381 ทักษะการสื่อสารภาษาและ (3 หน่วยกิต)\nSV273 Advanced Korean Language วัฒนธรรมเกาหลีระดับสูง\nand Culture HIM381 Advanced Communicative\nSkills on Korean Language\nand Culture\nจวอ.227 การจัดการมรดกทางโบราณคดี (3 หน่วยกิต) จวอ.227 การจัดการมรดกทางโบราณคดี (3 หน่วยกิต)\nHIM227 Archaeological Heritage HIM227 Archaeological Heritage\nManagement Management\nจวอ.326 การอนุรักษ์และการพัฒนามรดก (3 หน่วยกิต) จวอ.326 การพัฒนาและการจัดการมรดก (3 หน่วยกิต)\nทางวัฒนธรรมเพื่อความยั่งยืน ทางวัฒนธรรมเชิงบูรณาการ\nHIM326 Cultural Heritage Conservation HIM326 Integrated Cultural Heritage\nand Development for Management and\nSustainability Development\nจวอ.328 การจัดการสารสนเทศและ (3 หน่วยกิต) จวอ.328 การจัดการข้อมูลดิจิทัลทาง (3 หน่วยกิต)\nมคอ. 2 หลักสูตรศิลปศาสตรบัณฑิต สาขาวิชาการจัดการมรดกวัฒนธรรมและอตุ สาหกรรมสร้างสรรค์ หน้า 92 รายวิชาในหลักสูตร พ.ศ. 2561 รายวิชาในหลักสูตร พ.ศ. 2566\nฐานข้อมูลทางวัฒนธรรม วัฒนธรรม\nHIM328 Cultural Information and HIM328 Management of Digitalized\nDatabase Management Data for Culture\nจวอ.329 การจัดการภูมิทัศน์วัฒนธรรม (3 หน่วยกิต) จวอ.329 การจัดการภูมิทัศน์วัฒนธรรม (3 หน่วยกิต)\nHIM329 Cultural Landscape HIM329 Cultural Landscape\nManagement Management\nจวอ.426 การจัดการการท่องเที่ยววัฒนธรรม (3 หน่วยกิต) จวอ.426 การจัดการการท่องเที่ยววัฒนธรรม (3 หน่วยกิต)\nHIM426 Cultural Tourism Management HIM426 Cultural Tourism Management\nจวอ.427 การจัดการพิพิธภัณฑสถานและ (3 หน่วยกิต) จวอ.427 การจัดการพิพิธภัณฑ์และแหล่ง (3 หน่วยกิต)\nแหล่งเรียนรู้ทางวัฒนธรรม เรียนรู้ทางวัฒนธรรม\nHIM427 Museum and Cultural HIM427 Museum and Cultural\nLearning Center Management Learning Center Management\nจวอ.428 การจัดการมรดกเมือง (3 หน่วยกิต) จวอ.428 การจัดการมรดกเมือง (3 หน่วยกิต)\nHIM428 Urban Heritage Management HIM428 Urban Heritage Management\nจวอ.336 การจัดการอุตสาหกรรม (3 หน่วยกิต) จวอ.336 อุตสาหกรรมสร้างสรรค์ในบริบท (3 หน่วยกิต)\nสร้างสรรค์ในบริบทสากล สากล\nHIM336 Global Creative Industries HIM336 Global Creative Industries\nManagement\nจวอ.337 อุตสาหกรรมภาพยนตร์ โลกาภิ (3 หน่วยกิต) จวอ.337 อุตสาหกรรมภาพยนตร์ โลกาภิ (3 หน่วยกิต)\nวัตน์ และอัตลักษณ์ วัตน์ และอัตลักษณ์\nHIM337 Film Industry, Globalization HIM337 Film Industry, Globalization\nand Identities and Identities\nจวอ.338 อุตสาหกรรมโทรทัศน์และสื่อใหม่ (3 หน่วยกิต) จวอ.338 อุตสาหกรรมโทรทัศน์และสื่อใหม่ (3 หน่วยกิต)\nในยุคดิจิทัล ในยุคดิจิทัล\nHIM338 Television industry and New HIM338 Television industry and New\nMedia in the Digital Era Media in the Digital Era\nจวอ.339 ศิลปะการแสดง: จากวัฒนธรรมสู่ (3 หน่วยกิต) จวอ.339 ศิลปะการแสดง: จากวัฒนธรรมสู่ (3 หน่วยกิต)\nอุตสาหกรรม อุตสาหกรรม\nHIM339 Performing Arts: from HIM339 Performing Arts: from\nมคอ. 2 หลักสูตรศิลปศาสตรบัณฑิต สาขาวิชาการจัดการมรดกวัฒนธรรมและอตุ สาหกรรมสร้างสรรค์ หน้า 93 รายวิชาในหลักสูตร พ.ศ. 2561 รายวิชาในหลักสูตร พ.ศ. 2566\nCulture to Industry Culture to Industry\nจวอ.437 การจัดการศิลปะการแสดง (3 หน่วยกิต) จวอ.437 การจัดการศิลปะการแสดง (3 หน่วยกิต)\nHIM437 Performing Arts Management HIM437 Performing Arts Management\nจวอ.438 การจัดการศิลปิน (3 หน่วยกิต) จวอ.438 การจัดการศิลปิน (3 หน่วยกิต)\nHIM438 Artist Management HIM438 Artist Management\nจวอ.439 การจัดการผู้ชม (3 หน่วยกิต) จวอ.439 การจัดการผู้ชม (3 หน่วยกิต)\nHIM439 Audience Management HIM439 Audience Management\nหมวดวิชาเลือกเสรีหมวดวิชาเลือกเสรี\nจวอ.399 แฟชั่น: การออกแบบ (3 หน่วยกิต) จวอ.399 นวัตกรรมการจดัการแฟชั่นในยุค (3 หน่วยกิต)\nอุตสาหกรรม และวัฒนธรรม ดิจิทัล\nHIM399 Fashion: Design, Industry and HIM399 Innovation of Fashion\nCulture Management in Digital Era\nจวอ.496 การออกแบบและสร้างสรรค์สื่อ (3 หน่วยกิต) จวอ.496 การออกแบบและสร้างสรรค์สื่อ (3 หน่วยกิต)\nใหม่ ใหม่\nHIM496 Design and Creativity for HIM496 Design and Creativity for\nNew Media New Media\nจวอ.497 การออกแบบนิทรรศการ (3 หน่วยกิต) จวอ.497 การออกแบบนิทรรศการ (3 หน่วยกิต)\nHIM497 Exhibition Design HIM497 Exhibition Design\nจวอ.498 ธุรกิจดนตรี (3 หน่วยกิต) จวอ.498 ธุรกิจดนตรี (3 หน่วยกิต)\nHIM498 Music Business HIM498 Music Business\nรายวิชาที่เทียบไม่ได้รายวิชาที่เทียบไม่ได้\nจวอ.310 หลักการจดัการและการจัดการ (3 หน่วยกิต) จวอ.396 การเขียนเชิงสร้างสรรค์เพื่องาน (3 หน่วยกิต)\nHIM310 องค์การเพื่องานวัฒนธรรม วัฒนธรรม\nPrinciple of Management HIM396 Creative Writings for Culture\nand Organization\nManagement for Culture\nมคอ. 2 หลักสูตรศิลปศาสตรบัณฑิต สาขาวิชาการจัดการมรดกวัฒนธรรมและอตุ สาหกรรมสร้างสรรค์ หน้า 94 รายวิชาในหลักสูตร พ.ศ. 2561 รายวิชาในหลักสูตร พ.ศ. 2566\nจวอ.401 การศึกษาเฉพาะเรื่อง 2 (3 หน่วยกิต) จวอ.397 การสร้างแบรนดสิ์นคำเพื่อการ (3 หน่วยกิต)\nHIM401 Special Project 2 จัดการมรดกวัฒนธรรมและ\nอุตสาหกรรมสร้างสรรค์\nHIM397 Brand Product for\nManagement of Cultural\nHeritage and Creative\nIndustries\nจวอ.398 ผู้ประกอบการทางวัฒนธรรมและ (3 หน่วยกิต)\nอุตสาหกรรมสร้างสรรค์\nHIM398 Entrepreneurship in Culture\nand Creative Industries\nจวอ.499 หัวข้อเฉพาะในการจัดการมรดก (3 หน่วยกิต)\nวัฒนธรรมและอุตสาหกรรม\nสร้างสรรค์\nHIM499 Selected Topics in\nManagement of Cultural\nHeritage and Creative\nIndustries\nมคอ. 2 หลักสูตรศิลปศาสตรบัณฑิต สาขาวิชาการจัดการมรดกวัฒนธรรมและอตุ สาหกรรมสร้างสรรค์ หน้า 95 ความสอดคล้องของผลลัพธ์การเรียนรู้ และการออกแบบหลักสูตร\nภาคผนวก 4\nหมวดวิชาศึกษาทั่วไป 30 หน่วยกิต\nผลลัพธ์การเรียนรู้ของหลักสูตร (PLOs)\nรายวิชา ความรู้ทักษะ จริยธรรม ลักษณะส่วนบุคคล\n1 2 3 4 5 6 1 2 3 4 5 6 1 2 1 2 3 4\nมธ.101 โลก อาเซียน และไทย / / / / / / / / / /\nTU101 Thailand, ASEAN, and the World\nมธ.109 นวัตกรรมกับกระบวนคิดผู้ประกอบการ / / / / / / / / / / / / / / /\nTU109 Innovation and Entrepreneurial mindset\nมธ.102 ชีวิตกับสุนทรียภาพ / / / / / / / / / / / /\nTU102 Life & Aesthetics\nศศ.101 การคิด อ่าน และเขียนอย่างมีวิจารณญาณ / / / / / / / / / / / /\nLAS101 Critical Thinking, Reading, and Writing\nสษ.105 ทักษะการสื่อสารทางภาษาอังกฤษ / / / / / / / / / / / /\nEL105 English Communication Skills\nมธ.106 ความคิดสร้างสรรค์และการสื่อสาร / / / / / / / / / / / /\nTU106 Creativity and Communication\nมธ.103 ชีวิตกับความยั่งยืน / / / / / / / / / / / /\nTU103 Life and Sustainability\nมธ.107 ทักษะดิจิทัลกับการแก้ปัญหา / / / / / / / / / / / / / / /\nTU107 Digital Skill and Problem Solving\nมธ.201 ความรู้ทางการเงินสำหรับบุคคล / / / / / / / / / / / / /\nTU201 Financial Literacy for Individuals\nมธ.100 พลมืองกับการลงมือแก้ปัญหา / / / / / / / / / / / / / / /\nTU100 Civic Engagement\nมคอ. 2 หลักสูตรศิลปศาสตรบัณฑิต สาขาวิชาการจัดการมรดกวัฒนธรรมและอตุ สาหกรรมสร้างสรรค์ หน้า 96 หมวดวิชาเฉพาะ: วิชาบังคับ 66 หน่วยกิต\nผลลัพธ์การเรียนรู้ของหลักสูตร (PLOs)\nรายวิชา ความรู้ทักษะ จริยธรรม ลักษณะส่วนบุคคล\n1 2 3 4 5 6 1 2 3 4 5 6 1 2 1 2 3 4\nจวอ.200 แนวคิดและทฤษฎีด้านมรดกวัฒนธรรมและ / / / / / / / / / /\nอุตสาหกรรมสร้างสรรค์\nHIM200 Concepts and Theories of Cultural\nHeritage and Creative Industries\nจวอ.201 การบัญชีและการเงินเพื่อการจัดการมรดก / / / / / / / / / / / / / /\nวัฒนธรรมและอุตสาหกรรมสร้างสรรค์\nHIM201 Accounting and Finance for Management\nof Cultural Heritage and Creative Industries\nจวอ.202 ศิลปะเพื่อการสร้างสรรค์นวัตกรรม / / / / / / / / / / /\nจวอ.202 Art for Creative Innovation\nจวอ.203 อารยธรรม การเปลี่ยนแปลงและนวัตกรรม / / / / / / / / / / /\nHIM203 Civilization, Transformation, and\nInnovation\nจวอ.204 มานุษยวิทยาประยุกต์เพื่อการจัดการมรดก / / / / / / / / / / / / /\nวัฒนธรรมและอุตสาหกรรมสร้างสรรค์\nHIM204 Applied Anthropology for Management\nof Cultural Heritage and Creative Industries\nจวอ.205 หลักเศรษฐศาสตร์เพื่อการจัดการมรดก / / / / / / / / / / / / / /\nวัฒนธรรมและอุตสาหกรรมสร้างสรรค์\nHIM205 Principles of Economics for Management\nof Cultural Heritage and Creative Industries\nจวอ.210 หลักการตลาดเพื่อการจัดการมรดกวัฒนธรรม / / / / / / / / / / / / / / / / /\nและอุตสาหกรรมสร้างสรรค์\nมคอ. 2 หลักสูตรศิลปศาสตรบัณฑิต สาขาวิชาการจัดการมรดกวัฒนธรรมและอตุ สาหกรรมสร้างสรรค์ หน้า 97 ผลลัพธ์การเรียนรู้ของหลักสูตร (PLOs)\nรายวิชา ความรู้ทักษะ จริยธรรม ลักษณะส่วนบุคคล\n1 2 3 4 5 6 1 2 3 4 5 6 1 2 1 2 3 4\nHIM210 Marketing Principles for Management of\nCultural Heritage and Creative Industries\nจวอ.212 การจัดการทรัพยากรทางวัฒนธรรม / / / / / / / / / / / /\nHIM212 Cultural Resource Management\nจวอ.214 สื่อและวัฒนธรรมเชิงวิพากษ์ / / / / / / / / / / /\nHIM214 Critical Media and Cultural Studies\nจวอ.215 ทัศนวัฒนธรรมร่วมสมัย / / / / / / / / / / /\nHIM215 Contemporary Visual Culture\nจวอ.230 กระบวนการสร้างสรรค์และการผลิตใน / / / / / / / / / / / / /\nอุตสาหกรรมสื่อ\nHIM230 Creative Process and Production in\nMedia Industries\nจวอ.300 นโยบายทางวัฒนธรรม / / / / / / / / / / / / / / / / / /\nHIM300 Cultural Policy\nจวอ.301 การจัดการความรู้และความคิดสร้างสรรค์ / / / / / / / / / / /\nHIM301 Knowledge and Creativity Management\nจวอ.302 ระเบียบวิธีวิจัยเพื่อการจัดการทางมรดก / / / / / / / / / / /\nวัฒนธรรมและอุตสาหกรรมสร้างสรรค์\nHIM302 Research Methodology for Management\nof Cultural Heritage and Creative Industries\nจวอ.303 การจัดการโครงการทางมรดกวัฒนธรรมและ / / / / / / / / / / / / / / / / /\nอุตสาหกรรมสร้างสรรค์\nHIM303 Project Management for Cultural\nHeritage and Creative Industries\nมคอ. 2 หลักสูตรศิลปศาสตรบัณฑิต สาขาวิชาการจัดการมรดกวัฒนธรรมและอตุ สาหกรรมสร้างสรรค์ หน้า 98 ผลลัพธ์การเรียนรู้ของหลักสูตร (PLOs)\nรายวิชา ความรู้ทักษะ จริยธรรม ลักษณะส่วนบุคคล\n1 2 3 4 5 6 1 2 3 4 5 6 1 2 1 2 3 4\nจวอ.304 กลยุทธ์การจัดการเพื่อมรดกวัฒนธรรมและ / / / / / / / / / / / / / / / / /\nอุตสาหกรรมสร้างสรรค์\nHIM304 Strategic Management for Cultural\nHeritage and Creative Industries\n/ / / / / / / / / / /\nจวอ.313 การสื่อสารข้ามวัฒนธรรม\nHIM313 Cross-cultural Communication\nจวอ.320 การจัดการมรดกภูมิปัญญาทางวัฒนธรรม / / / / / / / / / / / / / /\nHIM320 Intangible Cultural Heritage Management\nจวอ.340 ภาษาอังกฤษเพื่อการจัดการทางมรดก / / / / / / / / / / / / / /\nวัฒนธรรมและอุตสาหกรรมสร้างสรรค์\nHIM340 English for Management of Cultural\nHeritage and Creative Industries\n/ / / / / / / / / / / / / / / / / /\nจวอ.400 การศึกษาเฉพาะเรื่อง\nHIM400 Special Project\n/ / / / / / / / / / /\nจวอ.410 กฎหมายและจริยธรรมในการจัดการมรดก\nวัฒนธรรมและอุตสาหกรรมสร้างสรรค์\nHIM410 Laws and Ethics in Management of\nCultural Heritage and Creative Industries\n/ / / / / / / / / /\nจวอ.411 การฝึกปฏิบัติงานด้านการจัดการมรดก\nวัฒนธรรมและอุตสาหกรรมสร้างสรรค์\nHIM411 Internship for Cultural Heritage\nManagement and Creative Industries\nมคอ. 2 หลักสูตรศิลปศาสตรบัณฑิต สาขาวิชาการจัดการมรดกวัฒนธรรมและอตุ สาหกรรมสร้างสรรค์ หน้า 99 หมวดวิชาเฉพาะ: วิชาบังคับเลือก 9 หน่วยกิต\nผลลัพธ์การเรียนรู้ของหลักสูตร (PLOs)\nรายวิชา ความรู้ทักษะ จริยธรรม ลักษณะส่วนบุคคล\n1 2 3 4 5 6 1 2 3 4 5 6 1 2 1 2 3 4\nจวอ.250 ทักษะการสื่อสารภาษาและวัฒนธรรมเขมร / / / / / / / / / / / / /\nเบื้องต้น\nHIM250 Basic Communicative Skills on Khmer\nLanguage and Culture\nจวอ.350 ทักษะการสื่อสารภาษาและวัฒนธรรมเขมร / / / / / / / / / / / / /\nระดับกลาง\nHIM350 Intermediate Communicative Skills on\nKhmer Language and Culture\nจวอ.370 ทักษะการสื่อสารภาษาและวัฒนธรรมเขมร / / / / / / / / / / / / / / /\nระดับสูง\nHIM370 Advanced Communicative Skills on\nKhmer Language and Culture\nจวอ.251 ทักษะการสื่อสารภาษาและวัฒนธรรมพม่า / / / / / / / / / / / / /\nเบื้องต้น\nHIM251 Basic Communicative Skills on Burmese\nLanguage and Culture\nจวอ.351 ทักษะการสื่อสารภาษาและวัฒนธรรมพม่า / / / / / / / / / / / / /\nระดับกลาง\nHIM351 Intermediate Communicative Skills on\nBurmese Language and Culture\nจวอ.371 ทักษะการสื่อสารภาษาและวัฒนธรรมพม่า / / / / / / / / / / / / / / / / /\nระดับสูง\nHIM371 Advanced Communicative Skills on\nมคอ. 2 หลักสูตรศิลปศาสตรบัณฑิต สาขาวิชาการจัดการมรดกวัฒนธรรมและอตุ สาหกรรมสร้างสรรค์ หน้า 100 ผลลัพธ์การเรียนรู้ของหลักสูตร (PLOs)\nรายวิชา ความรู้ทักษะ จริยธรรม ลักษณะส่วนบุคคล\n1 2 3 4 5 6 1 2 3 4 5 6 1 2 1 2 3 4\nBurmese Language and Culture\nจวอ.252 ทักษะการสื่อสารภาษาและวัฒนธรรมมลายู / / / / / / / / / / / / /\nเบื้องต้น\nHIM252 Basic Communicative Skills on Malay\nLanguage and Culture\nจวอ.352 ทักษะการสื่อสารภาษาและวัฒนธรรมมลายู / / / / / / / / / / / / / / /\nระดับกลาง\nHIM352 Intermediate Communicative Skills on\nMalay Language and Culture\nจวอ.372 ทักษะการสื่อสารภาษาและวัฒนธรรมมลายู / / / / / / / / / / / / / / / / /\nระดับสูง\nHIM372 Advanced Communicative Skills on\nMalay Language and Culture\nจวอ.253 ทักษะการสื่อสารภาษาและวัฒนธรรมเวียดนาม / / / / / / / / / / / / /\nเบื้องต้น\nHIM253 Basic Communicative Skills on\nVietnamese Language and Culture\nจวอ.353 ทักษะการสื่อสารภาษาและวัฒนธรรมเวียดนาม / / / / / / / / / / / / /\nระดับกลาง\nHIM353 Intermediate Communicative Skills on\nVietnamese Language and Culture\nจวอ.373 ทักษะการสื่อสารภาษาและวัฒนธรรมเวียดนาม / / / / / / / / / / / / / / / / /\nระดับสูง\nHIM373 Advanced Communicative Skills on\nมคอ. 2 หลักสูตรศิลปศาสตรบัณฑิต สาขาวิชาการจัดการมรดกวัฒนธรรมและอตุ สาหกรรมสร้างสรรค์ หน้า 101 ผลลัพธ์การเรียนรู้ของหลักสูตร (PLOs)\nรายวิชา ความรู้ทักษะ จริยธรรม ลักษณะส่วนบุคคล\n1 2 3 4 5 6 1 2 3 4 5 6 1 2 1 2 3 4\nVietnamese Language and Culture\nจวอ.254 ทักษะการสื่อสารภาษาและวัฒนธรรมลาว / / / / / / / / / / / / /\nเบื้องต้น\nHIM254 Basic Communicative Skills on Lao\nLanguage and Culture\nจวอ.354 ทักษะการสื่อสารภาษาและวัฒนธรรมลาว / / / / / / / / / / / / /\nระดับกลาง\nHIM354 Intermediate Communicative Skills on\nLao Language and Culture\nจวอ.374 ทักษะการสื่อสารภาษาและวัฒนธรรมลาว / / / / / / / / / / / / / / / / /\nระดับสูง\nHIM374 Advanced Communicative Skills on Lao\nLanguage and Culture\nจวอ.255 ทักษะการสื่อสารภาษาและวัฒนธรรม / / / / / / / / / / / / /\nอินโดนีเซียเบื้องต้น\nHIM255 Basic Communicative Skills on\nIndonesian Language and Culture\nจวอ.355 ทักษะการสื่อสารภาษาและวัฒนธรรม / / / / / / / / / / / / /\nอินโดนีเซียระดับกลาง\nHIM355 Intermediate Communicative Skills on\nIndonesian Language and Culture\nจวอ.375 ทักษะการสื่อสารภาษาและวัฒนธรรม / / / / / / / / / / / / / / / / /\nอินโดนีเซียระดับสูง\nHIM375 Advanced Communicative Skills on\nมคอ. 2 หลักสูตรศิลปศาสตรบัณฑิต สาขาวิชาการจัดการมรดกวัฒนธรรมและอตุ สาหกรรมสร้างสรรค์ หน้า 102 ผลลัพธ์การเรียนรู้ของหลักสูตร (PLOs)\nรายวิชา ความรู้ทักษะ จริยธรรม ลักษณะส่วนบุคคล\n1 2 3 4 5 6 1 2 3 4 5 6 1 2 1 2 3 4\nIndonesian Language and Culture\nจวอ.260 ทักษะการสื่อสารภาษาและวัฒนธรรมจีน / / / / / / / / / / / / /\nเบื้องต้น\nHIM260 Basic Communicative Skills on Chinese\nLanguage and Culture\nจวอ.360 ทักษะการสื่อสารภาษาและวัฒนธรรมจีน / / / / / / / / / / / / /\nระดับกลาง\nHIM360 Intermediate Communicative Skills on\nChinese Language and Culture\nจวอ.380 ทักษะการสื่อสารภาษาและวัฒนธรรมจีน / / / / / / / / / / / / / / / / /\nระดับสูง\nHIM380 Advanced Communicative Skills on\nChinese Language and Culture\nจวอ.261 ทักษะการสื่อสารภาษาและวัฒนธรรมเกาหลี / / / / / / / / / / / / /\nเบื้องต้น\nHIM261 Basic Communicative Skills on Korean\nLanguage and Culture\nจวอ.361 ทักษะการสื่อสารภาษาและวัฒนธรรมเกาหลี / / / / / / / / / / / / /\nระดับกลาง\nHIM361 Intermediate Communicative Skills on\nKorean Language and Culture\nจวอ.381 ทักษะการสื่อสารภาษาและวัฒนธรรมเกาหลี / / / / / / / / / / / / / / / / /\nระดับสูง\nHIM381 Advanced Communicative Skills on\nมคอ. 2 หลักสูตรศิลปศาสตรบัณฑิต สาขาวิชาการจัดการมรดกวัฒนธรรมและอตุ สาหกรรมสร้างสรรค์ หน้า 103 ผลลัพธ์การเรียนรู้ของหลักสูตร (PLOs)\nรายวิชา ความรู้ทักษะ จริยธรรม ลักษณะส่วนบุคคล\n1 2 3 4 5 6 1 2 3 4 5 6 1 2 1 2 3 4\nKorean Language and Culture\nหมวดวิชาเฉพาะ: วิชาเลือก 15 หน่วยกิต\nผลลัพธ์การเรียนรู้ของหลักสูตร (PLOs)\nรายวิชา ความรู้ทักษะ จริยธรรม ลักษณะส่วนบุคคล\n1 2 3 4 5 6 1 2 3 4 5 6 1 2 1 2 3 4\nจวอ.227 การจัดการมรดกทางโบราณคดี / / / / / / / / / / / /\nHIM227 Archaeological Heritage Management\nจวอ.326 การพัฒนาและการจัดการมรดกทางวัฒนธรรม / / / / / / / / / / / / / / /\nเชิงบูรณาการ\nHIM326 Integrated Cultural Heritage Management\nand Development\nจวอ.328 การจัดการข้อมูลดิจิทัลทางวัฒนธรรม / / / / / / / / / / / / / / / /\nHIM328 Management of Digitalized Data for\nCulture\nจวอ.329 การจัดการภูมิทัศน์วัฒนธรรม / / / / / / / / / / / / / / / /\nHIM329 Cultural Landscape Management\nจวอ.426 การจัดการการท่องเที่ยววัฒนธรรม / / / / / / / / / / / / / / / /\nHIM426 Cultural Tourism Management\nจวอ.427 การจัดการพิพิธภัณฑ์และแหล่งเรียนรู้ทาง / / / / / / / / / / / / / / / / / /\nวัฒนธรรม\nHIM427 Museum and Cultural Learning Center\nManagement\nมคอ. 2 หลักสูตรศิลปศาสตรบัณฑิต สาขาวิชาการจัดการมรดกวัฒนธรรมและอตุ สาหกรรมสร้างสรรค์ หน้า 104 ผลลัพธ์การเรียนรู้ของหลักสูตร (PLOs)\nรายวิชา ความรู้ทักษะ จริยธรรม ลักษณะส่วนบุคคล\n1 2 3 4 5 6 1 2 3 4 5 6 1 2 1 2 3 4\nจวอ.428 การจัดการมรดกเมือง / / / / / / / / / / / / / / /\nHIM428 Urban Heritage Management\nจวอ.336 อุตสาหกรรมสร้างสรรค์ในบริบทสากล / / / / / / / / / / / / / /\nHIM336 Global Creative Industries\nจวอ.337 อุตสาหกรรมภาพยนตร์ โลกาภิวัตน์ และอัต / / / / / / / / / / / / / / / /\nลักษณ์\nHIM337 Film Industry, Globalization and\nIdentities\nจวอ.338 อุตสาหกรรมโทรทัศน์และสื่อใหม่ในยุคดิจิทัล / / / / / / / / / / /\nHIM338 Television Industry and New Media in\nthe Digital Era\nจวอ.339 ศิลปะการแสดง: จากวัฒนธรรมสู่อุตสาหกรรม / / / / / / / / / / /\nHIM339 Performing Arts: from Culture to Industry\nจวอ.437 การจัดการศลิปะการแสดง / / / / / / / / / / / / / / /\nPerforming Arts Management\nจวอ.438 การจัดการศิลปิน / / / / / / / / / / / / / / /\nHIM438 Artist Management\nจวอ.439 การจัดการผู้ชม / / / / / / / / / / / / / /\nHIM439 Audience Management\nมคอ. 2 หลักสูตรศิลปศาสตรบัณฑิต สาขาวิชาการจัดการมรดกวัฒนธรรมและอตุ สาหกรรมสร้างสรรค์ หน้า 105 หมวดวิชาเฉพาะ : วิชาเลือกเสรี 9 หน่วยกิต\nผลลัพธ์การเรียนรู้ของหลักสูตร (PLOs)\nรายวิชา ความรู้ทักษะ จริยธรรม ลักษณะส่วนบุคคล\n1 2 3 4 5 6 1 2 3 4 5 6 1 2 1 2 3 4\nจวอ.396 การเขียนเชิงสร้างสรรค์เพื่องานวัฒนธรรม / / / / / / / / / /\nHIM396 Creative Writings for Culture\nจวอ.397 การสร้างแบรนด์สินค้าทางวัฒนธรรมเพื่อการ / / / / / / / / / / / / / / / / /\nจัดการมรดกวัฒนธรรมและอุตสาหกรรมสร้างสรรค์\nHIM397 Brand Product for Management of\nCultural Heritage and Creative Industries\nจวอ.398 ผู้ประกอบการทางวัฒนธรรมและอุตสาหกรรม / / / / / / / / / / / / / / / / / /\nสร้างสรรค์\nHIM398 Entrepreneurship in Culture and Creative\nIndustries\nจวอ.399 นวัตกรรมการจัดการแฟชั่นในยุคดิจิทัล / / / / / / / / / / / / / /\nHIM399 Innovation of Fashion Management in\nDigital Era\nจวอ.496 การออกแบบและสร้างสรรค์สื่อใหม่ / / / / / / / / / / / / / / / / / /\nHIM496 Design and Creativity for New Media\nจวอ.497 การออกแบบนิทรรศการ / / / / / / / / / / / / / / / / / /\nHIM497 Exhibition Design\nจวอ.498 ธุรกิจดนตรี / / / / / / / / / / / / / /\nHIM498 Music Business\nจวอ.499 หัวข้อเฉพาะในการจัดการมรดกวัฒนธรรมและ / / / / / / / / / / / / / / /\nอุตสาหกรรมสร้างสรรค์\nHIM499 Selected Topics in Management of\nCultural Heritage and Creative Industries\nมคอ. 2 หลักสูตรศิลปศาสตรบัณฑิต สาขาวิชาการจัดการมรดกวัฒนธรรมและอตุ สาหกรรมสร้างสรรค์ หน้า 106 แนบสำเนาเอกสารต่อไปนี้\nภาคผนวก 5\n1. คำสั่งแต่งตั้งคณะกรรมการพัฒนาหลักสูตร หรือ ปรับปรุงหลักสูตร\n2. เอกสาร MOU กรณีที่มีการลงนามกับมหาวิทยาลัยคู่สัญญา\n3. สัญญาจ้างมีระยะเวลาไม่ต่ำกว่า 9 เดือน กรณีที่มีอาจารย์ต่างชาติหรืออาจารย์\nเกษียณอายุราชการ อาจารย์ผู้รับผิดชอบหลักสูตรหรืออาจารย์ประจำหลักสูตร\n4. ข้อบังคับมหาวิทยาลัยธรรมศาสตร์ ว่าด้วยการศึกษาระดับปริญญาตรีพ.ศ. 2561\n5. ข้อบังคับมหาวิทยาลัยธรรมศาสตร์ ว่าด้วยวินัยนักศึกษา พ.ศ. 2564\n6. ประกาศมหาวิทยาลัยธรรมศาสตร์ เรื่อง การลงทะเบียนเรียนรายวิชาข้ามหลักสูตร\nพ.ศ. .\n7. ประกาศมหาวิทยาลัยธรรมศาสตร์ เรื่อง การลงทะเบียนเรียนรายวิชาข้าม\nสถาบันอุดมศึกษา พ.ศ. .\nหมายเหตุ เอกสารหัวข้อนี้ให้ใส่ในเล่มเอกสารหลักสูตรฉบับที่จะเสนอสภามหาวิทยาลัยและ สป.อว. ส่วน\nฉบับร่างที่เสนอคณะกรรมการนโยบายวิชาการ ยังไม่ต้องใส่\nมคอ. 2 หลักสูตรศิลปศาสตรบัณฑิต สาขาวิชาการจัดการมรดกวัฒนธรรมและอตุ สาหกรรมสร้างสรรค์ หน้า 107"
}