{
    "หมวดที่ 1": "รายละเอียดของหลักสูตร\nชื่อสถาบันอดุ มศกึษา มหาวิทยาลัยธรรมศาสตร์\nคณะ/วิทยาลัย/สถาบัน ศูนย์รังสติ / คณะรัฐศาสตร์\nหมวดที่ 1. ข้อมูลทั่วไป\n1.1 รหัสและชื่อหลักสูตร\nรหัสหลักสูตร : 25400051100189\nชื่อหลักสูตร\nภาษาไทย : หลักสูตรรัฐศาสตรบัณฑิต\nภาษาอังกฤษ : Bachelor of Political Science Program\n1.2 ชื่อปริญญาและสาขาวิชา\nภาษาไทย ชื่อเต็ม รัฐศาสตรบัณฑติ\nชื่อย่อ ร.บ.\nภาษาอังกฤษ ชื่อเต็ม Bachelor of Political Science\nชื่อย่อ B.Pol.Sc.\n1.3 วิชาเอก (ถ้ามี)\nภาษาไทย (1) สาขาการเมอืงการปกครอง Politics and Government\n(2) สาขาการระหว่างประเทศ International Relations\n(3) สาขาบริหารรัฐกิจ Public Administration\n1.4 รูปแบบของหลักสูตร\n1.4.1 รูปแบบ\n\n<exclude> หลกัสูตรระดับปริญญาตรี (ต่อเน่อืง)</exclude>\n\n<include> หลักสูตรระดับปริญญาตรี 4 ปี</include>\n\n<exclude> หลักสูตรระดับปริญญาตรี 5 ปี</exclude>\n\n<exclude> หลักสูตรระดับปริญญาตรี 6 ปี</exclude>\n1.4.2 ประเภทของหลักสูตร\n\n<include> หลักสูตรปริญญาตรีทางวิชาการ</include>\n\n<exclude> หลักสูตรปริญญาตรีแบบก้าวหน้าทางวิชาการ</exclude>\n\n<exclude> หลักสูตรปริญญาตรีทางวิชาชีพหรอืปฏิบัติการ</exclude>\n\n<exclude> หลักสูตรปริญญาตรีแบบก้าวหน้าทางวิชาชีพหรือปฏิบัติการ</exclude>\n1 1.4.3 ภาษาท่ใีช้\n\n<include> จัดการศึกษาภาษาไทย</include>\n\n<exclude> จัดการศึกษาภาษาอังกฤษ</exclude>\n\n<exclude> จัดการศึกษาทั้งภาษาไทยและภาษาอังกฤษ</exclude>\n\n<exclude> จัดการศกึษาภาษาต่างประเทศ ระบุ</exclude>\n1.4.4 ความร่วมมือกับสถาบันอื่น\n\n<include> หลักสูตรของสถาบันโดยเฉพาะ</include>\n\n<exclude> หลักสูตรที่ได้รับความร่วมมือสนับสนุนจากสถาบันอื่น หรอื หลักสูตรร่วมกับสถาบัน</exclude>\nอื่น ระบุ\n1.4.5 การให้ปรญิญาแก่ผู้สำเร็จการศึกษา\n\n<include> ให้ปริญญาเพียงสาขาวิชาเดียว</include>\n\n<exclude> ให้ปริญญามากกว่า 1 สาขาวิชา (เชน่ทวิปริญญา) หรือปริญญาร่วมระหว่างสถาบันอุดม</exclude>\nศกึษา)\n1.4.6 สถานภาพของหลักสูตรและการพิจารณาอนุมัติ/เห็นชอบหลักสูตร\nหลักสูตรปรับปรุง พ.ศ. 2566 ปรับปรุงจากหลักสูตรรัฐศาสตรบัณฑติพ.ศ. 2561\nกำหนดเปิดสอนในภาคการศกึษาที่ 1 ปีการศึกษา 2566\nได้พิจารณากลั่นกรองโดยคณะกรรมการนโยบายวิชาการ\nในการประชุมครั้งที่ 1/2566 เมื่อวันที่ 1 มีนาคม พ.ศ. 2566\nได้รับอนุมัติ/เห็นชอบหลักสูตรจากสภามหาวิทยาลัย\nในการประชุมครั้งที่ 5/2566 เมื่อวันที่ 25 เมษายน พ.ศ. 2566\n1.5 อาชีพท่สีามารถประกอบได้หลังสำเร็จการศึกษา\n1.5.1 นักการเมือง หนว่ยงานราชการ ปลัดอำเภอ นักพัฒนาชุมชน นักปกครอง\nนักวิชาการศกึษา\n1.5.2 นักการทูต องค์กรระหว่างประเทศ และหน่วยงานระหว่างประเทศต่าง ๆ\n1.5.3 นักบริหารงานทั่วไป เจ้าหน้าที่บุคคล นักธุรกิจ ผู้จัดการทั่วไป ผู้ส่อืข่าว\n1.6 สถานท่จีัดการเรียนการสอน\n\n<include> ศูนย์รังสิต</include>\n\n<exclude> ท่าพระจันทร์</exclude>\n\n<exclude> ศูนย์พัทยา</exclude>\n\n<exclude> ศูนย์ลำปาง</exclude>\n2 1.7 ค่าใช้จ่ายตลอดหลักสูตร\nประเภทโครงการ\n\n<include> โครงการปกติ</include>\n\n<exclude> โครงการพิเศษ</exclude>\n\n<exclude> โครงการปกติและโครงการพิเศษ</exclude>\nค่าใช้จ่ายตลอดหลักสูตร\n\n<include> นักศึกษาไทย 104,000 บาท</include>\n\n<exclude> นักศึกษาต่างชาติบาท</exclude>\n3",
    "หมวดที่ 2": "หมวดที่ 2 คุณสมบัติผู้เข้าศึกษา\n2.1 การรับเข้าศึกษา\n\n<include> รับเฉพาะนักศึกษาไทย</include>\n\n<exclude> รับทั้งนักศึกษาไทยและนักศึกษาต่างชาติที่สามารถใช้ภาษาไทยได้ดี</exclude>\n\n<exclude> รับทั้งนักศึกษาไทยและนักศึกษาต่างชาติ</exclude>\n2.2 คุณสมบัติของผู้เข้าศึกษา\nคุณสมบัติของผู้เข้าศึกษาต้องไปตามข้อบังคับมหาวิทยาลัยธรรมศาสตร์ ว่าด้วยการศึกษา\nชั้นปริญญาตรีพ.ศ. 2561 ข้อ 14 และมีคุณสมบัติดังนี้\n1) สำเร็จการศกึษาไม่ต่ำกว่าชั้นมัธยมศกึษาตอนปลายหรอื เทียบเท่า\n2) ไม่นักศกึษาของมหาวิทยาลัยหรอืสถาบันอุดมศกึษาอื่น เว้นแต่การศกึษาในมหาวิทยาลัย\nเปิด หรอืการศกึษาหลักสูตรทางไกล (Online) ที่ได้รับปริญญา\n3) ไม่ผู้ป่วยหรืออยู่ในสภาวะที่จะอุปสรรคร้ายแรงตอ่การศกึษา\n4) ไม่ผู้ประพฤติผิดศลีธรรมอันดหีรอืมีพฤติกรรมเสื่อมเสียอย่างร้ายแรง\nการคัดเลือกผู้เข้าศึกษา\nการคัดเลือกผู้เข้าศึกษาให้ไปตามระเบียบคัดเลือกเพื่อเข้าศึกษาในสถาบันการศึกษาขั้น\nอุดมศึกษาของส่วนราชการหรือหน่วยงานอื่นดำเนินการตามการมอบหมายของมหาวิทยาลัยหรือตาม\nข้อตกลง หรอืการคัดเลือกตามวิธีการที่มหาวิทยาลัยกำหนดโดยความเห็นชอบของสภามหาวิทยาลัย และ\nออกประกาศมหาวิทยาลัย\n2.3 แผนการรับนกัศกึษาและผู้สำเร็จการศึกษาในระยะ 5 ปี\nในแต่ละปีการศึกษาจะรับนักศกึษาปีละ 270 คน\nจำนวนนักศกึษา จำนวนนักศกึษาแตล่ะปีการศกึษา\n(ระบุทุกชั้นปีตามหลักสูตร) 2566 2567 2568 2569 2570\nชั้นปีที่ 1 270 270 270 270 270\nชั้นปีที่ 2 - 270 270 270 270\nชั้นปีที่ 3 - - 270 270 270\nชั้นปีที่ 4 - - - 270 270\nรวม 270 540 810 1,080 1,080\nคาดว่าจะจบการศกึษา - - - 270 270\n4",
    "หมวดที่ 3": "หมวดที่ 3 ปรัชญา วัตถุประสงค์ และผลลัพธ์การเรยีนรู้ของหลักสูตร\n3.1 ความสอดคล้องของหลักสูตรกับทิศทางนโยบายและยุทธศาสตร์การพัฒนากำลังคน และ\nยุทธศาสตร์มหาวิทยาลัย\nหลักสูตรรัฐศาสตร์บัณฑิต มหาวิทยาลัยธรรมศาสตร์ ปีพ.ศ. 2566 มีความสอดคล้องกับแผน\nยุทธศาสตร์มหาวิทยาลัยธรรมศาสตร์ ฉบับที่ 13 (พ.ศ. 2565-2570) โดยเฉพาะยุทธศาสตร์ที่ 1 พัฒนา\nกำลังคนแห่งอนาคต (Future Workforce) ซึ่งแสดงเป้าประสงค์ทางด้านการพัฒนาการเรียนการสอนและ\nนักศึกษาไว้ว่า มหาวิทยาลัยธรรมศาสตร์จะสถาบันวิชาการที่สร้างพลังการทำงานในอนาคตให้กับ\nประเทศ โดยจะทำหน้าที่แพลตฟอร์มในการพัฒนาทักษะแห่งอนาคตให้กับบัณฑิต และคนทำงานใน\nอาชีพต่าง ๆ เพื่อทำให้ทุกคนสามารถปรับตัวจากอาชีพเดิมจำนวนมากที่กำลังจะหายไป และตอบโจทย์\nอาชีพใหม่ ๆ ที่ท้าทายในอนาคต โดยทำงานได้ทุกที่ทั่วโลก นอกจากนี้ยังต้องมีจิตสำนึกที่สอดคล้องกับ\nเป้าหมายการพัฒนาอย่างยั่งยืนตามแนวทางที่กำหนดไว้โดยสหประชาชาติอกีด้วย\nจากความมุ่งหมายหลักในประเด็นการปรับตัวให้ทันกับความท้าทายอนาคต พร้อมทั้งการมี\nจติสำนึกที่สอดรับกับประชาคมโลกที่ตั้งเป้าไว้ในแผนยุทธศาสตร์มหาวิทยาลัยธรรมศาสตร์ดังกล่าว พบว่า\nมีความสอดรับกับทิศทางการพัฒนาบัณฑติภายใต้หลักสูตรรัฐศาสตร์บัณฑติ เนื่องจากหลักสูตรที่เน้น\nผลติบัณฑติ ให้มีความรู้ความสามารถทางรัฐศาสตร์แบบรอบด้าน โดยไม่จำกัดอยู่เพียงสาขาวิชาเอกใดวิชา\nหนึ่ง (การเมืองการปกครอง การระหว่างประเทศ และบริหารรัฐกิจ) ซึ่งการเรียนการสอนที่เน้นให้เกิด\nการบูรณาการความเชี่ยวชาญระหว่างสาขาเอกดังกล่าวสามารถเชื่อมโยงอย่างดีกับแนวทางการเรียน\nการสอนที่หลักสูตรส่งเสริมให้มีการนำความรู้ไปประยุกต์ใช้ได้จริงในทางปฏิบัติ ไม่ว่าจะการทำงานใน\nภาครัฐ ภาคเอกชน หรือภาคประชาสังคม ทั้งนี้ เมื่อเผชิญการเปลี่ยนแปลงจากพลวัตรโลก บัณฑิตจะ\nสามารถปรับตัวได้ทันจากพื้นฐานที่บ่มเพาะจากความรู้รอบด้านทางรัฐศาสตร์ และการประยุกต์ทักษะให้\nเหมาะกับการปฏิบัติที่เปลี่ยนแปลงไปได้นอกจากนี้ ในประเด็นการมีจิตสำนึกสอดรับกับประชาคมโลก ที่\nแผนยุทธศาสตร์มหาวิทยาลัยธรรมศาสตร์มุ่งเน้นนั้น อาจกล่าวได้ว่า การเรียนการสอนที่เกี่ยวข้องกับการ\nพัฒนาอย่างยั่งยืน ความพลเมืองโลก ตลอดจนบรรทัดฐานสากล (Universal Norm) รากฐานสำคัญ\nของหลักสูตรรัฐศาสตร์บัณฑิตในองค์รวม จึงอาจกล่าวได้ว่าเนื้อหาการเรียนการสอนของหลักสูตร\nสามารถสนับสนุนยุทธศาสตรก์ารพัฒนากำลังคนแหง่อนาคตของมหาวิทยาลัยธรรมศาสตร์ได้อย่างดี\n3.2 ปรัชญา\nมุ่งเน้นผลิตบัณฑิตที่มคีวามรรู้อบด้าน และมีความสามารถทางรัฐศาสตรทั์้งทางด้านทฤษฎี และ\nการปฏิบัติเกี่ยวกับการเมืองการปกครอง การบริหารรัฐกิจ และการระหว่างประเทศที่การศกึษา ใน\nเชิงสหวิชา และสนับสนุนให้มีการศึกษาค้นคว้าวิจัยและฝึกปฏิบัติในหน่วยงานทั้งภาครัฐ ภาคเอกชน ภาค\nประชาสังคม และหน่วยงานระหว่างประเทศ เพื่อให้รู้จักวิธีแสวงหาความรู้วิเคราะห์สถานการณ์ ต่าง ๆ\nได้ตลอดจนสามารถประยุกต์ใช้ความรู้ที่ได้เรียนมาให้ประโยชน์ทั้งต่อตนเองและสังคมโดยส่วนรวม\nรวมทั้งผู้มคีุณธรรม จรยิธรรม และมีความรับผดิชอบต่อสังคมดว้ย\n5 3.3 วัตถุประสงค์ของหลักสูตร\nเพื่อให้บัณฑิตที่สำเร็จการศกึษาในหลักสูตรมคีุณลักษณะ ดังนี้\n1) มีความรู้ความสามารถทางรัฐศาสตร์ ทั้งทางด้านทฤษฎีและการปฏิบัติ\n2) รจูั้กวิธีแสวงหาความรู้วิเคราะหส์ ถานการณต์่าง ๆ ได้\n3) สามารถประยุกต์ใชค้วามรทูี่ได้เรียนมาให้ประโยชน์ทั้งต่อตนเอง และสังคมโดยส่วนรวม\n4) ผู้มีคุณธรรม จรยิธรรม และมีความรับผดิชอบต่อสังคม\n3.4 ผลลัพธ์การเรียนรู้ของหลักสูตร (PLOs)\nด้านความรู้ (Knowledge)\nK 1 ผเู้รียนมีความรพูื้น้ฐานด้านกรอบแนวคิด และทฤษฎีที่เกี่ยวข้องกับการศกึษาทางด้าน\nรัฐศาสตร์\nK 2 ผเู้รียนมีความรู้ความเข้าใจในบริบท และพัฒนาการทางประวัตศิาสตร์ที่เกี่ยวข้องกับ\nการเมอืงการปกครอง การบริหารรัฐกิจ และการระหว่างประเทศ\nK 3 ผเู้รียนมีความรแู้ละความเข้าใจในปรากฏการณ์ร่วมสมัยที่เกี่ยวข้องกับการเมืองการปกครอง\nการบริหารรัฐกิจ และการระหว่างประเทศ\nK 4 ผเู้รียนมีความรเู้กี่ยวกับสถานะ บทบาท และอำนาจหน้าที่ของหนว่ยงาน องค์กร\nหรอืตัวแสดงที่เกี่ยวข้องกับการเมืองการปกครอง การบริหารรัฐกิจ และการระหว่างประเทศ\nด้านทักษะ (Skills)\nS 1 ผเู้รียนมีทักษะด้านการวิจัย และการปรับประยุกต์ใชเ้ครื่องมือการวิจัยขั้นต้น\nS 2 ผเู้รียนมทีักษะในการคิด วิเคราะหป์ รากฏการณ์ทางสังคม และการเมอืงอย่างเหตุผล\nS 3 ผเู้รียนมีทักษะทางการส่อืสารเพื่อการทำงานรว่มกับผอูื่น\nS 4 ผเู้รียนมีทักษะทางภาษาทั้งภาษาไทย และภาษาต่างประเทศเพื่อการทำงาน หรอื เพื่อการ\nศกึษาต่อ\nS 5 ผเู้รียนมีทักษะด้านเทคโนโลยีสารสนเทศเพื่อปรับประยุกต์ใชก้ำรทำงาน\nด้านจรยิธรรม (Ethics)\nE 1 ผเู้รียนแสดงออกซึ่งความเคารพในสิทธิ และเสรีภาพต่อทั้งตนเองและผอูื่น\nE 2 ผเู้รียนแสดงออกซึ่งความตระหนักในสิทธิและหน้าที่ของความพลเมืองที่ดี\nE 3 ผเู้รียนมีความเข้าใจและปฏิบัติตามหลักคุณธรรม จรยิธรรม กฎหมาย และกติกาอ่นื ๆ\nที่เกี่ยวข้องกับการทำงานและการอยู่รว่มกันในสังคม\nด้านลักษณะบุคคล (Character)\nC 1 ผเู้รียนแสดงออกซึ่งการยอมรับและเคารพในความแตกต่างหลากหลายของผอูื่นทั้งในทาง\nความคิดเห็น และในทางการกระทำ\nC 2 ผเู้รียนแสดงออกซึ่งความมวีุฒิภาวะและความผู้นำทั้งในทางความคิด การทำงาน และ\nการอยู่รว่มกับผอูื่น\nC 3 ผเู้รียนแสดงออกซึ่งความสามารถในการคิดวเิคราะห์ และการส่อืสารอย่างสร้างสรรค์\n6 3.5 ผลลัพธ์การเรียนรู้ท่คีาดหวังเมื่อสิ้นปีการศึกษา (YLOs)\nความรู้ทักษะ ทัศนคติหรืออนื่ ๆ ที่นักศึกษาจะได้รับเมื่อ\nชั้นปี\nเรียนจบแต่ละชั้นปี\nปีที่ 1 ความรู้และทักษะ\n- ทักษะการรวบรวมและประมวลผลความรู้ที่เกี่ยวข้องกับรัฐศาสตร์เบื้องต้น\n- ทักษะทางภาษาทั้งภาษาไทย และภาษาต่างประเทศเพื่อการทำงานขั้นต้น\n- ทักษะทางการส่อืสารเพื่อการทำงานรว่มกับผอูื่น\nทัศนคติ\n- ความเคารพในสิทธิ และเสรีภาพต่อทั้งตนเองและผู้อ่นื\n- ความตระหนักในสิทธิและหน้าที่ของความพลเมืองที่ดี\n- ความเข้าใจและปฏิบัติตามหลักคุณธรรม จริยธรรม กฎหมาย และกติกาอื่น ๆ\nที่เกี่ยวข้องกับการทำงานและการอยู่รว่มกันในสังคม\nปีที่ 2 ความรู้และทักษะ\n- ทักษะการรวบรวมและประมวลผลความรทูี่เกี่ยวข้องกับรัฐศาสตร์ขั้นกลาง\n- ทักษะทางภาษาทั้งภาษาไทย และภาษาต่างประเทศเพื่อการทำงานขั้นต้น\n- ทักษะทางการสื่อสารเพื่อการทำงานรว่มกับผู้อื่น\nทัศนคติ\n- ความเคารพในสิทธิ และเสรีภาพต่อทั้งตนเองและผอูื่น\n- ความตระหนักในสิทธิและหน้าที่ของความพลเมืองที่ดี\n- ความเข้าใจและปฏิบัติตามหลักคุณธรรม จรยิธรรม กฎหมาย และกติกาอื่น ๆ ที่\nเกี่ยวข้องกับการทำงานและการอยู่รว่มกันในสังคม\nปีที่ 3 ความรู้และทักษะ\n- ทักษะการวิเคราะหแ์ ละประยุกต์ใชค้วามรทูี่เกี่ยวข้องกับรัฐศาสตร์เบื้องต้น\n- ทักษะการวิจัย และการปรับประยุกต์ใชเ้ครื่องมือการวิจัยขั้นต้น\n- ทักษะทางภาษาทั้งภาษาไทย และภาษาต่างประเทศเพื่อการทำงานขั้นกลาง\n- ทักษะทางการสื่อสารเพื่อการทำงานรว่มกับผู้อื่น\n- ทักษะด้านเทคโนโลยีสารสนเทศเพื่อปรับประยุกต์ใชก้ำรทำงาน\nทัศนคติ\n- ความเคารพในสิทธิ และเสรีภาพต่อทั้งตนเองและผอูื่น\n- ความตระหนักในสิทธิและหน้าที่ของความพลเมืองที่ดี\n- ความเข้าใจและปฏิบัติตามหลักคุณธรรม จริยธรรม กฎหมาย และกติกาอื่น ๆ ที่\nเกี่ยวข้องกับการทำงานและการอยู่รว่มกันในสังคม\n7 ความรู้ทักษะ ทัศนคติหรืออนื่ ๆ ที่นักศึกษาจะได้รับเมื่อ\nชั้นปี\nเรียนจบแต่ละชั้นปี\nปีที่ 4 ความรู้และทักษะ\n- ทักษะการวิเคราะหแ์ ละประยุกต์ใชค้วามรทูี่เกี่ยวข้องกับรัฐศาสตร์ขนั้กลาง\n- ทักษะการวิจัย และการปรับประยุกต์ใช้เครื่องมอืการวิจัยขั้นต้น\n- ทักษะทางภาษาทั้งภาษาไทย และภาษาต่างประเทศเพื่อการทำงานขั้นกลาง\n- ทักษะทางการสื่อสารเพื่อการทำงานรว่มกับผู้อื่น\n- ทักษะด้านเทคโนโลยีสารสนเทศเพื่อปรับประยุกต์ใชก้ำรทำงาน\nทัศนคติ\n- ความเคารพในสิทธิ และเสรีภาพต่อทั้งตนเองและผอูื่น\n- ความตระหนักในสิทธิและหน้าที่ของความพลเมืองที่ดี\n- ความเข้าใจและปฏิบัติตามหลักคุณธรรม จริยธรรม กฎหมาย และกติกาอื่น ๆ ที่\nเกี่ยวข้องกับการทำงานและการอยู่รว่มกันในสังคม\n8",
    "หมวดที่ 4": "หมวดที่ 4 โครงสร้างหลักสูตร รายวิชา และหน่วยกิต\n4.1 ระบบการจัดการศึกษาและระยะเวลาการศึกษา\n4.1.1 ระบบ\nหลักสูตรแบบเต็มเวลา ใช้ระบบการศึกษาแบบทวิภาค โดย 1 ปีการศึกษาแบ่งออก 2\nภาคการศกึษาปกติ 1 ภาคการศกึษาปกติมีระยะเวลาศกึษาไม่น้อยกว่า 15 สัปดาห์\n4.1.2 ระยะเวลาการศึกษาสูงสุด\n\n<exclude> ไม่กำหนด</exclude>\n\n<include> ไม่เกิน 16 ภาคการศกึษาปกติ</include>\n4.2 การดำเนินการหลักสูตร\n4.2.1 วัน-เวลาในการดำเนินการเรียนการสอน\n\n<include> วัน – เวลาราชการปกติ</include>\n\n<exclude> นอกวัน – เวลาราชการ</exclude>\n4.2.2 ระบบการศึกษา\n\n<include> แบบชั้นเรยีน (Onsite)</include>\n\n<exclude> แบบทางไกล (Online)</exclude>\n\n<exclude> แบบประสมประสาน (Hybrid)</exclude>\n\n<exclude> อื่นๆ (ระบุ)</exclude>\n4.3 โครงสร้างหลักสูตร รายวิชา และหน่วยกิต\n4.3.1 หลักสูตร\n4.3.1.1 จำนวนหน่วยกิตรวม\nจำนวนหนว่ยกิตรวมตลอดหลักสูตร 129 หนว่ยกิต\n4.3.1.2 โครงสร้างหลักสูตร\nนักศึกษาจะต้องจดทะเบียนศึกษารายวิชา รวมไม่น้อยกว่า 129 หน่วยกิต โดยศึกษา\nรายวิชาต่างๆ ครบตามโครงสร้างองค์ประกอบ และข้อกำหนดของหลักสูตรดังนี้\n1) วิชาศึกษาทั่วไป 30 หน่วยกิต\n2) วิชาเฉพาะ 78 หน่วยกิต\n2.1) วิชาแกน 21 หนว่ยกิต\n2.2) วิชาเฉพาะสาขา 42 หนว่ยกิต\n2.3) วิชาบังคับนอกคณะ 15 หนว่ยกิต\n3) วิชาโท หรอืวิชำเลือก 15 หน่วยกิต\n4) วิชาเลือกเสรี 6 หน่วยกิต\nรวม 129 หน่วยกิต\n9 4.3.2 รายวิชาในหลักสูตร\n4.3.2.1 รหัสวิชา\nรายวิชาในหลักสูตรประกอบด้วย อักษรย่อ 2 หรอื 3 ตัว และเลขรหัส 3 ตัว โดยมี\nความหมาย ดังนี้\nอักษรย่อ ร. / PO หมายถึง อักษรย่อของสาขาวิชารัฐศาสตร์\nตัวเลข มีความหมาย ดังนี้\nเลขหลักหน่วย\nเลข 0-2 หมายถึง วิชาบังคับ\nเลข 3-9 หมายถึง วิชาเลือก\nเลขหลักสิบ\nเลข 0-3 หมายถึง วิชาในหมวดสาขาการเมอืงการปกครอง\nเลข 4-6 หมายถึง วิชาในหมวดสาขาบริหารรัฐกิจ\nเลข 7-9 หมายถึง วิชาในหมวดสาขาการระหว่างประเทศ\nเลขหลักร้อย\nเลข 1 หมายถึง รายวิชาที่จัดสอนในหลักสูตรชนั้ปีที่ 1\nเลข 2 หมายถึง รายวิชาที่จัดสอนในหลักสูตรชนั้ปีที่ 1-2\nเลข 3 หมายถึง รายวิชาที่จัดสอนในหลักสูตรชนั้ปีที่ 2-3\nเลข 4 หมายถึง รายวิชาที่จัดสอนในหลักสูตรชนั้ปีที่ 3-4\nเลข 5 หมายถึง รายวิชาที่จัดสอนในหลักสูตรชนั้ปีที่ 4\n4.3.2.2 รายวิชาและข้อกำหนดของหลักสูตร\n1) วิชาศึกษาทั่วไป 30 หน่วยกิต\nนักศึกษาจะต้องศึกษารายวิชาในหลักสูตรวิชาศึกษาทั่วไป รวมแล้วไม่น้อยกว่า 30 หน่วยกิต\nตามโครงสร้างและองค์ประกอบของหลักสูตรวิชาศกึษาทั่วไป ซึ่งแบ่ง 5 หมวด ดังนี้\nหมวดความเท่าทันโลกและสังคม บังคับ 2 วิชา 6 หน่วยกิต\nมธ.122 กฎหมายในชีวติประจำวัน 3 (3-0-6)\nTU 122 Law in Everyday Life\nมธ.124 สังคมกับเศรษฐกิจ 3 (3-0-6)\nTU 124 Society and Economy\nหมวดสุนทรยีะและทักษะการสื่อสาร บังคับ 2 วิชา 6 หน่วยกิต\nศศ.101 การคิด อ่าน และเขยีนอย่างมวีิจารณญาณ 3 (3-0-6)\nLAS 101 Critical Thinking, Reading, and Writing\nสษ.105 ทักษะการส่อืสารทางภาษาอังกฤษ 3 (3-0-6)\nEL 105 English Communication Skills\n10 หมวดคณิตศาสตร์ วิทยาศาสตร์ และเทคโนโลยีบังคับ 1 วิชา 3 หน่วยกิต\nมธ.107 ทักษะดิจทิัลกับการแก้ปัญหา 3 (3-0-6)\nTU 107 Digital Skill and Problem Solving\nหมวดสุขภาวะและทักษะแห่งอนาคต บังคับ 1 วิชา 3 หน่วยกิต\nมธ.242 นวัตกรรมการแก้ปัญหากับการคิดเชิงออกแบบ 3 (3-0-6)\nTU 242 Design Thinking and Innovative Problem Solving\nหมวดการบริการสังคมและการเรียนรู้จากการปฏิบัติบังคับ 1 วิชา 3 หน่วยกิต\nมธ.100 พลเมอืงกับการลงมือแก้ปัญหา 3 (3-0-6)\nTU 100 Civic Engagement\nหรอื\nมธ.200 พลเมอืงกับการลงมือแก้ปัญหาโดยออกแบบการเรียนรู้เอง 3 (3-0-6)\nTU 200 Self Design Civic Engagement\nเลือก 3 วิชา 9 หน่วยกิต จากรายวิชาดังต่อไปนี้\nมธ.101 โลก อาเซียน และไทย 3 (3-0-6)\nTU 101 Thailand, ASEAN, and the World\nมธ.121 มนุษย์ สังคม และวัฒนธรรม 3 (3-0-6)\nTU 121 Human, Societies and Cultures\nอซ.126 ความเชื่อและศาสนาในบริบทสังคมและการเมืองอาเซียน 3 (3-0-6)\nAS 126 Beliefs and Religions in the Sociopolitical Contexts of ASEAN\nวสห.102 สังคมไทยในโลกสมัยใหม่ 3 (3-0-6)\nCIS 102 Contemporary Thai Society in the Modern World\nมธ.102 ชีวติกับสุนทรียภาพ 3 (3-0-6)\nTU 102 Life & Aesthetics\nมธ.106 ความคิดสร้างสรรค์และการสื่อสาร 3 (3-0-6)\nTU 106 Creativity and Communication\nศศ.102 ประเทศไทยในมติทางประวัติศาสตร์ สังคม และวัฒนธรรม 3 (3-0-6)\nLAS 102 Thailand in Historical, Social and Cultural Perspective\nศศ.104 พัฒนาการของโลกสมัยใหม่ 3 (3-0-6)\nLAS 104 Development of the Modern World\nศศ.105 ปรัชญาและศาสนาเพื่อความพลเมือง 3 (3-0-6)\nLAS 105 Philosophy and Religious Studies for Citizenship\nปด.104 เส้นทางสคู่วามสมัยใหม่และโลกาภวิัตน์ 3 (3-0-6)\nPD 104 The Path to Modernity and Globalization\n11 มธ.103 ชีวติกับความยั่งยืน 3 (3-0-6)\nTU 103 Life and Sustainability\nมธ.143 มนุษย์กับสิ่งแวดล้อม 3 (3-0-6)\nTU 143 Man and Environment\nมธ.151 คณิตศาสตรทั์่วไประดับมหาวิทยาลัย 3 (3-0-6)\nTU 151 General College Mathematics\nมธ.155 สถิตพิืน้ฐาน 3 (3-0-6)\nTU 155 Elementary Statistics\nดท.100 นวัตกรรมดิจทิัล 3 (3-0-6)\nDX 100 Digital Innovation\nมธ.108 การพัฒนาและจัดการตนเอง 3 (3-0-6)\nTU 108 Self Development and Management\nมธ.201 ความรทู้างการเงินสำหรับบุคคล 3 (3-0-6)\nTU 201 Financial Literacy for Individuals\nสษ.115 การส่อืสารทางภาษาอังกฤษเพื่ออาชีพ 3 (3-0-6)\nEL 115 English Communication for Careers\nมธ.240 เศรษฐกิจภูมิรัฐศาสตร์โลก 3 (3-0-6)\nTU 240 World Geopolitical Economy\nมธ.243 ทักษะดิจติอลเพื่ออนาคต 3 (3-0-6)\nTU 243 Digital Skills for the Future\nลศ.209 ความรพูื้น้ฐานด้านนวัตกรรมสังคม และการประกอบธุรกิจเพื่อสังคม 3 (3-0-6)\nGS 209 Foundations of Social Innovation and Social Entrepreneurship\nมธ.431 การเรียนรจู้ากการสร้างสตาร์ทอัพของตนเอง 15 (0-45-45)\nTU 431 Learning through Own Startup\n2) วิชาเฉพาะ 78 หน่วยกิต\n2.1) วิชาแกน 21 หนว่ยกิต\nร.210 ปรัชญาการเมืองเบือ้งต้น 3 (3-0-6)\nPO 210 Introduction to Political Philosophy\nร.211 ความรเู้บือ้งต้นทางรัฐศาสตร์ 3 (3-0-6)\nPO 211 Introduction to Political Science\nร.241 ความรเู้บือ้งต้นทางบริหารรัฐกิจ 3 (3-0-6)\nPO 241 Introduction to Public Administration\n12 ร.271 ความรเู้บือ้งต้นทางความสัมพันธ์ระหว่างประเทศ 3 (3-0-6)\nPO 271 Introduction to International Relations\nร.300 วิธีวิทยาทางสังคมศาสตร์ 3 (3-0-6)\nPO 300 Social Science Methodology\nร.321 การเมอืงการปกครองของไทย 3 (3-0-6)\nPO 321 Thai Government and Politics\nร.380 พัฒนาการเศรษฐกิจและการเมอืงโลก 3 (3-0-6)\nPO 380 The Evolution of the Global Political Economy\n2.2) วิชาเฉพาะสาขา 42 หนว่ยกิต\nนักศึกษาจะต้องจดทะเบียนศกึษาวิชาเฉพาะสาขาของตน\n2.2.1 สาขาการเมืองการปกครอง\nก. วิชาบังคับสาขา นักศึกษาต้องจดทะเบียนเรียน 6 วิชา (18 หนว่ยกิต) ดังนี้\nร.221 พรรคการเมือง กลุ่มผลประโยชน์ และการเลือกตั้ง 3 (3-0-6)\nPO 221 Political Parties, Interest Groups and Elections\nร.222 พลวัตการเมืองท้องถิ่น 3 (3-0-6)\nPO 222 Dynamics of Local Politics\nร.312 การเมอืงกับกฎหมายมหาชน 3 (3-0-6)\nPO 312 Politics and Public Law\nร.320 การเมอืงการปกครองเปรียบเทียบ 3 (3-0-6)\nPO 320 Comparative Politics and Government\nร.322 สถาบันการเมอืงและรัฐธรรมนูญ 3 (3-0-6)\nPO 322 Political Institutions and Constitutions\nร.412 ทฤษฎีว่าด้วยสังคมและการเมือง 3 (3-0-6)\nPO 412 Theories on Society and Politics\nข. วิชาเลือกในสาขา นักศกึษาเลือกจดทะเบียนเรียนจากรายวิชาในสาขาของตน\nจำนวน 8 วิชา (24 หนว่ยกิต) จากรายวิชาดังตอ่ ไปนี้\nร.212 ประวัติความคิดทางการเมืองเบือ้งตน้ 3 (3-0-6)\nPO 212 Introduction to History of Political Thoughts\nร.224 พืน้ฐานทางเศรษฐกิจและสังคมของการเมืองการปกครองไทย 3 (3-0-6)\nPO 224 Economic and Social Ecology of Thai Government and Politics\nร.304 พฤติกรรมการเมือง ความคิดเห็นสาธารณะและจติวิทยา 3 (3-0-6)\nPO 304 Political Behavior, Public Opinion and Psychology\nร.307 ทฤษฎีการเมืองแนวสตรนีิยม 3 (3-0-6)\nPO 307 Feminist Political Theory\n13 ร.309 ทุน ธุรกิจกับการเมอืง 3 (3-0-6)\nPO 309 Capital, Business and Politics\nร.311 ขบวนการเคลื่อนไหวทางสังคมกับพืน้ที่ทางการเมอืง 3 (3-0-6)\nPO 311 Social Movements and Policical Space\nร.314 ประวัติความคิดทางการเมืองไทย 3 (3-0-6)\nPO 314 History of Thai Political Thoughts\nร.315 ปรัชญาสงครามและสันติภาพ 3 (3-0-6)\nPO 315 Philosophy of War and Peace\nร.319 ทฤษฎีการเมืองว่าด้วยเสรีนยิมและประชาธิปไตย 3 (3-0-6)\nPO 319 Liberal and Democratic Theories\nร.323 การเมอืงว่าด้วยการพัฒนา 3 (3-0-6)\nPO 323 Politics of Development\nร.326 การเมอืงการปกครองตะวันออกกลาง 3 (3-0-6)\nPO 326 Politics and Government of the Middle East\nร.327 การเมอืงการปกครองเอเชียใต้ 3 (3-0-6)\nPO 327 Politics and Government of South Asian Countries\nร.330 การเมอืงการปกครองเอเชียตะวันออกเฉียงใต้ 3 (3-0-6)\nPO 330 Politics and Government of Southeast Asia\nร.333 การเมอืงการปกครองเอเชียตะวันออก 3 (3-0-6)\nPO 333 East Asian Politics and Government\nร.336 การเมอืงการปกครองพหุอเมรกิา 3 (3-0-6)\nPO 336 Politics and Government of America\nร.337 การเมอืงการปกครองยุโรป 3 (3-0-6)\nPO 337 Politics and Government of Europe\nร.403 สัมมนา : ภาษากับการเมอืง 3 (3-0-6)\nPO 403 Seminar : Language and Politics\nร.404 สัมมนา : ศาสนากับการเมือง 3 (3-0-6)\nPO 404 Seminar : Religion and Politics\nร.405 สัมมนา : การเมืองและนวนิยาย 3 (3-0-6)\nPO 405 Seminar : Politics and Novels\nร.406 การเมอืงของเพศสภาพและเพศวิถี 3 (3-0-6)\nPO 406 Politics of Gender and Sexuality\nร.408 รัฐและสังคม 3 (3-0-6)\nPO 408 State and Society\n14 ร.409 ประชาธิปไตยและการพัฒนาประชาธิปไตย 3 (3-0-6)\nPO 409 Democracy and Democratisation\nร.414 สัมมนาแนวความคิดทางการเมืองไทย 3 (3-0-6)\nPO 414 Seminar on Thai Political Thoughts\nร.415 สัมมนา : ความรุนแรงและสันติวธิี 3 (3-0-6)\nPO 415 Seminar: Violence and Nonviolence\nร.416 สัมมนา : ประเด็นปัญหาปรัชญาการเมือง 3 (3-0-6)\nPO 416 Seminar on Problems in Political Philosophy\nร.418 กฎหมายปกครอง 3 (3-0-6)\nPO 418 Administrative Law\nร.424 สัมมนาปัญหาการเมืองการปกครองของไทย 3 (3-0-6)\nPO 424 Seminar on Problems of Political and Government of Thailand\nร.425 สัมมนาปัญหาในทางรัฐศาสตร์ 3 (3-0-6)\nPO 425 Seminar on Problems in Politics Science\nร.426 สัมมนาทฤษฎีเกี่ยวกับการเมอืงการปกครองเปรียบเทียบ 3 (3-0-6)\nPO 426 Concepts and Theories on Comparative Politics\nร.427 การเมอืงเชิงชาติพันธุ์และวัฒนธรรม 3 (3-0-6)\nPO 427 Ethnicity Politics and Culture\nร.428 สัมมนาทหารและการเมือง 3 (3-0-6)\nPO 428 Seminar on Military and Politics\nร.434 สัมมนาปัญหาทฤษฎีการเมืองกับปัญหาร่วมสมัย 3 (3-0-6)\nPO 434 Seminar on Political Theory and Contemporary Problems\nร.438 หลักและระเบียบทางราชการไทย 3 (3 - 0 - 6)\nPO 438 Principles and Regulations of the Thai Civil Service\nร.439 เทคโนโลยีกับการเมอืง 3 (3-0-6)\nPO 439 Technology and Politics\nร.519 การวิจัยของแตล่ะบุคคลภายใต้การแนะนำเกี่ยวกระบวนทัศน์ทางรัฐศาสตร์ 3 (2-2-5)\nPO 519 Directed Individual Research in Politics Sciance Approcahes\nร.523 การฝึกงานทางการเมอืงการปกครอง 3 (0-6-3)\nPO 523 I n t e r n s h i p in Politics and Government\nร.539 การวิจัยของแตล่ะบุคคลภายใต้การแนะนำเกี่ยวประเด็นทางรัฐศาสตร์ 3 (2-2-5)\nPO 539 Directed Individual Research in Politics Science Issues\n15 2.2.2 สาขาบริหารรัฐกิจ\nก. วิชาบังคับสาขา นักศึกษาต้องจดทะเบียนเรียน 6 วิชา (18 หนว่ยกิต) ดังนี้\nร.242 ทฤษฎีองค์การและการจัดการ 3 (3-0-6)\nPO 242 Organization Theories and Management\nร.250 การวางแผนและการจัดการเชงิกลยุทธ์ในบริบทสาธารณะ 3 (3-0-6)\nPO 250 Strategic Planning and Management in Public Context\nร.251 การบริหารทรัพยากรมนุษย์ภาครัฐ 3 (3-0-6)\nPO 251 Public Human Resource Management\nร.350 การบริหารรัฐกิจไทย 3 (3-0-6)\nPO 350 Introduction to Thai Public Administration\nร.360 การบริหารการคลังและงบประมาณ 3 (3-0-6)\nPO 360 Public Budgeting and Fiscal Administration\nร.361 นโยบายสาธารณะและการจัดการปกครอง 3 (3-0-6)\nPO 361 Public Policy and Governance\nข. วิชาเลือกในสาขา นักศกึษาเลือกจดทะเบียนเรียนจากรายวิชาในสาขาของตน\nจำนวน 8 วิชา (24 หน่วยกิต) จากรายวิชาดังตอ่ ไปนี้\nร.342 เครื่องมือการบริหารและการจัดการ 3 (3-0-6)\nPO 342 Administrative Tools and Management\nร.343 พฤติกรรมและวัฒนธรรมองค์การ 3 (3-0-6)\nPO 343 Organization Culture and Behavior\nร.345 องค์การและการจัดการสาธารณะไทย 3 (3-0-6)\nPO 345 Thai Public Organization and Management\nร.346 การบริหารโครงการ 3 (3-0-6)\nPO 346 Project Management\nร.347 การประเมนิผลโครงการ 3 (3-0-6)\nPO 347 Project Evaluation\nร.348 ความรเู้บือ้งต้นเกี่ยวกับนโยบายและการวางแผนสิ่งแวดล้อม 3 (3-0-6)\nPO 348 Introduction to Environmental Policy and Planning\nร.349 ความสัมพันธ์ระหว่างหน่วยงานของรัฐและการบริหารจัดการเครือข่าย 3 (3-0-6)\nPO 349 Intergovernmental Relations and Network Governance\nร.353 การบริหารแรงงาน 3 (3-0-6)\nPO 353 Labour Administration\n16 ร.356 เทคโนโลยีนวัตกรรมและการบริหารจัดการระบบข้อมูลสาธารณะ 3 (3-0-6)\nPO 356 Technology, Innovation and Public Management Information Syste\nร.357 การพัฒนาทรัพยากรมนุษย์ 3 (3-0-6)\nPO 357 Human Resource Development\nร.358 การบริหารการพัฒนาในบริบทโลก 3 (3-0-6)\nPO 358 Development Administration in Global Context\nร.359 การบริหารรัฐกิจเปรียบเทียบ 3 (3-0-6)\nPO 359 Public Administration in Comparative Perspective\nร.363 การบริหารการคลังท้องถิ่น 3 (3-0-6)\nPO 363 Local Financial Administration\nร.364 การจัดการความหลากหลายวัฒนธรรมองค์การ 3 (3-0-6)\nPO 364 Diversity and Organizational Culture Management\nร.366 การบริหารจัดการสิ่งแวดล้อมอย่างยั่งยืน 3 (3-0-6)\nPO 366 Sustainable Environmental Management\nร.367 แนวทางวเิคราะหน์ โยบายและหลักปฏิบัติแบบบูรณาการ 3 (3-0-6)\nPO 367 Integrated Approach to Policy Analysis and Practice\nร.368 นโยบายและการจัดการเมอืง 3 (3-0-6)\nPO 368 Urban Policy and Management\nร.369 การบริหารจัดกำรองคก์ รปกครองสว่นท้องถิ่น 3 (3-0-6)\nPO 369 Local Government Management\nร.443 สัมมนาการบริหารรัฐกิจ 3 (3-0-6)\nPO 443 Seminar in Public Administration\nร.444 การบริหารรัฐกิจกับการพัฒนาระหว่างประเทศ 3 (3-0-6)\nPO 444 Public Administration and International Development\nร.445 การบริหารจัดกำรองคก์ารไม่แสวงหากำไรและธุรกิจเพื่อสังคม 3 (3-0-6)\nPO 445 Non Profit Management and Social Entrepreneurship\nร.446 การจัดการความเสี่ยงและความต่อเน่อืงองค์การ 3 (3-0-6)\nPO 446 Orgainzational Risk and Continuity Management\nร.449 การบริหารจัดการความเสี่ยงภัยพิบัติ 3 (3-0-6)\nPO 449 Disaster Risk Governance\nร.453 สัมมนาการจัดการทุนมนุษย์เชงิกลยุทธ์ 3 (3-0-6)\nPO 453 Seminar on Strategic Human Resource Management\nร.455 สัมมนาประเด็นนโยบายสาธารณะ 3 (3-0-6)\nPO 455 Seminar on Contemporary Issues in Public Policy\n17 ร.463 สัมมนาการบริหารการคลังสาธารณะ 3 (3-0-6)\nPO 463 Seminar on Public Finance\nร.467 สัมมนาการบริหารรัฐวิสาหกิจ 3 (3-0-6)\nPO 467 Seminar of Public Enterprises on Management\nร.468 ทฤษฎีเกมสำหรับนักรัฐศาสตร์ 3 (3-0-6)\nPO 468 Game theory for political scientists\nร.567 การฝึกงานทางบริหารรัฐกิจ 3 (0-6-3)\nPO 567 Internship in Public Administration\nร.569 สหกิจศึกษาสาขาบริหารรัฐกิจ 3 (0-6-3)\nPO 569 I n t e g r a t ed Practices in Public Administration\n2.2.3 สาขาการระหว่างประเทศ\nก. วิชาบังคับสาขา นักศึกษาต้องจดทะเบียนเรียน 6 วิชา (18 หนว่ยกิต) ดังนี้\nร.272 ประวัติศาสตร์การทูต 3 (3-0-6)\nPO 272 Diplomatic History\nร.280 การเมอืงระหว่างประเทศ: ทฤษฎีและกรณีศึกษา 3 (3-0-6)\nPO 280 International Politics: Theories and Case Studies\nร.282 การอ่านและการวิเคราะหใ์ นความสัมพันธ์ระหว่างประเทศ 3 (3-0-6)\nPO 282 Reading and Analysis in International Relations\nร.320 การเมอืงการปกครองเปรียบเทียบ 3 (3-0-6)\nPO 320 Comparative Politics and Government\nร.370 การต่างประเทศของไทย 3 (3-0-6)\nPO 370 Thai Foreign Relations\nร.480 ทฤษฎีความสัมพันธ์ระหว่างประเทศระดับสูง 3 (3-0-6)\nPO 480 Advanced International Relations Theories\nข. วิชาเลือกในสาขา\nนักศึกษาเลือกจดทะเบียนเรียน 8 วิชา (24 หน่วยกิต) โดยแบ่งภาษาต่างประเทศที่ 2\nจำนวน 2 วิชา (ในภาษาเดียวกัน) และเลือกเรียนวิชาเลือกในสาขาของตน 6 วิชา (ในกรณีที่นักศึกษาได้\nศึกษาภาษาต่างประเทศที่ 2 วิชาโท อาจเลือกภาษาต่างประเทศที่ 2 ภาษาใดก็ได้อีก 2 วิชา ตาม\nเงื่อนไขข้างต้น หรอืศกึษาวิชาเลือกในสาขาของตนทดแทน 2 วิชา และใหนั้กศึกษาเลือกวิชาเรียนตามกลุ่ม\nวิชาดังตอ่ ไปนี้\nกลุ่มวิชาประเด็นศึกษา จำนวน 2 วิชา จากรายวิชาดังต่อไปนี้\nร.293 กฎหมาย องค์การและระบอบระหว่างประเทศ 3 (3-0-6)\nPO 293 International Law, Organization and Regime\n18 ร.377 สิ่งแวดล้อมกับความสัมพันธ์ระหว่างประเทศ 3 (3-0-6)\nPO 377 Environment and International Relations\nร.379 พิธีทางการทูตและการกงสุล 3 (3-0-6)\nPO 379 Diplomatic Protocol and Consular Affairs\nร.388 มหาอำนาจกับระเบียบโลก 3 (3-0-6)\nPO 388 Major Powers and the World Order\nร.393 การวิเคราะหน์ โยบายต่างประเทศ 3 (3-0-6)\nPO 393 Foreign Policy Analysis\nร.394 ยุทธศาสตรศ์ กึษาและความมั่นคงระหว่างประเทศ 3 (3-0-6)\nPO 394 Strategic Studies and International Security\nร.395 สื่อกับการเมอืงโลก 3 (3-0-6)\nPO 395 Media and Global Politics\nร.396 การทูตและการเจรจาระหว่างประเทศ 3 (3-0-6)\nPO 396 Diplomacy and International Negotiation\nร.397 การเมอืงของการพัฒนาระหว่างประเทศและความร่วมมอืระหว่างประเทศ 3 (3-0-6)\nเพื่อการพัฒนา\nPO 397 Politics of International Development and International Development Cooperation\nร.398 ประชาสังคมโลก 3 (3-0-6)\nPO 398 G lobal Civil Society\nร.399 ความมั่นคงของมนุษย์ 3 (3-0-6)\nPO 399 Human Security\nร.497 วิทยาศาสตร์และเทคโนโลยีในการเมืองโลก 3 (3-0-6)\nPO 497 Science and Technology in World Politics\nร.498 รัฐที่ไม่ใชม่หาอำนาจในความสัมพันธ์ระหว่างประเทศ 3 (3-0-6)\nPO 498 Non-Major Powers in International Relations\nร.499 ภูมริัฐศาสตร์ 3 (3-0-6)\nPO 499 Geopolitics\nกลุ่มวิชาอาณาบริเวณศึกษา จำนวน 2 วิชา จากรายวิชาดังต่อไปนี้\nร.283 ความสัมพันธ์ระหว่างประเทศในเอเชียตะวันออกเฉียงใต้ 3 (3-0-6)\nPO 283 International Relations in Southeast Asia\nร.373 ความสัมพันธ์ระหว่างประเทศในเอเชียตะวันออก 3 (3-0-6)\nPO 373 International Relations in East Asia\nร.374 การเมอืงและการต่างประเทศของสหราชอาณาจักร 3 (3-0-6)\nPO 374 British Politics and Foreign Affairs\n19 ร.375 ความสัมพันธ์ระหว่างประเทศในละตนิอเมริกา 3 (3-0-6)\nPO 375 International Relations in Latin America\nร.376 ความสัมพันธ์ระหว่างประเทศในตะวันออกกลาง 3 (3-0-6)\nPO 376 International Relations in the Middle East\nร.383 การเมอืงและการต่างประเทศของจนี 3 (3-0-6)\nPO 383 Chinese Politics and Foreign Affairs\nร.384 การเมอืงและการต่างประเทศของญี่ปุ่น 3 (3-0-6)\nPO 384 Japanese Poilitics and Foreign Affairs\nร.385 การเมอืงและการต่างประเทศของรัสเซีย 3 (3-0-6)\nPO 385 Russian Politics and Foreign Affairs\nร.386 การเมอืงและการต่างประเทศของสหรัฐอเมรกิา 3 (3-0-6)\nPO 386 U.S. Politics and Foreign Affairs\nร.387 ความสัมพันธ์ระหว่างประเทศในยุโรป 3 (3-0-6)\nPO 387 International Relations in Europe\nร.389 ความสัมพันธ์ระหว่างประเทศในเอเชียใต้ 3 (3-0-6)\nPO 389 International Relations in South Asia\nกลุ่มวิชาสัมมนา จำนวน 1 วิชา จากรายวิชาดังต่อไปนี้\nร.474 สัมมนานโยบายต่างประเทศไทย 3 (3-0-6)\nPO 474 Seminar: Thai Foreign Policies\nร.476 ทฤษฎีวพิากษ์ในความสัมพันธ์ระหว่างประเทศ 3 (3-0-6)\nPO 476 Critical Theories in International Relations\nร.478 สัมมนาภูมิภาคนิยม 3 (3-0-6)\nPO 478 Seminar: Regionalism\nร.479 สัมมนาปัญหาความขัดแย้งระหว่างประเทศและการแก้ไข 3 (3-0-6)\nPO 479 Seminar: Problems in International Conflicts and Resolutions\nร.488 สัมมนาหัวข้อเฉพาะในความสัมพันธ์ระหว่างประเทศ 3 (3-0-6)\nPO 488 Seminar: Selected Topics in International Relations\nร.489 สัมมนาหัวข้อเฉพาะในเศรษฐกิจการเมอืงระหว่างประเทศ 3 (3-0-6)\nPO 489 Seminar: Selected Topics in International Political Economy\nร.495 สัมมนา : ประชาคมอาเซียน 3 (3-0-6)\nPO 495 Seminar: ASEAN Community\nร.496 สัมมนาสงครามโลกศกึษา 3 (3-0-6)\nPO 496 Seminer on World War Studies\n20 ร.576 การฝึกงานทางการระหว่างประเทศ 3 (0-6-3)\nPO 576 Internship in International Affairs\nเลือกศกึษารายวิชาในสาขาระดับ 200 ขึ้นไปท่นีักศึกษาสนใจ จำนวน 1 วิชา\n2.3) วิชาบังคับนอกคณะ 15 หนว่ยกิต\nศ.210 เศรษฐศาสตร์เบื้องตน้ 3 (3-0-6)\nEC 210 Introductory Economics\nอ.221 การอ่านและการเขียนเชิงบูรณาการ 3 (3-0-6)\nEG 221 Integrated Reading and Writing\nสษ.217 การฟังและการพูดด้านวิชาการ 3 (3-0-6)\nEL 217 Speaking and Listening for Academic Purposes\nสษ.231 ภาษาอังกฤษสำหรับรัฐศาสตร์ 1 3 (3-0-6)\nEL 231 English for Political Science 1\nสษ.331 ภาษาอังกฤษสำหรับรัฐศาสตร์ 2 3 (3-0-6)\nEL 331 English for Political Science 2\n3) วิชาโท หรอืวิชำเลือก 15 หน่วยกิต\nนักศึกษาคณะรัฐศาสตร์ อาจจะเลือกศึกษาสาขาวิชาใดวิชาหนึ่งทั้งในและนอกคณะรัฐศาสตร์\nวิชาโทได้ดังนี้\n3.1 วิชาโทในคณะ (นอกสาขาวิชาเอก)\nก. วิชาโทสาขาการเมืองการปกครอง จำนวน 15 หน่วยกิต โดยจดทะเบียนเรียนวิชาตาม\nลักษณะวิชาบังคับสาขาการเมอืงการปกครอง จำนวน 5 วิชา 15 หนว่ยกิต\nร.221 พรรคการเมือง กลุ่มผลประโยชน์ และการเลือกตั้ง 3 (3-0-6)\nPO 221 Political Parties, Interest Groups and Elections\nร.222 พลวัตการเมืองท้องถิ่น 3 (3-0-6)\nPO 222 Dynamics of Local Politics\nร.312 การเมอืงกับกฎหมายมหาชน 3 (3-0-6)\nPO 312 Politics and Public Law\nร.322 สถาบันการเมอืงและรัฐธรรมนูญ 3 (3-0-6)\nPO 322 Political Institutions and Constitutions\nร.320 การเมอืงการปกครองเปรียบเทียบ 3 (3-0-6)\nPO 320 Comparative Politics and Government\nหรอื\nร.412 ทฤษฎีว่าด้วยสังคมและการเมือง 3 (3-0-6)\nPO 412 Theories on Society and Politics\n21 ข. วิชาโทสาขาบริหารรัฐกิจ จำนวน 15 หน่วยกิต โดยจดทะเบียนเรียนวิชาตามลักษณะวิชา\nบังคับสาขาบริหารรัฐกิจ จำนวน 5 วิชา 15 หนว่ยกิต\nร.242 ทฤษฎีองค์การและการจัดการ 3 (3-0-6)\nPO 242 Organization Theories and Management\nร.250 การวางแผนและการจัดการเชงิกลยุทธ์ในบริบทสาธารณะ 3 (3-0-6)\nPO 250 Strategic Planning and Management in Public Context\nร.251 การบริหารทรัพยากรมนุษย์ภาครัฐ 3 (3-0-6)\nPO 251 Public Human Resource Management\nร.350 การบริหารรัฐกิจไทย 3 (3-0-6)\nPO 350 Introduction to Thai Public Administration\nร.360 การบริหารการคลังและงบประมาณ 3 (3-0-6)\nPO 360 Public Budgeting and Fiscal Administration\nหรอื\nร.361 นโยบายสาธารณะและการจัดการปกครอง 3 (3-0-6)\nPO 361 Public Policy and Governance\nค. วิชาโทสาขาการระหว่างประเทศ จำนวน 15 หน่วยกิต โดยจดทะเบียนเรียนวิชาตาม\nลักษณะวิชาบังคับเฉพาะสาขาการระหว่างประเทศ จำนวน 5 วิชา 15 หนว่ยกิต\nร.272 ประวัติศาสตร์การทูต 3 (3-0-6)\nPO 272 Diplomatic History\nร.280 การเมอืงระหว่างประเทศ: ทฤษฎีและกรณีศึกษา 3 (3-0-6)\nPO 280 International Politics: Theories and Case Studies\nร.282 การอ่านและการวิเคราะหใ์ นความสัมพันธ์ระหว่างประเทศ 3 (3-0-6)\nPO 282 Reading and Anallysis in International Relations\nร.370 การต่างประเทศของไทย 3 (3-0-6)\nPO 370 Thai Foreign Relations\nร.480 ทฤษฎีความสัมพันธ์ระหว่างประเทศระดับสูง 3 (3-0-6)\nPO 480 Advance International Relations Theories\n22 3.2 วิชาโทนอกคณะ นักศึกษาอาจเลือกศึกษาสาขาวิชาใดวิชาหนึ่งที่เปิดสอนในมหาวิทยาลัย\nธรรมศาสตร์วิชาโท โดยศึกษาตามข้อกำหนดและเงื่อนไขของหลักสูตรวิชาโทในสาขา วิชา/คณะนั้น ๆ\nไม่น้อยกว่า 15 หนว่ยกิต และ\nนักศึกษาจะนำวิชาเหล่านีม้านับวิชาโทนอกคณะไม่ได้ตามเง่อืนไขที่ระบุดังตอ่ ไปนี้\n1. วิชาในหลักสูตรวิชาศึกษาทั่วไป ที่ใช้รหัสย่อ “มธ” ทุกวิชา รวมทั้งวิชาที่ใช้รหัสย่อ “วฬ” ทุก\nวิชา\n2. วิชาพืน้ฐานทางวิทยาศาสตร์และคณติศาสตร์ทุกวิชา\n3.3 วิชาเลือก ให้เลือกศึกษาจากวิชาของสาขาวิชา/คณะใดก็ได้ตั้งแต่ระดับ 200 ขึ้นไป รวมไม่เกิน 4\nสาขา/คณะ ไม่น้อยกว่า 15 หน่วยกิต ซึ่งนักศึกษาสามารถเลือกศึกษาวิชาศึกษาทั่วไป หมวดภาษา\nต่างประเทศ ที่ใช้รหัสย่อ “อซ” ระดับ 100 ได้ยกเว้น “อซ.125 และ อซ.126” ทั้งนี้นักศึกษาจะนำวิชา\nเหล่านีม้านับวิชาเลือกไม่ได้ตามเง่อืนไขที่ระบุดังตอ่ ไปนี้\n1. วิชาในหลักสูตรวิชาศึกษาทั่วไป ที่ใช้รหัสย่อ “มธ” ระดับ 100 ทุกวิชา รวมทั้งวิชาที่ใช้รหัสย่อ\n“วฬ” ทุกวิชา\n2. วิชาพืน้ฐานทางวิทยาศาสตร์และคณติศาสตร์ทุกวิชา\n4) วิชาเลือกเสรี 6 หน่วยกิต\nนักศึกษาสามารถเลือกศึกษาวิชาใดก็ได้ตั้งแต่ระดับ 200 ขึ้นไป ที่เปิดสอนในมหาวิทยาลัย\nธรรมศาสตร์ ทั้งนี้นักศึกษาสามารถเลือกศึกษาวิชาศึกษาทั่วไป หมวดภาษาต่างประเทศที่ใช้รหัสย่อ\n“อซ” ระดับ 100 ได้ยกเว้น “อซ.125 และ อซ.126”\nนักศึกษาจะนำวิชาเหล่านี้มานับวิชาเลือกเสรีไม่ได้คือ วิชาในหลักสูตรวิชาศึกษาทั่วไป ที่ใช้\nรหัสย่อ \"มธ\" ระดับ 100 ทุกวิชา\n4.4 การศึกษาสาขาวิชารัฐศาสตร์วิชาโท\n4.4.1 นักศึกษานอกคณะรัฐศาสตร์ที่ประสงค์จะศกึษาสาขาวิชารัฐศาสตร์วิชาโท จะต้องศกึษา\nรายวิชาเฉพาะคณะรัฐศาสตร์ จำนวน 15 หนว่ยกิต จากรายวิชาดังตอ่ ไปนี้\nร.210 ปรัชญาการเมอืงเบือ้งตน้ 3 (3-0-6)\nPO 210 Introduction to Political Philosophy\nร.211 ความรเู้บือ้งต้นทางรัฐศาสตร์ 3 (3-0-6)\nPO 211 Introduction to Political Science\nร.241 ความรู้เบื้องต้นทางบริหารรัฐกิจ 3 (3-0-6)\nPO 241 Introduction to Public Administration\nร.271 ความรเู้บือ้งตน้ทางความสัมพันธ์ระหว่างประเทศ 3 (3-0-6)\nPO 271 Introduction to International Relations\nร.321 การเมอืงการปกครองของไทย 3 (3-0-6)\nPO 321 Thai Government and Politics\n23 4.4.2 นักศึกษาหลักสูตรการผังเมอืงบัณฑิต คณะสถาปัตยกรรมศาสตร์และการผังเมอืง ที่ประสงค์\nจะศกึษาสาขาวิชารัฐศาสตร์วิชาโท จะต้องศกึษารายวิชาของคณะรัฐศาสตร์ จำนวน 15 หนว่ยกิต\nในรายวิชา ดังนี้\nร.211 ความรู้เบื้องต้นทางรัฐศาสตร์ 3 (3-0-6)\nPO 211 Introduction to Political Science\nร.241 ความรเู้บือ้งตน้ทางบริหารรัฐกิจ 3 (3-0-6)\nPO 241 Introduction to Public Administration\nร.361 นโยบายสาธารณะและการจัดการปกครอง 3 (3-0-6)\nPO 361 Public Policy and Governance\nร.368 นโยบายและการจัดการเมอืง 3 (3-0-6)\nPO 368 Urban Policy and Management\nร.418 กฎหมายปกครอง 3 (3-0-6)\nPO 418 Administrative Law\n4.4.3 นักศึกษาหลักสูตรรัฐศาสตรบัณฑิต คณะรัฐศาสตร์ สามารถเลือกศึกษารายวิชาจากหลักสูตร\nการผังเมอืงบัณฑิต  วชิาโท (Minor) จำนวน 15 หนว่ยกิต โดยมีรายวิชา ดังนี้\nผม.243 แบบจำลองการวางแผนการใชที่ดนิ 3 (3-0-6)\nUP 243 Land Use Models\nผม.252 เศรษฐศาสตร์เมอืงเพื่อการวางแผนและผังเมือง 3 (3-0-6)\nUP 252 Urban Economics for Planning\nผม.358 สังคมเมืองและการปกครอง 3 (3-0-6)\nUP 358 Urban Society and Governance\nผม.463 การพัฒนาและบริหารจัดการอสังหาริมทรัพย์ 3 (3-0-6)\nUP 463 Real Estate Development and Managemen\nผม.466 การจัดการสิ่งแวดล้อมเมอืงและชนบท 3 (3-0-6)\nUP 466 Urban and Rural Environmental Management\n4.5 การศึกษาเพื่อรับอนุปริญญาในสาขาวิชารัฐศาสตร์\nนักศึกษาผู้ใดได้ศึกษารายวิชาต่าง ๆ ตามหลักสูตรในสาขาวิชารัฐศาสตร์ได้หน่วยกิตสะสมไม่น้อย\nกว่า 105 หนว่ยกิต ตามเง่อืนไขดังต่อไปนีมี้สทิธิได้รับอนุปริญญา\n1. ได้ค่าระดับเฉลี่ยสะสมไม่น้อยกว่า 2.00\n2. ได้ขึ้นทะเบียนนักศึกษาไม่น้อยกว่า 5 ภาคการศกึษาปกติ\n3. ได้ศึกษาวิชาศกึษาทั่วไปของมหาวิทยาลัย ครบ 30 หนว่ยกิต\n4. ได้ศึกษาวิชาบังคับในคณะรัฐศาสตร์ ดังนี้\n24 ก. วิชาแกนของคณะ 7 วิชา จำนวน 21 หนว่ยกิต\nข. วิชาบังคับสาขา สาขาใดก็ได้จำนวน 18 หนว่ยกิต\n(โดยเลือกศกึษาจาก วิชาบังคับสาขาการเมอืงการปกครอง จำนวน 18 หน่วยกิต หรอืวิชำบังคับสาขาการ\nระหว่างประเทศ จำนวน 18 หนว่ยกิต หรอืวิชำบังคับสาขาบริหารรัฐกิจ จำนวน 18 หนว่ยกิต)\nค. วิชาเลือกในสาขาใดก็ได้รวมกัน จำนวน 24 หนว่ยกิต\n5. ได้ศึกษาวิชาเลือกเสรีตั้งแต่รหัส 200 ขึ้นไป (จำนวน 12 หน่วยกิต) ที่เปิดสอนใน\nมหาวิทยาลัยธรรมศาสตร์ ทั้งนี้นักศึกษาสามารถเลือกศึกษาวิชาศกึษาทั่วไป หมวดภาษาต่างประเทศ ที่\nใช้รหัสย่อ “อซ” ระดับ 100 ได้ยกเว้น “อซ.125 และ อซ.126”\nนักศึกษาจะนำวิชาเหล่านี้มานับวิชาเลือกเสรีไม่ได้คือ วิชาในหลักสูตรวิชาศึกษาทั่วไป\nที่ใชร้หัสย่อ “มธ” ระดับ 100 ทุกวิชา\n4.3.2.3 แสดงแผนการศึกษา\nปีการศึกษาที่ 1\nภาคเรยีนที่ 1 หน่วยกิต\nมธ.122 กฎหมายในชีวิตประจำวัน 3\nมธ.124 สังคมกับเศรษฐกิจ 3\nศศ.101 การคิด อ่านและเขียนอย่างมวีิจารณญาณ 3\nวิชาศกึษาทั่วไป วิชาเลือก 3\nวิชาศกึษาทั่วไป วิชาเลือก 3\nรวม 15\nภาคเรยีนที่ 2 หน่วยกิต\nมธ.107 ทักษะดิจทิัลกับการแก้ปัญหา 3\nมธ.242 นวัตกรรมการแก้ปัญหากับการคิดเชิงออกแบบ 3\nมธ.100 พลเมืองกับการลงมอื แก้ปัญหา หรอื 3\nมธ.200 พลเมืองกับการลงมอื แก้ปัญหาโดยออกแบบการเรียนรู้เอง\nสษ.105 ทักษะการส่อืสารทางภาษาอังกฤษ 3\nวิชาศกึษาทั่วไป วิชาเลือก 3\nรวม 15\n25 ปีการศึกษาที่ 2\nภาคเรยีนที่ 1 หน่วยกิต\nร.211 ความรู้เบื้องต้นทางรัฐศาสตร์ 3\nร.241 ความรู้เบื้องต้นทางบริหารรัฐกิจ 3\nร.271 ความรเู้บือ้งตน้ทางความสัมพันธ์ระหว่างประเทศ 3\nศ.210 เศรษฐศาสตร์เบื้องต้น 3\nอ.221 การอ่านและการเขียนเชงิบูรณาการ 3\nรวม 15\nภาคเรยีนที่ 2 หน่วยกิต\nร.210 ปรัชญาการเมอืงเบือ้งตน้ 3\nร.300 วธิีวิทยาทางสังคมศาสตร์ 3\nสษ.217 การฟังและการพูดด้านวิชาการ 3\nวิชาบังคับสาขา (ระดับ 200-300) 3\nวิชาเลือกในสาขา (ระดับ 200-300) 3\nรวม 15\nปีการศึกษาที่ 3\nภาคเรยีนที่ 1 หนว่ยกิต\nร.321 การเมืองการปกครองของไทย 3\nสษ.231 ภาษาอังกฤษสำหรับนักรัฐศาสตร์ 1 3\nวิชาบังคับสาขา (ระดับ 200-300) 3\nวิชาเลือกในสาขา (ระดับ 200-300) 3\nวิชาเลือกในสาขา (ระดับ 200-300) 3\nวิชาโท หรือ วิชาเลือก 3\nรวม 18\nภาคเรยีนที่ 2 หนว่ยกิต\nร.380 พัฒนาการเศรษฐกิจและการเมอืงโลก 3\nวิชาบังคับสาขา (ระดับ 200-300) 3\nวิชาเลือกในสาขา (ระดับ 200-300) 3\nวชิาเลือกในสาขา (ระดับ 200-300) 3\nวิชาโท หรือ วิชาเลือก 3\nวิชาเลือกเสรี 3\nรวม 18\n26 ปีการศึกษาที่ 4\nภาคเรยีนที่ 1 หน่วยกิต\nสษ.331 ภาษาอังกฤษสำหรับนักรัฐศาสตร์ 2 3\nวิชาบังคับสาขา (ระดับ 300-400) 3\nวิชาเลือกในสาขา (ระดับ 200-400) 3\nวิชาโท หรือ วิชาเลือก 3\nวิชาโท หรือ วิชาเลือก 3\nวิชาโท หรือ วชิาเลือก 3\nรวม 18\nภาคเรยีนที่ 2 หน่วยกิต\nวิชาบังคับสาขา (ระดับ 300-400) 3\nวิชาบังคบัสาขำ (ระดับ 300-400) 3\nวิชาเลือกในสาขา (ระดับ 200-500) 3\nวิชาเลือกในสาขา (ระดับ 200-500) 3\nวิชาเลือกเสรี 3\nรวม 15\n27 4.3.2.4 คำอธิบายรายวิชา\n1) วิชาศึกษาทั่วไป\nหมวดความเท่าทันโลกและสังคม\nมธ.122 กฎหมายในชีวติประจำวัน 3 (3-0-6)\nTU 122 Law in Everyday Life\nลักษณะทั่วไปของกฎหมาย ในฐานะที่แบบแผนความประพฤติของมนุษย์ในสังคม หลักการ\nพื้นฐานของนิติรัฐ (rule of law) คุณค่าของกฎหมายในฐานะที่เชื่อมโยงกับหลักคุณธรรมของประชาชน\nความรู้พื้นฐานในเรื่องกฎหมายเอกชนและกฎหมายมหาชนที่พลเมืองในระบอบประชาธิปไตยควรต้องรู้ทั้ง\nในด้านของสิทธิ และในด้านของหน้าที่การระงับข้อพิพาทและกระบวนการยุติธรรมของไทย หลักการใช้\nและการตคีวามกฎหมาย โดยเน้นการศึกษาจากกรณีตัวอย่างที่เกิดขึ้นจริงในชีวติประจำวัน\nTo study general aspects of law as correct patterns of human conduct in society. To equip\nlearners with basic principles of public law (rules of law), and its values which are associated with\ncitizens’ moral core. To provide basic knowledge in public law and private law, involving the issues of\nrights and duties, dispute settlement, Thai Justice procedures, the usage and interpretation of law\nprinciples, with an emphasis on case studies in our daily lives.\nมธ.124 สังคมกับเศรษฐกิจ 3 (3-0-6)\nTU 124 Society and Economy\nแนวทางการศึกษาและการวิเคราะห์สังคมและเศรษฐกิจในฐานะที่วิชานี้การศึกษาทางด้าน\nสังคมศาสตร์ แล้วนาสู่การวิเคราะห์วิวัฒนาการของสังคมและเศรษฐกิจที่เกิดขึ้นในภาพกว้างของโลกและ\nของประเทศไทย โดยเน้นใหเ้ห็นถึงอทิธิพลของวัฒนธรรมและสถาบันที่มตี่อระบบสังคมเศรษฐกิจ\nTo provide guidelines for the study and analysis of society and economy. To analyze social\nand economic evolution in Thailand and worldwide. To emphasize the influence of culture and\ninstitutions on the social and economic system.\nหมวดสุนทรียะและทักษะการส่อืสาร\nศศ.101 การคิด อ่าน และเขียนอย่างมวีิจารณญาณ 3 (3-0-6)\nLAS 101 Critical Thinking, Reading, and Writing\nพัฒนาทักษะการคิดอย่างมีวิจารณญาณผ่านการตั้งคำถาม การวิเคราะห์ การสังเคราะห์ และการ\nประเมินค่าพัฒนาทักษะการอ่านเพื่อจับสาระสำคัญ เข้าใจจุดมุ่งหมาย ทัศนคติสมมติฐาน หลักฐาน\nสนับสนุน การใช้เหตุผลที่นำไปสู่ข้อสรุปของงานเขียน พัฒนาทักษะการเขียนแสดงความคิดเห็นอย่างมี\nเหตุผลและการเขียนเชิงวิชาการ รู้จักถ่ายทอดความคิด และเชื่อมโยงข้อมูลเข้ากับมุมมองของตนเอง\nรวมถึงสามารถอำงองิหลักฐานและข้อมูลมาใช้ในการสร้างสรรค์งานเขียนได้อย่างมปีระสิทธิภาพ\n28 Development of critical thinking through questioning, analytical, synthetic and evaluation skills.\nStudents learn how to read without necessarily accepting all the information presented in the text, but\nrather consider the content in depth, taking into account the objectives, perspectives, assumptions,\nbias and supporting evidence, as well as logic or strategies leading to the author’s conclusion. The\npurpose is to apply these methods to students’ own persuasive writing based on information\nresearched from various sources, using effective presentation techniques.\nสษ.105 ทักษะการส่อืสารทางภาษาอังกฤษ 3 (3-0-6)\nEL 105 English Communication Skills\nพัฒนาทักษะการสื่อสารทางภาษาอังกฤษด้านการฟัง พูด อ่าน และเขียน ฝึกการใช้ภาษา คำศัพท์\nและสำนวนในบริบททางวิชาการและสังคม\nDevelopment of English communication skills, including listening, speaking, reading and\nwriting. Practice of language, vocabulary and expressions used in academic and social contexts.\nหมวดคณิตศาสตร์ วิทยาศาสตร์ และเทคโนโลยี\nมธ.107 ทักษะดิจทิัลกับการแก้ปัญหา 3 (3-0-6)\nTU 107 Digital Skill and Problem Solving\nทักษะการคิดเชิงคำนวณเพื่อการแก้ปัญหาและการพัฒนาโอกาสใหม่ด้านสังคมและเศรษฐกิจ\nความสามารถในการค้นหาและการเข้าถึงสารสนเทศได้อย่างมีประสิทธิภาพ การประเมินความน่าเชื่อถือ\nของสารสนเทศ การกลั่นกรองและจัดการสารสนเทศอย่างระบบ การใช้และจรรยาบรรณด้านดิจิทัล\nการส่อืสารออนไลน์อย่างมอืาชีพ\nBasic computational thinking skill for solving problems and developing new social and\neconomic opportunities. Efficient access and search for information. Information reliability evaluation.\nFiltering and managing information systematically. Ethical digital usage and professional online\ncommunication.\nหมวดสุขภาวะและทักษะแหง่อนาคต\nมธ.242 นวัตกรรมการแก้ปัญหากับการคิดเชิงออกแบบ 3 (3-0-6)\nTU 242 Design Thinking and Innovative Problem Solving\nการประยุกต์ใช้หลักการพื้นฐานของการคิดเชิงออกแบบในการแก้ปัญหาอย่างสร้างสรรค์ เน้น\nสร้างความเข้าใจผ่านแต่ละขั้นตอนของกระบวนการและเครื่องมือในการทำวิจัยเชิงการออกแบบพร้อม\nกรณีศกึษา\n29 The Application of Fundamental Principles of Design Thinking for Creative problem-Solving,\nEmphasizing on the Understanding of Process as well as Cases Study and Experiment with Expert\nCoaching\nหมวดการบริการสังคมและการเรียนรจู้ากการปฏิบัติ\nมธ.100 พลเมอืงกับการลงมือแก้ปัญหา 3 (3-0-6)\nTU 100 Civic Engagement\nปลูกฝังจิตสำนึก บทบาท และหน้าที่ความรับผิดชอบของการสมาชิกที่ดีของสังคมในฐานะ\nพลเมืองโลกผ่านกระบวนการหลากหลายวิธี เช่น การบรรยาย การอภิปรายกรณีศึกษาต่าง ๆ ดูงาน\nต้น โดยนักศึกษาจะต้องจัดทำโครงการรณรงค์ เพื่อให้เกิดการรับรู้หรือเกิดการเปลี่ยนแปลงใน\nประเด็นที่สนใจ\nInstillation of social conscience and awareness of one’s role and duties as a good global\ncitizen. This is done through a variety of methods such as lectures, discussion of various and field\nstudy outings. Students are required to organise a campaign to raise awareness or bring about\nchange in an area of their interest.\nมธ.200 พลเมอืงกับการลงมือแก้ปัญหาโดยออกแบบการเรียนรเู้อง 3 (3-0-6)\nTU 200 Self Design Civic Engagement\nการพัฒนาทัศนคติความพลเมืองในระบอบประชาธิปไตยที่พึ่งพาตนเองในการแก้ไขปัญหาของ\nสังคม เรียนรู้วิธีการลงมือแก้ปัญหาต่าง ๆ ที่เกิดขึ้นในสังคมด้วยการลงมือทำ โดยออกแบบกระบวนการ\nเรียนรู้และการวัดผลรว่มกับอาจารย์ผู้สอน\nThe development of citizenship attitudes in self-reliant democracy in solving social problems;\nLearn how to take self action to solve problems in society by designing the learning process and\nevaluation in collaboration with instructor.\nหมวดวิชาเลือก\nมธ.101 โลก อาเซียน และไทย 3 (3-0-6)\nTU 101 Thailand, ASEAN, and the World\nศึกษาปรากฏการณ์ที่สำคัญของโลก อาเซียนและไทย ในมิติทางการเมือง เศรษฐกิจ สังคม\nวัฒนธรรม โดยใช้กรอบแนวคิด ทฤษฎี และระเบียบวิจัยทางสังคมศาสตร์ ผ่านการอภิปรายและ\nยกตัวอย่างสถานการณ์หรือบุคคลที่ได้รับความสนใจ เพื่อให้เกิดมุมมองต่อความหลากหลายและเข้า\nใจความซับซ้อนที่สัมพันธ์กันทั้งโลก มีจติสำนึกสากล (GLOBAL MINDSET) สามารถท้าทายกรอบความเชื่อ\nเดิมและเปิดโลกทัศนใ์ หม่ให้กว้างขวางขึ้น\n30 Study of significant phenomena around the world, in the ASEAN region and in Thailand in\nterms of their political, economic and sociocultural dimensions. This is done through approaches,\ntheories and principles of social science research via discussion and raising examples of situations or\npeople of interest. The purpose of this is to create a perspective of diversity, to understand the\ncomplexity of global interrelationships, to build a global mindset and to be able to challenge old\nparadigms and open up a new, broader worldview.\nมธ.121 มนุษย์ สังคม และวัฒนธรรม 3 (3-0-6)\nTU 121 Human, Societies and Cultures\nความรู้เบื้องต้นว่าด้วยการศึกษาทำความเข้าใจมนุษย์ในมิติทางสังคมและวัฒนธรรม ความเข้าใจ\nพืน้ฐานเกี่ยวกับพัฒนาการและกระบวนการเปลี่ยนแปลงทางสังคมวัฒนธรรม โดยเฉพาะมิติที่เชื่อมโยงกับ\nสถาบันและระบบคุณค่าทางสังคม บทบาทของสังคมศาสตร์ในการทำความเข้าใจโครงสร้างและวิถีปฏิบัติ\nทางสังคมและวัฒนธรรม การประยุกต์ใช้กรอบมโนทัศน์ทางสังคมศาสตร์เพื่อพัฒนาประเด็นอภิปราย\nเกี่ยวกับปรากฏการณ์ทางสังคมวัฒนธรรมร่วมสมัย\nIntroduction to the understanding of human from social and cultural perspectives. General\nintroduction to the development of societies and socio-cultural transformation, with special reference\nto social institutions and values. Social science and its contribution to the studies of social structures\nand socio-cultural practices. Application of conceptual frameworks in social science for the analysis of\ncontemporary social and cultural issues.\nอซ.126 ความเชื่อและศาสนาในบริบทสังคมและการเมอืงอาเซียน 3 (3-0-6)\nAS 126 Beliefs and Religions in the Sociopolitical Contexts of ASEAN\nบทบาทของความเช่อื และศาสนาที่มีผลต่อสังคมและการเมืองอาเซียน ความสัมพันธ์ระหว่างความ\nเช่อื และศาสนากับการเคลื่อนไหวทางการเมือง วิวาทะร่วมสมัยเกี่ยวกับความสัมพันธ์ระหว่างศาสนากับรัฐ\nThe role of beliefs and religions and its impacts on the society and politics of ASEAN; the\nrelationship between beliefs, religions, and political movements; contemporary debates on religion-\nstate relations.\nวสห.102 สังคมไทยในโลกสมัยใหม่ 3 (3-0-6)\nCIS 102 Contemporary Thai Society in the Modern World\nการเปลี่ยนแปลงของสังคมไทยภายใต้กระแสโลกาภิวัฒน์และการเปลี่ยนแปลงทางเศรษฐกิจการ\nเมืองไทย ประเด็นทางสังคมที่เกี่ยวข้องกับปัญหาความยากจน ความเหลื่อมล้ำ และความอยู่ดีมีสุข\nปรำกฎการณ์สมัยทางสังคมร่วมสมัยที่เกิดขึ้นทั้งในพื้นที่เมืองและชนบท ความสัมพันธ์ระหว่างเมืองและ\n31 ชนบท ครอบคลุมการเปลี่ยนแปลงวิถีการดำรงชีพและรูปแบบการใช้ชีวิต การบริโภค ชีวิตประจำวันใน\nเมืองสมัยใหมแ่ละชนบทในยุคดิจทิัล\nSocial transformations of Thai society undergoing the process of globalization, and Thailand’s\npolitical and economic transformation. Current social issues relating to poverty, inequality, and well-\nbeing. Contemporary social phenomena occurring in rural and urban areas, rural-urban linkages,\nincluding changes in livelihoods and pattern of living, consumption, everyday life in modern cities and\nrural areas in digital age.\nมธ.102 ชีวติกับสุนทรียภาพ 3 (3-0-6)\nTU 102 Life & Aesthetics\nสุนทรียภาพและองค์ประกอบพื้นฐานของงานศลิปะและสภาพแวดล้อมสรรค์สร้าง ความซาบซึง้ ใน\nคุณค่าและความหมาย การวิเคราะหวิ์พากษ์ และการเช่อืมโยงเข้ากับชีวติตนเองและบริบททางสังคม\nThe course investigates aesthetic and fundamental elements of art and built environment.\nThese include appreciation in value and meaning, analyses and criticisms, and connections to lives and\nsocial contexts.\nมธ.106 ความคิดสร้างสรรคแ์ ละการส่อืสาร 3 (3-0-6)\nTU 106 Creativity and Communication\nกระบวนการคิดอย่างสร้างสรรค์ โดยมีการคิดเชิงวิพากษ์องค์ประกอบสำคัญ และการ\nสื่อสารความคิดดังกล่าวให้เกิดผลสัมฤทธิ์อย่างเหมาะสมตามบริบทสังคม วัฒนธรรม สภาพแวดล้อม ทั้ง\nในระดับบุคคล องค์กร และสังคม\nCreative thought processes, with critical thinking as an important part, as well as\ncommunication of these thoughts that lead to suitable results in social, cultural and environmental\ncontexts, at personal, organisational and social levels\nศศ.102 ประเทศไทยในมติทางประวัติศาสตร์ สังคม และวัฒนธรรม 3 (3-0-6)\nLAS 102 Thailand in Historical, Social and Cultural Perspective\nภูมิหลังของสังคม วัฒนธรรม และภูมิปัญญาไทย ตั้งแต่อดีต สยามประเทศ จนถึงประเทศไทย\nมุ่งเน้นประเด็นการสร้างเอกลักษณ์ไทย และทิศทางการพัฒนาของสังคมและวัฒนธรรมไทย ในบริบทแห่ง\nโลกาภวิัฒน์ “มีการศกึษานอกสถานที่”\nTo explore Thai social, cultural and intellectual backgrounds from the old days (known as the\nKingdom of Siam) until today. To emphasize the formation of the Thai identity as well as directions\ntowards the development of Thai culture and society in the globalization context. (Field trips are\nobligatory)\n32 ศศ.104 พัฒนาการของโลกสมัยใหม่ 3 (3-0-6)\nLAS 104 Development of the Modern World\nพัฒนาการของสังคมโลก ตงั้ แต่ค.ศ. 1500 ต้นมาจนถึงปัจจุบัน โดยเน้นความสัมพันธ์ทางด้าน\nเศรษฐกิจการเมือง การปกครอง สังคม วัฒนธรรม วิทยาศาสตร์และเทคโนโลยีอันพื้นฐานแห่งการ\nเปลี่ยนแปลงของโลกเข้าสู่สมัยใหม่\nTo study the development of world societies from 1500 A.D. to the present. An emphasis is\nplaced upon the relationship of economy, political system, administration, society, culture, science and\ntechnology, leading to modern world changes.\nศศ.105 ปรัชญาและศาสนาเพื่อความพลเมือง 3 (3-0-6)\nLAS 105 Philosophy and Religious Studies for Citizenship\nมุ่งสร้างเสริมความพลเมืองโดยเชื่อว่าปรัชญาคือการจำแนกตรรกะ การระบุการใช้เหตุผล\nผดิพลาด การวิเคราะหข์้อโต้แย้งของคนอื่น การวิเคราะหม์ โนทัศน์ และการสร้างข้อโต้แย้งที่สมเหตุผล\nสิ่งที่จำยิ่งยวดสำหรับสังคมเสรีนิยมประชาธิปไตยที่ต้องโอบรับความคิดที่หลากหลาย และพลเมือง\nจะต้องสามารถพินิจพิจารณาโต้แย้งหาเหตุผลเพื่อหาข้อสรุปในประเด็นสำคัญต่าง ๆ ร่วมกับเพื่อนพลเมอืง\nได้ ในส่วนศาสนา วิชานี้มุ่งเน้นให้นักศึกษาเข้าใจที่มา แก่นแท้พลวัตรที่ศาสนามีต่อสังคม และเรียนรู้ที่จะ\nวิพากษ์ความเข้าใจเกี่ยวกับความถูกผิดชั่วดีเพื่อเข้าใจความหลากหลายของพลเมืองคนอื่นเพื่อสามารถ\nสานสนทนากันได้อย่างมคีุณภาพ\nPhilosophy promotes citizenship. Philosophy is a discipline that explicate logic, identify\nfallacious reasoning, analyse argument, analyse concept, and make one’s own argument. These\ncognitive skills are essential for liberal democratic society which accepts plurality. Citizen must be able\nto corroboratively analyse and criticise argument in important topics. In the latter half, religious studies\nenable students to explain origin, essence, and dynamic of religions on society. It also equips students\nwith critical thinking on the plurality of good and evil. This promotes quality conversations among\ncitizens.\nปด.104 เส้นทางสคู่วามสมัยใหม่และโลกาภวิัตน์ 3 (3-0-6)\nPD 104 The Path to Modernity and Globalization\nวิชานี้ศึกษาปัจจัยต่าง ๆ ที่นำไปสู่การก่อร่างสร้างโลกสมัยใหม่ตั้งแต่ศตวรรษที่ 16 จนถึงปัจจุบัน\nสำรวจจุดเชื่อมต่อที่สำคัญที่ทำใหสั้งคมมนุษย์ดำเนินมาสู่ความสมัยใหม่ และตรวจสอบความเชื่อมโยง\nระหว่างสังคม เศรษฐกิจ การเมือง การปกครอง วัฒนธรรม วิทยาศาสตร์ และเทคโนโลยีในฐานะพื้นฐาน\nของโลกาภวิัตน์\n33 The course introduces students to forces that shaped the modern world and the development\nof a modern global society, from the sixteenth century to the present. It explores the major critical\njunctures that placed human society on a path towards modernity. It examines the linkages between\nsociety, economics, politics, administration, culture, and science and technology as the foundation for\nglobalization. Tuxxx Understanding yourself and personal development for healthcare professional\nมธ.103 ชีวติกับความยั่งยืน 3 (3-0-6)\nTU 103 Life and Sustainability\nการดำเนินชีวิตอย่างเท่าทันกับการเปลี่ยนแปลงของโลก เข้าใจความสัมพันธ์ระหว่างพลวัต ของ\nธรรมชาติมนุษย์ และสรรพสิ่ง ทั้งสิ่งแวดล้อมสรรสร้าง การใช้พลังงาน เศรษฐกิจ สังคมในความขัดแย้ง\nและการแปรเปลี่ยน ตลอดจนองค์ความรู้ทางวิทยาศาสตร์สิ่งแวดล้อม ที่นำไปสู่การปรับเปลี่ยนวิถีชีวิตสู่\nความยั่งยืน\nThis course provides an introduction to the importance of life-cycle systems perspectives in\nunderstanding major challenges and solutions to achieving more sustainable societies in this changing\nworld. Students will learn about the relationship between mankind and the environment in the context\nof energy and resource use, consumption and development, and environmental constraints.\nFurthermore, an examination of social conflict and change from the life-cycle perspective will be used\nto develop an understanding of potential solution pathways for sustainable lifestyle modifications.\nมธ.143 มนุษย์กับสิ่งแวดล้อม 3 (3-0-6)\nTU 143 Man and Environment\nพื้นฐานด้านระบบนิเวศธรรมชาติและมนุษย์สร้างขึ้น วัฎจักรชีวธรณีเคมีปฏิสัมพันธ์ระหว่างสังคม\nมนุษย์และสิ่งแวดล้อมของโลก รวมถึงผลกระทบของวิทยาศาสตร์และเทคโนโลยีที่มีต่อประชากรมนุษย์\nระบบนิเวศธรรมชาติความหลากหลายทางชีวภาพ มลพิษ การเปลี่ยนแปลงสภาพภูมิอากาศ ขยะมูลฝอย\nของเสียอันตราย และภัยพิบัติ\nFundamentals of natural and man-made ecosystem, biogeochemical cycles, interaction\nbetween human society and global environment. Topics include the impacts of science and technology\non human population, natural ecosystems, biodiversity, pollution, Climate change, solid and hazardous\nwaste and disaster\nมธ.151 คณิตศาสตร์ทั่วไประดับมหาวิทยาลัย 3 (3-0-6)\nTU 151 General College Mathematics\n(ไม่นับหน่วยกิตให้กับนักศึกษาที่มีรหัสคณะ 02, 04, และตั้งแต่ 09 ถึง 14, 16, 17, 18) เซต ระบบ\nจำนวนจริง ความสัมพันธ์ ฟังก์ชันและการประยุกต์ ความรู้เบื้องต้นของกำหนดการเชิงเส้น ตรรกศาสตร์\n34 การคำนวณดอกเบี้ย เงินผ่อนรายงวดและภาษีเงินได้สถิติเชิงพรรณนา เลขดัชนีความน่าจะเบื้องต้น\nแนวคิดสถิติเชิงอนุมานเบือ้งตน้ โปรแกรมสำเร็จรูปทางสถิติ\n(A non-credit subject to the students’ faculty code of 02, 04 and from 09 to 14, 16, 17, 18)\nSets, the real number system, relations, functions and applications, introduction to linear\nprogramming, logic, measurement of interest, installment payment and income tax, descriptive\nstatistics, index number, introduction to probability, basic concepts of inferential statistics, statistical\npackages.\nมธ.155 สถิตพิืน้ฐาน 3 (3-0-6)\nTU 155 Elementary statistics\nลักษณะปัญหาทางสถิติทบทวนสถิติเชิงพรรณนา ความน่าจะ ตัวแปรสุ่มและการแจกแจงของ\nตัวแปรสุ่มแบบวินาม ปัวซง และปกติ เทคนิคการซักตัวอย่างและการแจกแจงของตัวสถิติการประมาณค่า\nและการทดสอบสมมติฐานเกี่ยวกับค่าเฉลี่ยประชากรกลุ่มเดียวและสองกลุ่ม การวิเคราะหค์ วามแปรปรวน\nจำแนกทางเดียว การวิเคราะหก์ารถดถอยและสหสัมพันธ์เชิงเส้นเชงิ เดียว การทดสอบไคกำลังสอง\nหมายเหตุ : ไม่นับหน่วยกิตใหผ้ทูี่กำลังศกึษา หรอืสอบได้ส.216\nThe nature of statistical problems, review of descriptive statistics, probability, random\nvariables and some probability distributions (binomial, poison and normal), elementary sampling and\nsampling distributions, estimation and hypotheses testing for one and two populations, one-way\nanalysis of variance, simple linear regression and correlation, chi-square test.\nดท.100 นวัตกรรมดิจทิัล 3 (3-0-6)\nDX 100 Digital Innovation\nเทคโนโลยีดิจิทัลร่วมสมัย แรงขับเคลื่อนในยุคดิจิทัล ธุรกิจและสังคมดิจิทัล ผู้บริโภคยุคดิจิทัล\nเศรษฐกิจดิจิทัล ผลกระทบของนวัตกรรมดิจิทัลต่อธุรกิจและสังคม\nState of the Arts Digital Technology. Digital Driving Forces. Digital Business and Society.\nDigital Consumers. Digital Economy. Impacts of Digital Innovation on Business and Society.\nมธ.108 การพัฒนาและจัดการตนเอง 3 (3-0-6)\nTU 108 Self Development and Management\nการจัดการและการปรับเข้ากับชีวิตในรั้วมหาวิทยาลัย ท่ามกลางความหลากหลายและเสรีภาพ\nการพัฒนาทักษะทางสังคมและความฉลาดทางอารมณ์ การเข้าใจตนเองและการวางแผนอนาคต การ\nพัฒนาบุคลิกภาพและมารยาททางสังคม การเรียนรู้ตลอดชีวิต การอยู่ร่วมกับผู้อื่นอย่างสงบสุขและเคารพ\nซึ่งกันและกัน และการดูแลสุขภาพแบบองค์รวม\n35 Coping with and adaptation to university life. Development of social skill and emotional\nintelligence. Self-understanding and planning for the future. Personality and social etiquette. Lifelong\nlearning. Learning to live harmoniously and respectfully with others and the society. Holistic\nhealthcare.\nมธ.201 ความรทู้างการเงินสำหรับบุคคล 3 (3-0-6)\nTU 201 Financial Literacy for individuals\nเรียนรู้พื้นฐาน หลักการ ความสำคัญและแนวทางวางแผนการเงินเพื่อเป้าหมายชีวิต การใช้\nเครื่องมือทางการเงิน รวมทั้งเทคนิคต่าง ๆ ประกอบด้วย เทคนิคการค้นหาตนเอง เทคนิคการวางแผน\nการเงินทั้ง รู้หา รู้เก็บ รู้ใช้ และรู้ขยายดอกผล เทคนิคการจัดสรรเงนิออมและการลงทุนแบบ DCA เทคนิค\nบริหารจัดการหนี้ เทคนิคการเพิ่มเงินออม เทคนิคในการวางแผนประหยัดภาษีเงินได้บุคคลธรรมดา\nตลอดจนหลักการและความสำคัญของปรัชญาเศรษฐกิจพอเพียงต่อสังคมไทย เพื่อน้อมนำมาประยุกต์ใช้\nในการดำรงชีวติ\nTo learn the foundations, principles, importance and guidelines of financial planning for life\ngoals, the uses of financial instruments, together with self-discovery techniques, financial planning\ntechniques including how to earn, collect, use and invest money, savings allocation and DCA\ninvestment techniques, debt management techniques, savings increase techniques, personal income\ntax saving planning techniques as well as the principles and importance of the Sufficiency Economy\nPhilosophy in Thai society in order to be applied in living.\nสษ.115 การส่อืสารทางภาษาอังกฤษเพื่ออาชีพ 3 (3-0-6)\nEL 115 English Communication for Careers\nพัฒนาทักษะทางภาษาและการสื่อสารเพื่ออาชีพ กลวิธีการนำเสนอ การสร้างเครือข่าย การชักจูง\nการประชุม การประชาสัมพันธ์ และการเจรจาต่อรอง ศึกษาวิธีปฏิบัติทางสังคมและทางธุรกิจอย่างมือ\nอาชีพ\nDevelopment of language and communication skills for careers. Strategies for presentations,\nnetworking, persuading, meetings, public relations, and negotiations. Study of social and business\netiquette in professional contexts.\nมธ.240 เศรษฐกิจภูมิรัฐศาสตร์โลก 3 (3-0-6)\nTU 240 World Geopolitical Economy\nศึกษาความสัมพันธ์ระหว่างภูมิรัฐศาสตร์ เศรษฐกิจ ความสัมพันธ์ระหว่างประเทศในภูมิภาค\nเศรษฐกิจโลก ปัญหาภูมิรัฐศาสตร์ มหาอำนาจทางเศรษฐกิจ ความขัดแย้งระหว่างประเทศ และนโยบาย\n36 ทางเศรษฐกิจและการเมืองของมหาอำนาจที่มีอิทธิพลต่อประเทศต่าง ๆ เช่น การใช้นโยบายซอฟท์พาว\nเวอร์ นโยบายการลงโทษทางสังคม ต้น\nA study of the Relationship between Geopolitics, Economy, Relations between Countries in the\nRegion, World Economy, Geopolitical Problems. Economic Superpower, International Conflict and the\nEconomic and Political Policies of the Great Powers that Influence Countries such as using Soft Power\nPolicy, Social Sanction and etc.\nมธ.243 ทักษะดิจติอลเพื่ออนาคต 3 (3-0-6)\nTU 243 Digital Skills for the Future\nเรียนรู้ทักษะการใช้เทคโนโลยีดิจิทัล การรู้และใช้สื่อ (Media literacy) ทักษะในการใช้เทคโนโลยี\nเพื่อการตดิต่อ สื่อสาร เพื่อการทำงานร่วมกัน (Communications and collaboration) ทักษะความสามารถใน\nการใช้ดิจทิัลเสริมกับอาชีพแหง่ตน จัดการดูแลอัตลักษณ์ความตัวตนในโลกไซเบอร์ (Career & Identity\nmanagement) ทักษะการใช้เทคโนโลยีดิจิทัล (Digital literacy) เข้าใจเทคโนโลยีดิจิทัลพื้นฐาน ใช้อุปกรณ์\nทางด้านดิจิทัลได้ทักษะการใช้ดิจิทัลเพื่อการเรียนรู้ (Learning skills) ทักษะการใช้ข้อมูลข่าวสารเพื่อ\nประโยชน์เชิงวิชาการ (Digital scholarship) และทักษะการใชข้อมูลข่าวสาร (Information literacy)\nLearn Digital Technology Skills, Media Literacy, Skills in using Technology for Communication\nfor Collaboration (Communications and collaboration), Digital Skills to Support their Career (Career and\nIdentity Management), Digital Literacy, Understand Basic Digital Technology, able to use Digital\nDevices, Digital Skills for Academic and Information Literacy.\nลศ.209 ความรพูื้น้ฐานด้านนวัตกรรมสังคม และการประกอบธุรกิจเพื่อสังคม 3 (3-0-6)\nGS 209 Foundations of Social Innovation and Social Entrepreneurship\nทำความเข้าใจเกี่ยวกับโลกคดีศึกษาด้วยมุมมองแบบสหวิทยาการ เพื่อขับเคลื่อนกิจกรรมของ\nผู้ประกอบการและนักนวัตกรทางสังคมไปสู่บริบทของเศรษฐกิจและสังคมที่ใหญ่ขึ้น วิเคราะห์ประเด็น\nปัญหาทางสังคมผ่านทฤษฎีและมุมมองที่หลากหลาย เช่น ปัญหาความไม่เท่าเทียม ความเสื่อมถอยของ\nสิ่งแวดล้อม การอพยพย้ายถิ่นฐานเพื่อการทำงาน ต้น ทฤษฎีต่าง ๆ จะตัวชว่ยในการตีความปัญหา\nรวมถึงค้นหาวิธีการแก้ไข ผู้เรียนจะได้เรียนรู้ประสิทธิภาพและผลลัพธ์ของการใช้นวัตกรรมทางสังคมผ่าน\nการศกึษาธุรกิจทางสังคมดว้ยแนวคิดและทฤษฎีที่แตกต่างกัน\nThis course provides an introduction to the trans-disciplinary field of Global Studies in order to\nput the place-based activities of social entrepreneurs and social innovators in a bigger socioeconomic\ncontext. Global issues-such as social inequalities, environmental degradation, transnational migration\netc, - will be analyzed through different theoretical perspectives. Each theoretical perspective on\ndevelopment provides a distinct interpretation of these problems and ways to solve them. Viewing the\n37 work of social entrepreneurs through these different lenses will enable students to appreciate the\neffectiveness and potential impact of social innovations on society.\nมธ.431 การเรียนรจู้ากการสร้างสตาร์ทอัพของตนเอง 15 (0-45-45)\nTU 431 Learning through Own Startup\nเรียนรู้ผ่านการลงมือปฏิบัติแบบเดี่ยว หรือกลุ่ม โดยทำงานร่วมกับอาจารย์ที่ปรึกษา หรือภายใต้\nการกำกับดูแลของอาจารย์ที่ปรึกษา เพื่อสร้างธุรกิจด้วยนวัตกรรม โดยมีผลลัพธ์หลัก 2 ประการ คือ 1)\nสามารถระดมทุนจากหน่วยงานรัฐ เอกชน หรือหน่วยงานระหว่างประเทศได้สำเร็จ และ 2) สามารถสร้าง\nรายได้ที่รูปธรรม โดยมีหลักฐานที่ตัวบ่งชีว่าธุรกิจจะสามารถสร้างรายได้อย่างตอ่ เนื่องในอนาคต\nExperiential learning, as an individual or a team under supervision of an academic advisor, to\ncreate a startup that delivers an innovative solution to the market. To earn this course’s credits, the\nstartups must meet two criteria; successful fund raising from a trustworthy organization and making\nrepeatable sales.\n2) วิชาเฉพาะ\n2.1) วิชาแกน\nร.210 ปรัชญาการเมอืงเบือ้งตน้ 3 (3-0-6)\nPO210 Introduction to Political Philosophy\nที่มาและความหมายของวิชาปรัชญาการเมืองตลอดจนประเด็นที่สำคัญ ๆ ในปรัชญาการเมือง เช่น\nอะไรคือจุดมุ่งหมายปลายทางของมนุษย์ จุดหมายของรัฐ ความยุติธรรม ฯลฯ โดยจะแยกแยะให้เห็นข้อ\nแตกต่างระหว่างการมองปัญหาและการแก้ปัญหาของปรัชญาการเมือง ความคิดและปรัชญาการเมือง\nสมัยใหม่นักศึกษาจะต้องศึกษาผลงานของนักปรัชญาตะวันตกและตะวันออก เพื่อใช้แนวทางใน\nการศกึษาวิชาอื่น ๆ ต่อไป\nOrigins and meaning of political philosophy and important issues in political philosophy such as\nthe goal of humanity, the state, justice etc., by dividing and examining the differences between\nproblems and solutions in political philosophy as well as modern political thought. Students will study\nthe work of both Western and Eastern philosophers as groundwork for further courses.\nร.211 ความรเู้บือ้งตน้ทางรัฐศาสตร์ 3 (3-0-6)\nPO211 Introduction to Political Science\nธรรมชาติและวิธีการของรัฐศาสตร์ ความสัมพันธ์ระหว่างรัฐศาสตร์กับศาสตร์ทางสังคมอื่น ๆ\nขอบเขตการศึกษาจะครอบคลุมถึงทฤษฎีต่าง ๆ ทางรัฐศาสตร์ และหลักการเกี่ยวกับอำนาจ การใช้อำนาจ\nความสัมพันธ์ระหว่างรัฐกับบุคคล สถาบันการเมือง การปกครอง พลังทางการเมือง กระบวนการเมืองและ\nประชาคมนานาชาติด้วย\n38 Nature and methods of political science, the relationship between political science and other\nsocial sciences. The course will cover various political theories, principles or power and its application,\nthe relationship between the state and private individuals, political institutions, government, political\npower, political movements and international bodies.\nร.241 ความรเู้บือ้งตน้ทางบริหารรัฐกิจ 3 (3-0-6)\nPO241 Introduction to Public Administration\nความหมาย ทฤษฎี แนวความคิด และขอบข่ายของการบริหารรัฐกิจ วิวัฒนาการของวิชาการ\nบริหารรัฐกิจและการบริหารธุรกิจ การบริหารกับสภาพแวดล้อมการเมืองและการบริหาร กระบวนการ\nการบริหาร นโยบายสาธารณะ ประเภทองค์การภาครัฐ การบริหารทรัพยากรบุคคลภาครัฐ การคลังและ\nงบประมาณ และ การกำกับการตรวจสอบการบริหารภาครัฐ และจรยิธรรมของนักบริหาร\nMeaning, theory, concepts and scope of public administration; academic development of public\nand business administration, management and the political and administrative climate, the\nadministrative process, public policy, types of public sector organisations, personnel management in\nstate organisations, treasury and budgeting, as well as supervision and inspection of state\nadministration and administrative ethics.\nร.271 ความรเู้บือ้งตน้ทางความสัมพันธ์ระหว่างประเทศ 3 (3-0-6)\nPO271 Introduction to International Relations\nพื้นฐานของการเมืองระหว่างประเทศ ธรรมชาติ และโครงสร้างของระบบการระหว่างประเทศ\nปัจจัยทางด้านการเมือง ทหาร เศรษฐกิจ สังคม วัฒนธรรม ตลอดจนอุดมการณ์ที่มีผลต่อแนวพฤติกรรม\nของรัฐ เครื่องมือที่ใช้ในการดำเนินความสัมพันธ์ระหว่างรัฐ ตลอดจนพัฒนาการความร่วมมือระหว่าง\nประเทศในรูปต่าง ๆ เช่น ระเบียบปฏิบัติกฎหมาย และสถาบันระหว่างประเทศ อันผลจากและต่อ\nปัจจัยดังกล่าว\nFoundations of international politics; the nature and structure of international relations; political,\nmilitary, economic, social and cultural factors as well as ideologies which impact on state behaviour;\ndevelopment of international cooperation in its different forms, such as practice regulations, laws and\ninternational institutions resulting from and affecting the above factors.\nร.300 วิธีวิทยาทางสังคมศาสตร์ 3 (3-0-6)\nPO300 Social Science Methodology\nวิชาบังคับก่อน : สอบได้วชิา ร.211\nวิธีการหาความรู้และวิจัยทางสังคมศาสตร์ ทั้งการวิจัยเชิงปริมาณและการวิจัยเชิงคุณภาพ โดย\nครอบคลุมการสร้างแนวความคิด ประเด็นปัญหา การตั้งสมมติฐาน การวิเคราะห์ และรายงานผลการวิจัย\n39 การตีความตัวบท การวิเคราะห์ภาษา รวมตลอดถึงแนววิเคราะห์ในวิธีการหาความรู้แบบอื่น ๆ ที่ใช้กันอยู่\nในแวดวงการวจิัยสังคมศาสตร์ในปัจจุบัน\nPrerequisites: Have earned credits of PO 211\nMethods of data collection and research in social sciences, both quantitative and qualitative\nresearch, including building a research concept, a research question, formulating hypotheses /\nassumptions, analysis and reporting results, interpretation of theories, language analysis and other\nmethods of analysis and information searches currently used in social sciences.\nร.321 การเมอืงการปกครองของไทย 3 (3-0-6)\nPO 321 Thai Government and Politics\nวิชาบังคับก่อน : สอบได้วชิา ร.211\nปัจจัยต่าง ๆ ที่เกี่ยวข้องกับการเมืองการปกครองของไทย เช่น ประวัติศาสตร์ โครงสร้างสังคม\nวัฒนธรรม เศรษฐกิจและการเมืองไทย ลักษณะและแนวโน้มของชีวิตการเมืองของไทย ลักษณะเฉพาะ\nพฤติกรรมการเมือง ต้น วิเคราะห์สัมพันธภาพระหว่างชีวิตการเมืองกับปัจจัยทางสังคมและเศรษฐกิจ\nสำรวจปัญหาทางการเมอืงการปกครองในยุคของการเปลี่ยนแปลงตามปัจจัยเหล่านี้\nPrerequisites: Have earned credits of PO 211\nFactors involved in Thai politics and government such as history, social structure, culture,\neconomy and Thai politics; characteristics and trends of Thai political life; characteristics of political\nbehaviour; analysis of the relationship between political life and socioeconomic factors; examination of\nproblems in politics and government in the age of change affected by the above factors.\nร.380 พัฒนาการเศรษฐกิจและการเมอืงโลก 3 (3-0-6)\nPO 380 The Evolution of the Global Political Economy\nวิชาบังคับก่อน : สอบได้วชิา ร.271\nศกึษาทฤษฎีสำคัญด้านเศรษฐกิจการเมืองระหว่างประเทศ พัฒนาการ ของเศรษฐกิจการเมืองโลก\nตั้งแตส่มัยอาณานิคมจนถึงปัจจุบัน โดยใหค้วามสำคัญกับปฏิสัมพันธ์ระหว่างเศรษฐกิจกับการเมอืงที่ส่งผล\nซึ่งกันและกัน โดยเน้นศกึษาประเด็นและเหตุการณ์สำคัญในเศรษฐกิจ การเมืองโลกแต่ละยุค รวมถึงวิกฤต\nเศรษฐกิจต่าง ๆ\nPrerequisites: Have earned credits of PO 271\nStudies important theories in International Political Economy (IPE) and political and economic\ndevelopments since the colonial period until the present. The course stresses the interaction between\neconomics and politics with an emphasis on significant issues and phenomena in global political\neconomy, including economic crises, in different periods.\n40 2.2) วิชาเฉพาะสาขา\n2.2.1) สาขาการเมืองการปกครอง\nร.212 ประวัติความคิดทางการเมืองเบือ้งตน้ 3 (3-0-6)\nPO 212 Introduction to History of Political Thoughts\nความคิดทางการเมอืงของนักปราชญ์ของโลกในอดีต ทั้งตะวันตกและตะวันออก เชน่ เพลโต\nอาริสโตเติล มาคิอาเวลลีรุสโซ เบอร์ก มาร์กซ์ เอ็งเก็ลส์ โกญทัญญะ คานธี เมาเซตุง โฮจมินห์ ฯลฯ\nPolitical thought of past Western and Eastern philosophers from around the world, such as\nPlato, Aristotle, Machiavelli, Rousseau, Burke, Marx, Engels, Kondanya, Gandhi, Mao Tse Tung, Ho\nChi Minh and others.\nร.221 พรรคการเมือง กลุ่มผลประโยชน์ และการเลือกตั้ง 3 (3-0-6)\nPO 221 Political Parties, Interest Groups and Elections\nแนวคิดและแนววิเคราะห์เรื่อง พรรคการเมือง กลุ่มผลประโยชน์ และการเลือกตั้ง รวมทั้ง\nความสัมพันธ์ระหว่างสถาบันการเมืองดังกล่าว และความสัมพันธ์กับสถาบันและกระบวนการทางการเมอืง\nที่สำคัญอื่น ๆ โดยการนำขอบเขตและลักษณะของการศึกษาดังกล่าวของต่างประเทศ โดยเฉพาะประเทศ\nประชาธิปไตยตะวันตกมาประยุกต์ในเชิงเปรียบเทียบกับสถาบันดังกล่าวของไทยด้วย\nConcepts and analysis of political parties, interest groups and elections, as well as the\nrelationship between the above political institutions and their connection with other significant political\ninstitutions and movements. This will be done by applying the scope and characteristics of\ninternational case studies, particularly Western democracies, for comparison with Thai political\ninstitutions.\nร.222 พลวัตการเมืองท้องถิ่น 3 (3-0-6)\nPO 222 Dynamics of Local Politics\nศึกษาท้องถิ่นใน 3 มิติ ได้แก่ 1) องค์กรปกครองส่วนท้องถิ่นในฐานะที่ส่วนหนึ่งของระบบ\nราชการซึ่งทำหน้าที่จัดบริการสาธารณะให้กับประชาชนในระดับท้องถิ่น 2) พื้นที่ชนบทซึ่งกำลังกลาย\nเมืองอันจะส่งผลต่อการเปลี่ยนแปลงในหลากหลายมิติ เช่น ลักษณะทางประชากร วิถีชีวิตของประชาชน\nและลักษณะพื้นที่ทางกายภาพ ทำให้เมืองมีความต้องการประเภทบริการสาธารณะ และการบริหารจัด\nการเมืองที่ตอบสนองต่อการเปลี่ยนแปลงดังกล่าว และ 3) การเมืองและความสัมพันธ์ทางอำนาจใน\nท้องถิ่นความสัมพันธ์ระหว่างนักการเมือง ภาคธุรกิจ ภาคประชาสังคม ผู้เลือกตั้ง หรือแม้แต่ผู้มีอิทธิพล\nซึ่งเปลี่ยนแปลงไปตามการเปลี่ยนแปลงของโครงสร้างทางการเมอืง และเศรษฐกิจ\nStudy on three dimensions of the local; 1) Local Authority as government agency who provides\npublic services for local people. 2) Urbanization of provincial area that result in several changes of the\ncity, such as demographics, way of life and landscape. These changes require new type of public\nservices and different approach of management. 3) Politics and power relations within the local;\n41 including relationships among local politicians, business, civil society, voters, or even local influential\npersons which affected by the change of political and economic structure.\nร.224 พืน้ฐานทางเศรษฐกิจและสังคมของการเมอืงการปกครองไทย 3 (3-0-6)\nPO 224 Economic and Social Ecology of Thai Government and Politics\nลักษณะและโครงสร้างทางเศรษฐกิจ สังคม และการเมืองของประเทศไทย โดยมุ่งปูพื้นฐานความ\nเข้าใจต่อระบบการเมืองการปกครองของไทยสำคัญ ศึกษาความสัมพันธ์ระหว่างปัจจัยเศรษฐกิจ\nสังคม การเมือง รวมทั้งคำนึงถึงพื้นฐานทางประวัติศาสตร์ วัฒนธรรม และระบบความคิดความเชื่อด้วย\nตลอดจนศึกษากระบวนการเปลี่ยนแปลงของสังคมไทยนับแต่อดีตจนถึงปัจจุบัน และผลกระทบของการ\nเปลี่ยนแปลงดังกล่าวที่มตี่อรูปแบบและโครงสร้างทางการเมอืงดว้ย\nCharacteristics and structure of Thai economy, society and politics, focusing on the basics of\nThai political and government structure. The course will look at the relationship between economic,\nsocial and political factors and consider the underlying history, culture and belief system, as well as\nmovements for change in Thai society from the past to the present. Also considered is the effect of\nthese changes on political form and structure.\nร.304 พฤติกรรมการเมือง ความคิดเห็นสาธารณะ และจติวิทยา 3 (3-0-6)\nPO 304 Political Behavior, Public Opinion, and Psychology\nวิชาบังคับก่อน : สอบได้วชิา ร.211\nพฤติกรรมทางการเมืองของบุคคลในสังคม เช่น การเลือกระบบการเมือง ความสัมพันธ์ระหว่าง\nบุคคลกับรัฐบาล ทัศนคติของรัฐบาลที่มีต่อประชาชนและที่ประชาชนมีต่อรัฐบาล การลงคะแนนเสียง\nเลือกตั้งของผู้นำประเทศ ทั้งนีโ้ดยใช้ทฤษฎีเกี่ยวกับสิ่งกำหนดพฤติกรรมของมนุษย์จากวิชาสังคมวิทยาและ\nจติวิทยามาเครื่องอธิบาย\nPrerequisites: Have earned credits of PO 211\nPolitical behavior of people in society, such as choosing a political system, relationships\nbetween individuals and governments, citizens’ attitudes toward governments and vice versa, and\ncitizens’ voting behavior. These behaviors will be explained by applying human behavior theory from\nsociology and psychology.\nร.307 ทฤษฎีการเมืองแนวสตรีนยิม 3 (3-0-6)\nPO307 Feminist Political Theory\nวิชาบังคับก่อน : สอบได้วชิา ร.211\nลักษณะและฐานคติของแนวพินิจต่าง ๆ ของสตรีนิยม ประเด็นโต้เถียงและการเคลื่อนไหวทาง\nสังคม-การเมอืง และการเปลี่ยนแปลงของสตรนีิยม\n42 Prerequisites: Have earned credits of PO 211\nFoundations of various approaches, debates, political activism, and changes in Feminism\nร.309 ทุน ธุรกิจกับการเมอืง 3 (3-0-6)\nPO 309 Capital, Business and Politics\nวิชาบังคับก่อน : สอบได้วชิา ร.211\nศึกษาความสัมพันธ์ระหว่างทุน ธุรกิจ กับการเมือง ครอบคลุมในประเด็นบทบาทของรัฐในการ\nพัฒนา และบทบาทและอิทธิพลของกลุ่มทุนและภาคธุรกิจทั้งภายในและข้ามชาติที่มีต่อกระบวนการทาง\nการเมือง และนโยบายสาธารณะของสถาบันการเมืองและองค์กรของรัฐ เช่น พรรคการเมือง รัฐสภา\nรัฐบาล และระบบราชการ\nPrerequisite: Have earned credits of PO 211\nStudy on relations among capital, business and politics including, the role of state in\ndevelopment and the influence of private sector, domestic and transnational, on political institutions’\nactivities which affect political process and public policy.\nร.311 ขบวนการเคลื่อนไหวทางสังคมกับพืน้ที่ทางการเมอืง 3 (3-0-6)\nPO 311 Social Movements and Political Space\nวิชาบังคับก่อน : สอบได้วชิา ร.211\nศึกษาแนวคิดทฤษฎีและพัฒนาการของขบวนการเคลื่อนไหวทางสังคมที่เกิดขึ้นตั้งแต่อดีตถึง\nปัจจุบันทั้งในสังคมไทยและต่างประเทศ อาทิขบวนการสิทธิสตรีขบวนการแรงงาน ขบวนการด้าน\nสิ่งแวดล้อม ขบวนการของคนพื้นเมืองดั้งเดิม ขบวนการสันติภาพ ขบวนการสิทธิพลเมือง ขบวนการ\nนักศึกษา ขบวนการต่อต้านโลกาภิวัตน์ ขบวนการเรียกร้องสิทธิความหลากหลายทางเพศ ขบวนการ\nอนุรักษ์นิยมฝ่ายขวา ฯลฯ เพื่อให้เห็นถึงสาเหตุ การก่อกำเนิด และผลกระทบที่ขบวนการเหล่านี้มีต่อ\nระบอบการเมือง กระบวนการทางการเมือง และการจัดความสัมพันธ์ทางอำนาจในสังคม นอกจากนั้นยัง\nศกึษายุทธศาสตร์ ยุทธวิธี และพื้นที่การเคลื่อนไหวอันหลากหลายที่ขบวนการต่างๆ นำมาใช้ในการดำเนิน\nกิจกรรมเพื่อบรรลุเป้าหมายทางการเมือง เช่น การชุมนุมประท้วง การต่อสู้เชิงสัญลักษณ์ การใช้พื้นที่\nออนไลน์และสื่อสังคม ฯลฯ\nPrerequisite: Have earned credits of PO 211\nThis course studies theories, concepts, and development of social movements in Thailand and\nelsewhere since the past to the present, for example, women movements, labor movements,\nenvironmental movements, native rights movements, peace movements, civil rights movements,\nstudent movements, anti-globalization movement, LGBT movement, right-wing, conservative\nmovements. It investigates origins, causes, and consequences of social movements on political\nregimes, processes, and power relations. In addition, it aims to understand various kinds of strategies,\n43 methods, and spaces used by movements to mobilize resource and support to achieve their political\ngoals, e.g. protests, symbolic politics, and social media and online politics.\nร.312 การเมอืงกับกฎหมายมหาชน 3 (3-0-6)\nPO 312 Politics and Public Law\nวิชาบังคับก่อน : สอบได้วชิา ร.211\nศึกษาถึงระบบกฎหมายมหาชนที่มีความเกี่ยวโยงกับการเมือง ทั้งเรื่องของพัฒนาการของระบบ\nกฎหมายมหาชนในระดับสากลและพัฒนาการของกฎหมายมหาชนในประเทศไทย โดยเฉพาะอย่างยิ่ง\nปฏิสัมพันธ์ซี่งระบบกฎหมายมหาชนมีต่อการเมืองการปกครองของไทยในภาพรวม ขอบเขตอำนาจหน้าที่\nและกระบวนการในทางกฎหมายที่ส่งผลต่อการดำเนินงานทางปกครองทั้งในเรื่องของโครงสร้างการ\nบริหารราชการและกระบวนการในการบริหารราชการที่กำหนดไว้ในรัฐธรรมนูญ การดำเนินงานของ\nภาครัฐ องค์กรอิสระและองค์กรอื่นตามรัฐธรรมนูญ รวมถึงเน้นการศึกษาในเรื่องของหลักนิติรัฐ\nกระบวนการในการแบ่งแยกอำนาจ การถ่วงดุลและการตรวจสอบการใช้อำนาจของรัฐ อีกทั้งในเรื่องของ\nสิทธิเสรีภาพและกระบวนการในการมสี่วนรว่มของประชาชนในทางการเมือง\nPrerequisite: Have earned credits of PO 211\nThis module studies about the system of public law that is interlinked with politics with\ncoverage over both its development in Thailand and worldwide. In particular, this module gives special\nemphasis to the interaction that the legal system has with the overall government and politics of\nThailand, the jurisdiction and process of law that affects governmental implementation at the levels of\nthe administrative structure of the bureaucracy and its administrative process as provided by the\nconstitution as well as to the study of the legal state, the process involved in the separation of\npowers, the checks and balances needed to circumscribe the exercise of state power including the\nissue of rights and the political participation of citizens.\nร.314 ประวัติความคิดทางการเมืองไทย 3 (3-0-6)\nPO 314 History of Thai Political Thoughts\nวิชาบังคับก่อน : สอบได้วชิา ร.210\nแนวความคิดทางการเมืองของรัฐบุรุษและนักคิดไทยที่สำคัญ ๆ ในสมัยต่าง ๆ ตั้งแต่สมัยกรุง\nสุโขทัยจนถึงต้นรัตนโกสินทร์ โดยจะการศึกษาจากหลักฐานที่ปรากฏอยู่ในเอกสารต่าง ๆ เช่น ศิลา\nจารึกหลักต่าง ๆ ไตรภูมิพระร่วง และวรรณกรรมต่าง ๆ ของยุค ตลอดจนกฎหมาย พระราชพิธีประเพณี\nเพื่อแนวทางสำหรับการเข้าใจผลของการเปลี่ยนแปลงทางความคิดทางการเมืองที่ปรากฏชัดขึน้ ในสมัย\nต่อ ๆ มา จวบจนถึงสมัยเปลี่ยนแปลงการปกครองเม่อืปีพ.ศ. 2475\n44 Prerequisites: Have earned credits of PO 210\nPolitical thought of prominent Thai statesmen and thinkers in different eras from the Sukhothai\nto the Rattanakosin periods by means of studying various documented evidence such as stone\ninscriptions, the Three Worlds of King Ruang and folklore from each era, as well as laws, royal\nceremonies and traditions. This will serve as a means to understanding the effects of clearly visible\nchanges in political thought in consequent periods, leading up to the 1932 revolution.\nร.315 ปรัชญาสงครามและสันติภาพ 3 (3-0-6)\nPO 315 Philosophy of War and Peace\nวิชาบังคับก่อน : สอบได้วชิา ร.210\nแนวความคิดของนักคิดคนสำคัญ ๆ ในอดีตที่พูดถึงปัญหาสงครามและสันติภาพ ต้นว่า Kant,\nMarx และ Engles, Von Clausewitz, James, Tolstoy, Gandhi โดยจะนำบทความปรัชญาของนักคิดเหล่านี้\nมาวิเคราะห์ดูแนวความคิดเกี่ยวกับสงครามและสันติภาพ เพื่อแนวทางเข้าใจปรัชญาเบื้องต้นของการ\nสงครามปัจจุบัน ตลอดจนแนวความคิดเร่อืงสงครามที่ธรรมและอธรรมด้วย (Just and Unjust War)\nPrerequisites: Have earned credits of PO 210\nConcepts of important philosophers in history who dealt with the matter of war and peace,\nsuch as Kant, Marx and Engels, Von Clausewitz, James, Tolstoy and Gandhi. The course will analyse\nworks by these people as to their perspectives on war and peace to understand the basic philosophy\nof war in the present day, as well as the concept of just and unjust war.\nร.319 ทฤษฎีการเมืองว่าด้วยเสรีนยิมและประชาธิปไตย 3 (3-0-6)\nPO 319 Liberal and Democratic Theories\nวิชาบังคับก่อน : สอบได้วชิา ร.211\nวิชานี้ชักชวนให้นักศึกษาพิจารณาความตึงเครียดระหว่างเสรีนิยมและประชาธิปไตยที่มีมาแต่\nยาวนาน โดยให้นักศึกษาย้อนกลับไปดูประวัติความมาของทั้งสองซึ่งมีประเพณีความคิดทางการเมือง\nรองรับที่แตกต่างกันโดยสิ้นเชิง นักคิดเช่น อาริสโตเติล รุซโซ และต๊อควิลล์ โดนจัดอยู่ในประเพณีความคิด\nที่รองรับประชาธิปไตย ส่วนนักคิดเช่น ล็อค ค็องสต็อง และสจ๊วตมิลล์ โดนจัดอยู่ในประเพณีความคิดที่\nรองรับเสรินิยม เมื่อได้ทำการพิจารณาในข้างต้น วิชานี้ต้องการกระตุ้นให้นักศึกษาไตร่ตรองว่าความตึง\nเครียดที่มีอยู่ใช่เรื่องที่อันจะดีได้หรือไม่ และถ้าได้มีทฤษฎีว่าด้วยเสรีนิยมและประชาธิปไตยใดที่เมื่อ\nผนึกด้วยกันสามารถรากฐานให้กับระบอบการเมืองที่ทั้งไปได้และเหมาะสมสำหรับสถานการณ์\nปัจจุบัน ภายใต้บริบทเชน่ โลกาภวิัฒน์ของกระแสเสรีนิยมใหม่ และการกลับมาของกระแสประชานิยม\nPrerequisites: Have earned credits of PO 211\nThe module looks at how the current state of technology has affected the political landscape\nof societies of all shapes and sizes. In particular, it looks at how recent advancements in information\n45 and digital technology have played a vital role in shaping the identities of people, as well as in\ninforming new ways in which political participation can be organised. Conversely, it also wishes to\naddress the various ways in which the state has appropriated technological change to further its own\nends. Some of the central questions we are encouraged to take up are how will all this alter the\nrelationship between state and society, and what special significance, if any, does all this have on the\nfuture of democracy\nร.320 การเมอืงการปกครองเปรียบเทียบ 3 (3-0-6)\nPO 320 Comparative Politics and Government\nวิชาบังคับก่อน : สอบได้วชิา ร.211\nแนวคิด ทฤษฎี และข้อถกเถียงในสาขาวิชาย่อยว่าด้วยการเมืองการปกครองเปรียบเทียบ\nโดยพิจารณาผ่านกรณีศึกษาจากประเทศต่าง ๆ รวมทั้งประเด็นปัญหาซึ่งกำลังที่สนใจในวงการ\nรัฐศาสตร์ ณ เวลานั้น เพื่อทำความเข้าใจธรรมชาติของระบบการเมือง พัฒนาการของรัฐ พลวัตและ\nเสถียรภาพทางการเมือง ความประชาธิปไตย ความขัดแย้งในสังคม นโยบายสาธารณะ พฤติกรรม\nทางการเมอืง ฯลฯ\nPrerequisites: Have earned credits of PO 211\nExamine concepts, theories, and arguments from the sub-field of comparative politics and\ngovernment through case studies from various countries and issues of interest to political scientists at\nthe time in order to understand the nature of political systems, the development of the state, political\ndynamics and stability, democracy, social conflicts, public policies, political behaviour, and so on.\nร.322 สถาบันการเมอืงและรัฐธรรมนูญ 3 (3-0-6)\nPO 322 Political Institutions and Constitutions\nวิชาบังคับก่อน : สอบได้วชิา ร.211\nวัตถุประสงค์ของกฎหมายรัฐธรรมนูญและการสถาปนารัฐธรรมนูญประเภทต่าง ๆ เน้นทำความ\nเข้าใจ อำนาจอธิปไตยการปกครองแบบประชาธิปไตย การมีสภานิติบัญญัติสภาเดียวหรือสองสภา การ\nแบ่งอำนาจและรูปของรัฐบาลต่าง ๆ ที่สืบเนื่องมาจากการแบ่งอำนาจ ความกฎหมายสูงสุดของ\nรัฐธรรมนูญ สิทธิและเสรีภาพของบุคคล นอกจากนั้นยังจะศึกษาถึงการจัดตั้งองค์การปกครองตาม\nรัฐธรรมนูญของประเทศไทยที่มีมาแล้ว รวมทั้งสถาบันพระมหากษัตริย์ คณะรัฐมนตรีรัฐสภา การดำเนิน\nและวิธีปฏิบัติงานของรัฐสภา การบัญญัติกฎหมาย ความเกี่ยวพันระหว่างคณะรัฐมนตรีกับรัฐสภา ศาล\nและตุลาการรัฐธรรมนูญ ศาลพิเศษ และองค์การอ่นื ๆ\nPrerequisites: Have earned credits of PO 211\nObjectives of constitutional law and the establishment of various constitutions, focusing on\nunderstanding democratic power and government, the issue of having one legislative assembly or\n46 two, power sharing and different forms of government arising from power sharing, the status of the\nconstitution as being the highest legal authority, rights and freedoms of individuals. In addition, the\ncourse will study the establishment of governing bodies in accordance with the constitution occurring\nin Thailand in the past, as well as the monarchy, the cabinet and parliament, parliamentary\nprocedures and operations, lawmaking and the relationship between the cabinet and parliament, the\ncourts and constitutional judiciary, special courts and other organisations.\nร.323 การเมอืงว่าด้วยการพัฒนา 3 (3-0-6)\nPO 323 Politics of Development\nวิชาบังคับก่อน : สอบได้วชิา ร.211\nแนวคิด และทฤษฎีทางเศรษฐศาสตร์การเมืองที่พยายามทำความเข้าใจการพัฒนา ทั้งในแง่\nกระบวนการกำหนดนโยบายสาธารณะ บทบาทของภาครัฐ เสถียรภาพทางการเมือง การเจริญ เติบโตทาง\nเศรษฐกิจ การกระจายรายได้ โครงสร้างชนชั้นในสังคม กลไกตลาด ความสัมพันธ์ทางเศรษฐกิจระหว่าง\nประเทศ ตลอดจนปัญหา และผลพวงทั้งหลายที่ตดิตามมากับการพัฒนา โดยมีการนำกรณีศึกษาที่โดดเด่น\nจากประเทศต่าง ๆ มาประกอบการวิเคราะห์\nPrerequisites: Have earned credits of PO 211\nPolitical-economic concepts and theories that seek to understand development in terms of\npublic policy, the role of the state, political stability, economic growth, income distribution, the class\nstructure within a society, the market mechanism, international economic relations, as well as\nproblems and consequences resulting from development. Insightful case studies from a variety of\ncountries are also examined.\nร.326 การเมอืงการปกครองตะวันออกกลาง 3 (3-0-6)\nPO 326 Politics and Government of the Middle East\nวิชาบังคับก่อน : สอบได้วชิา ร.211\nแนวความคิด พฤติกรรมทางการเมือง สถาบันการเมือง การจัดระเบียบการปกครอง อิสลาม\nการเมืองและการเปลี่ยนแปลงระบบการปกครอง รวมทั้งการศึกษาเปรียบเทียบความสัมพันธ์และ\nผลกระทบต่อการเมืองระหว่างประเทศ เศรษฐกิจและสังคมของประเทศนั้น ๆ ตลอดจนปัญหาในการ\nพัฒนาการลักษณะทางสังคมวทิยาของกลุ่มประเทศตะวันออกกลาง\nPrerequisites: Have earned credits of PO 211\nConcepts, political behavior and institutions, drafting of regulations for government, political\nIslam and governmental change, as well as comparative studies of the relationship with and effect on\ninternational politics, economy and society in the countries concerned. The course also deals with the\nsocial development problems characteristic of the Middle East.\n47 ร.327 การเมอืงการปกครองเอเชยี ใต้ 3 (3-0-6)\nPO 327 Politics and Government of South Asian Countries\nวิชาบังคับก่อน : สอบได้วชิา ร.211\nแนวความคิดและพฤติกรรมทางการเมือง สถาบันทางการเมือง การจัดระเบียบการปกครอง\nรวมทั้ง ความยุ่งยากซับซ้อนของศาสนา ชาติพันธุ์ของกลุ่มประเทศเอเชยี ใต้\nPrerequisites: Have earned credits of PO 211\nConcepts, political behaviour and institutions and drafting of regulations for government, along\nwith religious and ethnographic complexity in south Asian countries.\nร.330 การเมอืงการปกครองเอเชยีตะวันออกเฉียงใต้ 3 (3-0-6)\nPO 330 Politics and Government of Southeast Asia\nวิชาบังคับก่อน : สอบได้วชิา ร.211\nประวัติศาสตร์และภาพรวมของระบบการเมืองการปกครองของประเทศต่าง ๆ ในภูมิภาคเอเชีย\nตะวันออกเฉียงใต้ โดยเน้นการตกอาณานิคม สงครามโลกครั้งที่ 2 สงครามเย็น และช่วงหลังสิ้นสุด\nสงครามเย็น นักศึกษาจะได้ศึกษาและวิเคราะห์ถึงสภาพการเมือง เศรษฐกิจ และสังคมที่มีผลต่อ\nความสัมพันธ์ระหว่างประเทศ\nPrerequisites: Have earned credits of PO 211\nMethods of data collection and research in social sciences, both quantitative and qualitative\nresearch, including building a research concept, a research question, formulating hypotheses /\nassumptions, analysis and reporting results, interpretation of theories, language analysis and other\nmethods of analysis and information searches currently used in social sciences.\nร.333 การเมอืงการปกครองเอเชยีตะวันออก 3 (3-0-6)\nPO 333 East Asian Politics and Government\nวิชาบังคับก่อน : วิชา ร.211\nโครงสร้างรัฐ รูปแบบการปกครอง ระบบการเมือง ตลอดจนสภาพเศรษฐกิจสังคมของประเทศใน\nภูมิภาคเอเชียตะวันออก ไม่ว่าจีน ไต้หวัน ญี่ปุ่น เกาลีใต้ เกาหลีเหนือ หรือมองโกเลีย โดยให้ความสำคัญ\nกับประวัติศาสตร์ พลวัตทางการเมือง และเง่อืนไขทางสังคมนับตั้งแต่หลังสงครามโลกครั้งที่ 2 ต้นมา\nตลอดจนบรรดาประเด็น หรอืปัญหำร่วมสมัยทางการเมือง ทั้งในระดับชาติ และระดับภูมิภาค ที่กำลังได้รับ\nความสนใจ\nPrerequisites: Have earned credits of PO 211\nState structures, government forms, political regimes, and socio-economic settings of countries\nin the region of East Asia, ranging from China, Taiwan, South Korea, North Korea, to Mongolia. The\n48 focus will be on history, political dynamics, and social conditions since World War II, as well as\ncontemporary political issues or problems of interest both at the national and regional levels.\nร.336 การเมอืงการปกครองพหุอเมรกิา 3 (3-0-6)\nPO 336 Politics and Government of Americas\nวิชาบังคับก่อน : สอบได้วชิา ร.211\nศึกษาพลวัตทางการเมืองการปกครองทั้งในระบบและนอกระบบการเมืองของประเทศใดประเทศ\nหนึ่งในพหุทวีปอเมริกา ไม่ว่าจะ อเมริกาเหนือ อเมริกากลาง หรือ อเมริกาใต้ โดย: ก) พิจารณาปัจจัย\nทางประวัติศาสตร์ สังคม เศรษฐกิจ และวัฒนธรรม ข) วิเคราะห์สถาบันพืน้ฐานในทางการเมืองและบรรดา\nพลังต่าง ๆ ที่มอีิทธิพลต่อกิจกรรมทางการเมอืงของสังคมการเมอืงนนั้ ๆ\nPrerequisites: Have earned credits of PO 211\nThis module studies about the dynamics of politics and government both within and without\nthe political system of a specific country in the Americas—may it be North America, Central America\nor South America—by A) taking into account historical, social, economic as well as cultural factors and\nB) analysing basic political institutions as well as other forces that are at work in influencing the\npolitical activities of the political society in question.\nร.337 การเมอืงการปกครองยุโรป 3 (3-0-6)\nPO 337 Politics and Government of Europe\nวิชาบังคับก่อน : สอบได้วชิา ร.211\nศกึษาแนวความคิด วัฒนธรรม และพฤติกรรมทางการเมอืง สถาบันการเมือง การจัดระเบียบการ\nปกครอง รูปของรัฐบาล องค์กรแห่งอำนาจ รวมทั้งการเปรียบเทียบกับความสัมพันธ์และผลกระทบต่อ\nการเมืองระหว่างประเทศ เศรษฐกิจและสังคมของประเทศนั้น ๆ (ตลอดจนปัญหาในการพัฒนาการ\nลักษณะทางสังคมวทิยาของกลุ่มประเทศยุโรปตะวันตกและตะวันออก)\nPrerequisites: Have earned credits of PO 211\nThis course studies the concept, culture and political behaviour and institutions, drafting of\ngovernmental regulations, forms of government, power organisations as well as comparison with\nrelationships with and effects on international politics and the economy and society of those countries.\nIn addition, the course will also look at the social development problems in western and eastern\nEuropean countries.\n49 ร.403 สัมมนา : ภาษากับการเมอืง 3 (3-0-6)\nPO 403 Seminar : Language and Politics\nวิชาบังคับก่อน : สอบได้วชิา ร.211\nภาษาอันเครื่องมือที่จำของมนุษย์ในฐานะสัตว์การเมือง โดยมุ่งพิจารณาความสำคัญทาง\nการเมืองของภาษา ตลอดจนการใช้ภาษาในความหมายที่กว้างที่สุด คือรวมถึงสัญลักษณ์ และพิธีกรรม\nหลากหลายที่สามารถนำมาใช้ในกระบวนการสื่อสารทางการเมือง เช่น ภาษาพิธีการ ภาษาที่ใช้สำหรับการ\nโฆษณาชวนเช่อืศัพท์บัญญัติและศัพท์ที่แปลมาจากภาษาต่างประเทศ ฯลฯ\nPrerequisites: Have earned credits of PO 211\nLanguage as a necessary tool for humans as political animals, focusing on the political\nimportance of language as well as the use of language in the broadest term possible, including\nvarious symbols and rituals that may be utilised in the process of political communication, such as\nceremonial language, propaganda language, jargon and terms translated from foreign languages etc.\nร.404 สมัมนา : ศาสนากับการเมือง 3 (3-0-6)\nPO 404 Seminar : Religion and Politics\nวิชาบังคับก่อน : สอบได้วชิา ร.211\nแนวความคิดทางปรัชญาสังคมการเมืองในศาสนาหลักของโลก อันได้แก่พุทธคริสต์ อิสลามและ\nฮินดู โดยมุ่งจะเข้าใจ “การเมือง” ที่มองจากทัศนะของศาสนาเหล่านี้สังคมในอุดมคติของศาสนาเหล่านี้\nวิธีการไปถึงสังคมในอุดมคตินั้น ๆ ซึ่งคงหมายรวมถึงการพิเคราะห์ การใช้ความรุนแรงในศาสนาต่าง ๆ\nวิธีการทางการเมือง และศาสนา ในเชิงความสัมพันธ์กับความรุนแรงเชิงโครงสร้างด้วยการศึกษา\nประเด็นเหล่านีจ้ะเน้นพิจารณาความสัมพันธ์ระหว่างศาสนา และการเมอืงในประเทศไทยด้วย\nPrerequisites: Have earned credits of PO 211\nPhilosophical, social and political concepts in the world’s main religions, i.e. Buddhism,\nChristianity, Islam and Hinduism, focusing on understanding ‘politics’ from the viewpoints of these\nreligions, ideal societies according to these religions, ways to make those ideal societies, which may\nmean the consideration of using violence in various religions as a political tool, as well as the\nrelationship of religion with structural violence through education. These issues will also place\nemphasise the relationship between religion and politics in Thailand.\n50 ร.405 สัมมนา : การเมอืงและนวนยิาย 3 (3-0-6)\nPO 405 Seminar : Politics and Novels\nวิชาบังคับก่อน : สอบได้วชิา ร.211\nตั้งคำถามกับความหมายทาง “การเมอืง” ที่ปรากฏอยู่อย่างชัดเจน หรอือย่างคลุมเครือใน\nนวนิยายเรื่องต่าง ๆ ทั้งนี้โดยมีสมมติฐานเบื้องต้นว่า นวนิยายไม่เพียงจะภาพสะท้อนของสังคมเท่านั้น\nหากยังทำหน้าที่ทาง การเมืองในการ “รักษา” หรือ “เปลี่ยนแปลง” ระเบียบทางสังคมด้วย นอกจาก\nจุดเน้นที่เนื้อหาของนวนิยาย เช่น ในเรื่องปัญหาความไม่ยุติธรรมในสังคม ความขัดแย้งทางความเชื่อทาง\nการเมอืงหรอืสังคมประกิตทางการเมืองแล้วยังจะได้พิจารณาวิธีการต่าง ๆ ที่จะใช้ “เข้าใจ” นวนิยาย\nนั้น ๆ ด้วย ต้นว่า วิธีการแบบโครงสร้างนิยม (Structuralism) หรือแนวทางเน้นทางการตีความ\n(Hermeneutics) ต้น\nPrerequisites: Have earned credits of PO 211\nThis seminar addresses the question of the meaning of ‘politics’ as clearly or loosely defined in\nvarious novels, with the basic assumption that novels not only reflect society, but also serve to\npreserve or change social norms. The seminar also looks at novels’ main themes, such as social\ninjustice, conflicts in political beliefs or political socialisation, and considers different methods used to\nunderstand those novels, such as structuralism and hermeneutics.\nร.406 การเมอืงของเพศสภาพและเพศวิถี 3 (3-0-6)\nPO 406 Politics of Gender and Sexuality\nวิชาบังคับก่อน : สอบได้วชิา ร.211\nการกำกับควบคุมเพศสภาพและเพศวิถีในระบบสองเพศสภาพ การขัดขืน-ต่อรอง และการโต้เถียง\nทางการเมืองในประเด็นต่าง ๆ ว่าด้วยเพศสภาพและเพศวิถี เช่น การยุติการตั้งครรภ์ จินตนาการทางเพศ\nและการซื้อ-ขายบริการทางเพศ\nPrerequisites: Have earned credits of PO 211\nControl and regulationof gender and sexuality in the binary gender system. Negotiation and\npolitical contestation on various issues regarding gender and sexuality - such as abortion, sexual\nfantasy, and commercial sex\nร.408 รัฐและสังคม 3 (3-0-6)\nPO 408 State and Society\nวิชานี้ศึกษาครอบคลุมประเด็นปัญหาสำคัญว่าด้วยความสัมพันธ์ระหว่างรัฐกับสังคมในโลก\nสมัยใหม่ โดยสำรวจทฤษฎีที่ว่าด้วยรัฐและสังคมของนักคิดหลากหลายสำนักตั้งแต่อดีตจนถึงปัจจุบัน\nนอกจากนั้นยังศึกษาแนวคิดสำคัญ อาทิการสร้างรัฐ การสร้างชาติชาตินิยม การพัฒนา ประชาธิปไตย\n51 และสิทธิ เนื้อหาจะครอบคลุมถึงพัฒนาทางประวัติศาสตร์ของความสัมพันธ์ระหว่างรัฐและสังคมที่\nเปลี่ยนไปตั้งแต่ยุคก่อนอาณานิคมยุคอาณานิคม และยุคหลังอาณานิคม โดยมีกรณีศกึษาเปรียบเทียบจาก\nหลากหลายภูมภิาคตั้งแตล่ำตนิอเมริกา แอฟริกา ยุโรป ตะวันออกกลาง และเอเชีย\nThis course explores an enduring issues of state-society relations in the modern world. The\ncourse examines classical and cutting-edge theories on state-society relations developed by thinkers\nin many schools of thoughts since the past to the present. Also, it studies key concepts whose\nunderstanding is important to any understanding of state-society relations, e.g., state-building,\nnation-building, nationalism, development, democracy, and rights. Part of the course is organized\nhistorically, beginning from pre- colonial and colonial states to post-colonial world. The empirical\ncontent will come from various regions, ranging from Latin American, Africa, Europe, the Middle\nEast, and Asia.\nร.409 ประชาธิปไตยและการพัฒนาประชาธิปไตย 3 (3-0-6)\nPO 409 Democracy and Democratisation\nวิชานี้ศึกษาเปรียบเทียบความเหมือนและความแตกต่างของระบอบการเมืองแบบต่าง ๆ ทั้งที่\nประชาธิปไตยและระบอบที่ไม่ใช่ประชาธิปไตย เกณฑ์ที่ใช้การจัดจำแนกและข้อถกเถียงของการจัดประเภท\nระบอบการเมือง ศึกษาเปรียบเทียบระบอบประชาธิปไตยและระบอบที่ไม่ใช่ประชาธิปไตยรูปแบบต่าง ๆ ที่\nเคยเกิดขึ้นและดำรงอยู่ทั้งในอดีตและปัจจุบันว่ามีลักษณะสำคัญอย่างไรและมีการจัดรูปแบบสถาบัน\nการเมืองและความสัมพันธ์ทางอำนาจแตกต่างกันอย่างไร ศึกษาปัจจัยและแบบแผนของการเกิดขึ้น การ\nเปลี่ยนผ่านและการทำให้ประชาธิปไตยยั่งยืนและคงทน รวมทั้งปัจจัยที่นำไปสู่การถดถอยและการล้มลง\nของประชาธิปไตย ระบอบการเมอืงแบบผสม ประชาธิปไตยที่มีคุณศัพท์ และศึกษาความท้าทายในรูปแบบ\nใหม่ ๆ ที่มตี่อระบอบประชาธิปไตยในโลกปัจจุบัน\nThis course studies the similarities and differences of regime types, both democratic and non-\ndemocratic regimes, by examining the criteria of regime classification and related debates. It focuses\non a comparative study of democratic and non-democratic regimes since the past to the present by\nlooking at main characteristics, institutional arrangements, and power relations. In addition, it gives\nspecial focus on main as well as cutting edge topics regarding democracy and democratization,\nranging from causes, pattern of development, democratic transition, democratic consolidation,\ndemocratic recession and breakdown, hybrid regimes, democracy with adjectives, and challenges of\ndemocracy in the contemporary world.\n52 ร.412 ทฤษฎีว่าด้วยสังคมและการเมอืง 3 (3-0-6)\nPO 412 Theories on Society and Politics\nวิชาบังคับก่อน : สอบได้วชิา ร.211\nความสัมพันธ์ระหว่างโครงสร้างทางเศรษฐกิจ สังคม และการเมือง บทบาทและพฤติกรรมทางการ\nเมืองของชนชั้นและกลุ่มต่าง ๆ ในสังคม อำนาจ การใช้อำนาจ และความขัดแย้งในเรื่องอำนาจและ\nผลประโยชน์ ตลอดจนวิเคราะห์สังคมและการเมืองโดยใช้ทฤษฎีว่าด้วยสังคมและการเมืองของนักคิด\nสำคัญ ๆ\nPrerequisites: Have earned credits of PO 211\nRelationship between economic, social and political structures; role and political behaviour of\ndifferent social classes and groups; power and its use; conflicts of power and interest and analysis of\nsociety and politics using social and political theories of famous philosophers.\nร. 414 สัมมนาแนวความคิดทางการเมืองไทย 3 (3-0-6)\nPO 414 Seminar on Thai Political Thoughts\nวิชาบังคับก่อน : สอบได้วชิา ร.210\nลักษณะหรือปัญหาเฉพาะของสิ่งที่เรียกว่า แนวความคิดทางการเมืองไทย โดยอาจเลือกพิจารณา\nประเด็นที่เกี่ยวข้องกับอิทธิพลของวัฒนธรรมเดิมที่ก่อให้เกิดแนวคิดทางการเมืองไทย อิทธิพลของ\nแนวความคิดทางการเมืองตะวันตกที่มีต่อความคิดทางการเมืองไทย ตลอดจนแนวคิดทางการเมืองของนักคิด\nคนสำคัญ ๆ ของไทยในอดีตและปัจจุบัน\nPrerequisites: Have earned credits of PO 210\nThis seminar deals with the characteristics and problems unique to Thai political concepts by\nselecting to consider issues relating to cultural influences leading to Thai political concepts; the\ninfluence of Western political concepts on Thai political thought and political thought of prominent Thai\nphilosophers from the past to the present.\nร.415 สัมมนา : ความรุนแรงและสันติวธิี 3 (3-0-6)\nPO 415 Seminar: Violence and Nonviolence\nวิชาบังคับก่อน : สอบได้วชิา ร.211\nปัญหาความรุนแรงในทางการเมืองในทางตรงและความรุนแรงในเชิงโครงสร้าง โดยมุ่งจะคิดค้น\nและนำเสนอวิธีการแก้ไขปัญหาทางการเมืองโดยใช้ความไม่รุนแรงหลัก วิชานี้มุ่งที่จะแนะนำให้\nนักศกึษาคุ้นเคยกับตำราวิชาการทางการเมอืงแบบไม่ใช้ความรุนแรง ศึกษาถึงชีวิตของบุคคลซึ่งใช้ความไม่\nรุนแรงเครื่องมือทางการเมือง เหตุการณ์ที่คู่ต่อสู้ทางการเมืองใช้ความไม่รุนแรง เงื่อนไขทางทฤษฎีที่\nสนับสนุนการใชค้วามไม่รุนแรง ตลอดจนแนวความคิดทางจรยิธรรมที่สนับสนุนการใชค้วามไม่รุนแรง\nPrerequisites: Have earned credits of PO 211\n53 The problem of direct and structural violence in politics, focusing on nonviolent methods of\nsolving political problems. This seminar emphasizes advising students to familiarize themselves with\nacademic texts in the political field which advocate nonviolence and to study the lives of people who\nhave used nonviolence as a political tool. Also studied are events where political opponents have\nused nonviolence, theoretical conditions that support nonviolence and ethical concepts that support\nnonviolence.\nร.416 สัมมนา : ประเด็นปัญหาปรัชญาการเมอืง 3 (3-0-6)\nPO 416 Seminar on Problems in Political Philosophy\nวิชาบังคับก่อน : สอบได้วชิา ร.210\nศึกษาปัญหาในทางปรัชญาการเมือง เช่น อำนาจคืออะไร การเมืองคืออะไร ความยุติธรรมคือ\nอะไร ชีวิตที่ดีอย่างไร และสังคมการเมืองที่ดีอย่างไร ต้น โดยศึกษางานเขียนของเมธีทาง\nการเมือง เมืองท่านใดท่านหนึ่ง จากยุคกรีก ยุคโรมัน ยุคกลาง ยุคฟื้นฟูศิลปวิทยาการ หรือ ยุคเรือง\nปัญญา จนถึงนิทเช่วิชานี้เลือกนำงานเขียนที่สำคัญบางส่วนของเมธีนั้น ๆ มาศึกษาตัวบทอย่างละเอียด\nโดยให้ความสำคัญกับ ก) บริบททางปรัชญาการเมืองก่อนยุคของเมธีท่านนั้น ข) บริบททางประวัติศาสตร์\nทั้งก่อนและในช่วงเวลาของเมธีท่านนั้น และ ค) คุณูปการที่แนวความคิดของเมธีท่านนั้นมีต่อความคิดทาง\nการเมอืงในยุคต่อ ๆ มา ทั้งหมดนโี้ดยชีใ้ห้เห็นความแตกต่างพื้นฐานระหว่าง \"ปรัชญาการเมือง\" กับ \"ทฤษฎี\nการเมอืง\" ด้วย\nPrerequisites: Have earned credits of PO 210\nThis module studies about the problems in political philosophy such as what is power, what is\npolitics, what is justice, what is the good life and what is a good political society like by examining the\nworks of one of the great political thinkers from either the Greek, Roman, Medieval, Renaissance or\nthe Enlightenment period up until Nietzsche. This module selects some of the important works of the\nchosen thinker for detailed textual analysis whilst giving importance to A) the philosophical setting\nbefore the time of the chosen thinker, B) the historical context both before and during the time of the\nchosen thinker and C) the contribution that his/her ideas have towards political thought in subsequent\nperiods. All this also serves to point out the fundamental differences between “political philosophy”\nand “political theory”.\n54 ร.418 กฎหมายปกครอง 3 (3-0-6)\nPO 418 Administrative Law\nวิชาบังคับก่อน : สอบได้วชิา ร.211\nหลักและลักษณะพื้นฐานสำคัญของกฎหมายปกครอง โครงสร้างของฝ่ายปกครอง หน่วยงานทาง\nปกครอง หลักทั่วไปในการจัดระเบียบบริหารราชการแผน่ดิน การจัดทำบริการสาธารณะ รัฐวิสาหกิจ และ\nการแปรรูปรัฐวิสาหกิจ การกระทำทางปกครอง การควบคุมฝ่ายปกครอง และศาลปกครอง\nPrerequisites: Have earned credits of PO 211\nBasic main principles and characteristics of administrative law; administrative structure;\nadministrative units; general principles of laying down administrative and governmental regulations;\nsetup of public services and state enterprises; privatization of state enterprises; administrative actions;\nsupervision of administration and the administrative court.\nร.424 สัมมนาปัญหาการเมืองการปกครองของไทย 3 (3-0-6)\nPO 424 Seminar on Problems of Political and Government of Thailand\nวิชาบังคับก่อน : สอบได้วชิา ร.321\nการศกึษาประเด็นปัญหาทางรัฐศาสตร์ร่วมสมัย โดยอาศัยคำอธิบายทางทฤษฎีและทางปฏิบัติและ\nแนวศึกษาวิเคราะห์ทางรัฐศาสตร์และศาสตร์อื่น ๆ ที่เกี่ยวข้อง เพื่อให้ได้ข้อเสนอแนวทางแก้ไขปัญหาของ\nกระแสความคิดทางรัฐศาสตร์ร่วมสมัยและเพื่อสร้างองค์ความรู้ใหม่ทางรัฐศาสตร์โดยบูรณาการจากสห\nสาขาวิชา\nPrerequisites: Have earned credits of PO 321\nAn examination of contemporary problems in a study of political science. This course will apply\ntheoretical and practical explanations from political science studies and other relevant studies to\nexplain and find solutions to contemporary political problems and to acquire new knowledge of political\nscience by the methodology of integration of knowledge and ideas from multidisciplinary studies.\nร.425 สัมมนาปัญหาในทางรัฐศาสตร์ 3 (3-0-6)\nPO 425 Seminar on Problems in Politics Science\nสัมมนาหัวข้อที่เกี่ยวกับ \"การเมืองการปกครอง\" ตามที่ผสู้อนเห็นสมควร เช่น รัฐธรรมนูญ สถาบัน\nทางการเมือง การเมืองนอกระบบ การเมืองแบบที่ไม่มีรัฐศูนย์กลาง หรือ การเมืองกับระบบนิเวศน์\nต้น\nSeminar on an issue of interest of each instructor under the rubric of \"politics and\ngovernment.\" This seminar could be on constitution, political institution, politics outside the political\nsystem, non-statist politics, or politics and ecosystem etc.\n55 ร.426 สัมมนาทฤษฎีเกี่ยวกับการเมอืงการปกครองเปรียบเทียบ 3 (3-0-6)\nPO 426 Concepts and Theories on Comparative Politics\nวิชาบังคับก่อน : สอบได้วชิา ร.320\nแนวความคิดและทฤษฎีทางรัฐศาสตร์กระแสหลักในปัจจุบันที่ใช้ในการวิเคราะหเ์ ปรียบเทียบระบบ\nการเมือง กระบวนการทางการเมือง พลวัตทางการเมือง และการเปลี่ยนแปลงทางการเมือง เช่น แนว\nวิเคราะห์แบบระบบ แนววิเคราะห์โครงสร้างหน้าที่ความทันสมัยและพัฒนาการทางการเมือง\nกระบวนการสังคมประกิตทางการเมืองและวัฒนธรรมทางการเมือง ต้น นอกจากนี้จะการศึกษา\nกรอบการวิเคราะห์อื่น ๆ ตามที่ผู้สอนเห็นสมควร เช่น เรื่องชนชั้นนำ อำนาจ กระบวนการตัดสินใจ\nตลอดจนบทวิจารณ์ของกลุ่มนักวิชาการที่มีความคิดตรงข้ามกับพวกกระแสหลักด้วย รวมทั้งพิจารณาแนว\nวิเคราะห์ใหม่ ๆ เรื่องการพึ่งพิงเศรษฐศาสตร์ การเมือง รัฐ ต้น ทั้งนี้การประยุกต์ใช้แนววิเคราะห์\nเหล่านีใ้นการศกึษาปรากฏการณ์ทางการเมืองในประเทศต่าง ๆ ตลอดจนพิจารณาข้อจำกัดและข้อวิจารณ์\nต่อแนววิเคราะหนั์้น ๆ ด้วย\nPrerequisites: Have earned credits of PO 320\nConcepts and theories of current mainstream political science used in comparing political\nsystems, political movements, political dynamics and political change, for example systemic analysis,\nanalysis of structure and responsibilities, topicality and political development, political socializationand\npolitical culture. The course also looks at other analytical frameworks as seen fit by the instructor,\nsuch as the elite, power, the decision making process and critiques by academics whose views\ncontradict the mainstream, as well as considers new analytical methods dependent on economics,\npolitics and the state. The course aims to apply these analytical methods to political phenomena in\ndifferent countries as well as consider the limitations and criticisms of those methods.\nร.427 การเมอืงเชิงชาติพันธุ์และวัฒนธรรม 3 (3-0-6)\nPO 427 Ethnicity Politics and Culture\nวิชาบังคับก่อน : สอบได้วชิา ร.211\nพลวัตความขัดแย้งระหว่างรัฐและกลุ่มชาตพิันธุ์ในภูมิภาคต่าง ๆ โดยจะศกึษาถึงทฤษฎีและแนวคิด\nต่าง ๆ เพื่อนำไปวิเคราะหก์ รณีศกึษาของความขัดแย้งทางกลุ่มชาตพิันธุ์\nPrerequisites: Have earned credits of PO 211\nDynamics of conflict between states and ethnic groups in Southeast Asia; study of different\ntheories and concepts to analyse case studies of ethnic conflicts.\n56 ร.428 สัมมนาทหารและการเมอืง 3 (3-0-6)\nPO 428 Seminar on Military and Politics\nวิชาบังคับก่อน : สอบได้วชิา ร.211\nบทบาทของสถาบันทหารในการพัฒนาสังคม เศรษฐกิจและการเมืองของประเทศ หรือกลุ่ม\nประเทศใด ประเทศในเอเชีย อาฟริกา ลาตนิอเมริกา ตามแตผ่สู้อนจะเสนอ\nPrerequisites: Have earned credits of PO 211\nRole of the military in social, economic and political development in one or a group of Asian,\nAfrican and Latin American countries, as seen fit by the instructor.\nร.434 สัมมนาปัญหาทฤษฎีการเมืองกับปัญหาร่วมสมัย 3 (3-0-6)\nPO 434 Seminar on Political Theory and Contemporary Problems\nวิชาบังคับก่อน : สอบได้วิชา ร.210\nสัมมนานี้เกี่ยวกับทฤษฎีการเมืองสำหรับสังคมการเมืองร่วมสมัย โดยเน้นเร่อืงการลดชอ่งว่าง\nระหว่างทฤษฎี (theory) กับการปฏิบัติ (practice) สัมมนานีต้องการพิจารณาวิคราะหเ์ พื่อปรับทฤษฎี\nรวมถึงอธิบายและหาทางแก้ไขความบกพร่องทางการเมอืงที่อยู่ในปัจจุบัน ไม่ว่าจะปัญหาคอรัปชั่น\nการโฆษณาชวนเช่อื และการเมืองแบบรุนแรง\nPrerequisites: Have earned credits of PO 210\nThe seminar is on political theory for contemporary society and politics. By grounding political\ntheory in real world social and political problems, it hopes to reduce the gap between theory and\npractice. While due consideration will be given to the adjustment and modification of theory, equally\nimportant is devising explanations and solutions for currently existing faults and problems in political\npractice, such as the problem of corruption, faulty propaganda and violent politics.\nร.438 หลักและระเบียบทางราชการไทย 3 (3-0-6)\nPO 438 Principles and Regulations of the Thai Civil Service\nวิชาบังคับก่อน: สอบได้วชิา ร.211\nหลักการ ตลอดจนระเบียบกฎเกณฑ์ทั้งหลายที่มีความสำคัญต่อข้าราชการไทยโดยตรง อาทิ\nระเบียบบริหารราชการแผ่นดิน ระเบียบข้าราชการพลเรือน ความรับผิดทางละเมิดของเจ้าหน้าที่วิธี\nพิจารณาความอาญา แผนพัฒนาเศรษฐกิจและสังคมแหง่ชาติกฎหมายพยานหลักฐาน ฯลฯ เพื่อใหผู้เรียน\nได้ทำความเข้าใจธรรมชาติพื้นฐานของวชิาชีพ และลักษณะการทำงานของระบบราชการไทย\nPrerequisites: Have earned credits of PO 210\nAll principles and regulations that are essential to Thai civil servants, such as the National\nGovernment Organisation Act, the Civil Service Act, the liability for wrongful act committed by officials,\n57 the criminal procedure, the National Economic and Social Development Plan, the law of evidence, etc.\nThe purpose is to provide students with a knowledge of the basic nature of the profession as well as\nthe function of the Thai civil service system.\nร.439 เทคโนโลยีกับการเมอืง 3 (3-0-6)\nPO 439 Technology and Politics\nถ้าในคริสต์ศตวรรษที่ 20 การปฏิวัติยิ่งใหญ่ของโลกคือ การปฏิวัติรัสเซีย (ค.ศ. 1917) และการ\nปฏิวัติจีน (ค.ศ.1949) กล่าวได้ว่าการปฏิวัติที่ยิ่งใหญ่แห่งคริสต์ศตวรรษที่ 21 นี้คือ การปฏิวัติเทคโนโลยี\nจนกระทั่งในปัจจุบันมีแขนงวิชาใหม่ที่เรียกว่า STS (Science and Technology Studies ที่ John F. Kennedy\nSchool of Government มหาวิทยาลัยฮาร์วาร์ด) วิชานี้มุ่งพิจารณาความสัมพันธ์สองทางระหว่างการเมือง\nกับเทคโนโลยีทั้งกระบวนการที่การเมืองส่งผลให้เทคโนโลยี่ปรากฏและแพร่หลายไปทั่ว และทั้งผลกระทบ\nของเทคโนโลยีที่มีต่อการเมือง/การบริหารจัดการ (politics and governance) ทั้งในทางที่คุณและ\nโทษ เช่น กล้อง cctv ที่ติดตั้งอยู่ทั่วไป ซึ่งทางหนึ่งก็ช่วยให้รัฐทำหน้าที่ประกันความมั่นคงปลอดภัยของ\nสังคมได้มาก แต่อีกทางหนึ่งก็เพิ่มอำนาจของรัฐผ่านการเฝ้าดูพลเมือง ซึ่งส่งผลลิดรอนเสรีภาพส่วนบุคคล\nไปในเวลาเดียวกัน คำถามสำคัญในวิชาคือ เทคโนโลยีเปลี่ยนแปลงสัมพันธภาพทางอำนาจระหว่างรัฐกับ\nสังคม ระหว่างรัฐและพลเมือง ตลอดจนระหว่างพลเมืองด้วยกันในรัฐอย่างไร? นักศึกษาจะได้พิจารณา\nปัญหาในคริสตศตวรรษที่ 21 เช่น ปัญหาการเปลี่ยนแปลงสภาพอากาศของโลก อิทธิพลเศรษฐกิจ\nการเมอืงดิจติัล การต่อสเู้สริมสร้างประชาธิปไตย (democratization) ในยุคสมัยที่เทคโนโลยีสื่อสารขยายตัว\nไปทั่วโลก โดยมุ่งแสวงหาหนทางเข้าใจกระบวนการที่เทคโนโลยีอาจจะช่วยให้คนในสังคมการเมือง\nกลายพลเมืองที่รอบรู้ข้อมูลสร้างความเข้มแข็งทางสังคม ขณะที่หาหนทางให้รัฐใช้อำนาจใหม่ ๆ ได้\nอย่างมคีวามพรอ้มรับผดิ\nIt is believed that the greatest revolutions of the twentieth century were the Russian\nRevolution (1917) and the Chinese Revolution (1949). But in the twenty-first century, it is arguably\nthe technological revolution. A new field of study-STS (Science and Technology Studies) has recently\nemerged (e.g. STS at the John F. Kennedy School of Government, Harvard University). This course\naims to explore two-way relationship between technology and politics underscoring both the ways in\nwhich politics foster a rise in technology and how technology impacts, negatively and positively, upon\npolitics and governance. For example how the surveillance system (cctv) works to strengthen the\nstate’s capability to secure people’s safety, while at the same time curtails their liberty and constrains\ntheir privacy will be examined. The course’s main question is: how the twenty-first century\ntechnology has altered power relations between state and society, between state and peoples, and\namong peoples themselves. Students will be encouraged to explore contemporary problems such as\nclimate change, digital political economy, cyber democratization in a world marked with immensely\nsophisticated communication technology. The course also seeks to find ways to understand how\n58 technology could help strengthen civil society through cultivating informed citizenship while\nengendering accountable state power.\nร.519 การวิจัยของแตล่ะบุคคลภายใต้การแนะนำเกี่ยวกับกระบวนทัศนท์างรัฐศาสตร์ 3 (2-2-5)\nPO 519 Directed Individual Research in Political Science Approaches\nวิชาบังคับก่อน :สอบได้วชิา ร.210\nการวิจัยอิสระเรื่องใดเรื่องหนึ่งที่นักศึกษาแต่ละคนได้เลือกภายใต้การควบคุมแนะนำของอาจารย์ที่\nปรึกษา โดยเร่อืงที่ศึกษาจะต้องมีความเกี่ยวข้องกับทฤษฎี แนวคิด กระบวนทัศน์ หรอืวิธีวิจัยทางรัฐศาสตร์\nและได้รับความยินยอมจากอาจารย์ที่ปรึกษา\nPrerequisites: Have earned credits of PO 210\nIndependent study conducted by individual students under the guidance of a supervisor. The\ntopic chosen must be related to theories, concepts, approaches, or research methods in political\nscience and agreed upon by the supervisor.\nร.523 การฝึกงานทางการเมืองการปกครอง 3 (0-6-3)\nPO 523 Internship in Politics and Government\nวิชาบังคับก่อน : นักศกึษาปีที่ 3 ขึน้ ไป\nส่งเสริมให้นักศึกษามีความรู้ความเข้าใจเกี่ยวกับการเมืองการปกครอง และประชาสังคม สามารถ\nนำความรู้ไปประยุกต์ใช้ในสภาพการทำงานที่แท้จริง โดยให้นักศึกษาได้เข้าฝึกงานในส่วนราชการ\nรัฐวิสาหกิจ หรือหน่วยงานเอกชน งานพัฒนาชุมชน ที่เกี่ยวข้องในประเด็นต่าง ๆ ซึ่งอาจารย์ผู้สอนกำหนด\nไว้ทั้งนี้ เพื่อการฝึกทักษะและสร้างประสบการณ์ในการทำงานรว่มกับบุคคลอื่น ๆ\nPrerequisites: Students must be in their 3rd year of study upwards\nStudents are encouraged to develop knowledge and understanding of politics, government\nand civil society with the aim of applying this knowledge to real life work. Students will carry out field\nwork in government offices, state enterprises or private organisations or community development\nrelating to various issues as determined by the instructor. The aim is to practise skills and build\nexperience in working with others.\nร.539 การวิจัยของแตล่ะบุคคลภายใต้การแนะนำเกี่ยวกับประเด็นทางรัฐศาสตร์ 3 (2-2-5)\nPO 539 Directed Individual Research in Politics Science Issues\nวิชาบังคับก่อน : สอบได้วชิา ร.211\nการวิจัยอิสระเรื่องใดเรื่องหนึ่งที่นักศึกษาแต่ละคนได้เลือกภายใต้การควบคุมแนะนำของอาจารย์ที่\nปรึกษา โดยเรื่องที่ศึกษาจะต้องมคีวามเกี่ยวข้องกับประเด็น หรอืปัญหาทางด้านรัฐศาสตร์ และได้รับความ\nยินยอมจากอาจารย์ที่ปรึกษา\n59 Prerequisites: Have earned credits of PO 211\nIndependent study conducted by individual students under the guidance of a supervisor. The\ntopic chosen must be related to issues or problems in political science and agreed upon by the\nsupervisor\n2.2.2) สาขาบริหารรัฐกิจ\nร. 242 ทฤษฎีองค์การและการจัดการ 3 (3-0-6)\nPO 242 Organization Theories and Management\nวิชาบังคบัก่อน : สอบได้วิชา ร.241\nความหมาย แนวคิด และทฤษฎีเกี่ยวกับองค์การและการจัดการ ศกึษาวิเคราะหปั์จจัยกำหนด\nการออกแบบโครงการสร้างองค์การ เชน่กลยุทธ์ ขนาด สิ่งแวดล้อม เทคโนโลยี และวัฒนธรรมองค์การ\nต้น รูปแบบการจัดโครงสร้างองค์การต่าง ๆ และการปรับกระบวนงานภายในให้สอดคล้องกับ\nภาวการณ์เปลี่ยนแปลงในปัจจุบัน\nPrerequisites: Have earned credits of PO 241\nMeaning, concept and theory of organisation and management; study and analysis of the\nfactors determining design of organizational structures, such as strategy, size, environment,\ntechnology and organizational culture; various models of organizational structures and restructuring to\nadapt to currently changing conditions.\nร.250 การวางแผนและการจัดการเชงิกลยุทธ์ในบริบทสาธารณะ 3 (3-0-6)\nPO 250 Strategic Planning and Management in Public Context\nวิชาบังคับก่อน : สอบได้วิชา ร.241\nแนวคิดเกี่ยวกับการบริหารเชิงกลยุทธ์เพื่อนำไปปรับใช้กับหน่วยงานราชการ รัฐวิสาหกิจ องค์กร\nอิสระ และองค์กรสาธารณะต่าง ๆ โดยครอบคลุมเนื้อหาเกี่ยวกับการกำหนดวิสัยทัศน์ การระบุพันธะกิจ\nขององค์การ การวิเคราะหจุ์ดอ่อน จุดแข็ง โอกาสและภาวะคุกคาม การกำหนดกลยุทธ์ที่เหมาะสม การนำ\nกลยุทธ์ไปปฏิบัติ และการประเมินกลยุทธ์โดยมุ่งศึกษาเปรียบเทียบจากองค์การที่เลิศทั้งภาครัฐและ\nภาคส่วนต่าง ๆ ที่ไม่ใชภ่าครัฐ ทั้งในและต่างประเทศเพื่อมาบทเรียนในการประยุกต์ใช้อย่างเหมาะสม\nPrerequisites: Have earned credits of PO 241\nConcepts and foundations of strategic management to be effectively and innovatively applied\nto the development of organizations in public atmosphere namely public agencies, state enterprises,\nindependent organizations, public organizations in several forms. The study includes vision and mission\nrevision, SWOT Analysis and TOWS Matrix, strategic translation and implementation, and evaluation.\nCases of state and non-state strategic management are examined and analyzed to the more\nappropriate and better new design.\n60 ร. 251 การบริหารทรัพยากรมนุษย์ภาครัฐ 3 (3-0-6)\nPO 251 Public Human Resource Management\nวิชาบังคับก่อน : สอบได้วชิา ร.241\nปรัชญา แนวคิด หลักการ และนโยบายของการบริหารทรัพยากรมนุษย์ภาครัฐ กระบวนการและ\nเทคนิคของการบริหารทรัพยากรมนุษย์ภาครัฐ การกำหนดงานและตำแหน่ง รวมทั้งศึกษาปัญหาของการ\nบริหารทรัพยากรมนุษย์ภาครัฐ โดยคำนึงถึงผลกระทบ ปัจจัยแวดล้อมที่มีผลต่อการบริหารงานทรัพยากร\nมนุษย์ภาครัฐ\nPrerequisites: Have earned credits of PO 241\nPhilosophy, concept, principles and policies of public sector human resource management;\nprocesses and techniques of public sector resource management; determination of work positions and\nstudy of problems in public sector resource management, with consideration of the effects of\nenvironmental factors that impact on it.\nร. 342 เครื่องมือการบริหารและการจัดการ 3 (3-0-6)\nPO 342 Administrative Tools and Management\nวิชาบังคับก่อน : สอบได้วชิา ร.241\nศึกษาแนวคิดและเทคนิคการบริหารและการจัดการที่เน้นการส่งเสริมการบริหารงานและการ\nบริการในภาครัฐให้ได้คุณภาพ แนวคิดการบริหารงานรัฐบาลอิเล็คทรอนิกส์ในโลกยุคดิจิทัล รวมตลอดถึง\nการปรับใช้เครื่องมอืสมัยใหม่ในการบริหารงานภาคสาธารณะ ทำความเข้าใจปฏิสัมพันธ์และความสัมพันธ์\nระหว่างเทคโนโลยีนวัตกรรม และการบริหารจัดการระบบข้อมูลสาธารณะ ศึกษาบทบาท และอิทธิพล\nของเทคโนโลยีและนวัตกรรมที่มีผลต่อการบริหารงานภาครัฐ โดยการเรียนรู้กรณีศึกษาจากองค์การทั้ง\nภาครัฐและภาคเอกชน ทั้งในประเทศไทยและต่างประเทศ\nPrerequisites: Have earned credits of PO 241\nTo study administrative and management concepts and methods, focusing on building quality\nservice and management in public sector, E-Government concepts in the digital age, as well as the\napplication of modern administrative tools to public administration. To understand the interactions and\nrelationships between technology, innovation, and public management information systems. Study\nthe role and influence of technology and innovation in public administration by learning from both\npublic and private organizations case studies in Thailand and abroad.\n61 ร.343 พฤติกรรมและวัฒนธรรมองค์การ 3 (3-0-6)\nPO 343 Organization Culture and Behavior\nวิชาบังคับก่อน : สอบได้วิชา ร.241\nแนวความคิดและทฤษฎีที่เกี่ยวกับพฤติกรรมของมนุษย์ในองค์การ ปัจจัยที่กำหนดพฤติกรรม และ\nความสัมพันธ์ของมนุษย์ทั้งในระดับปัจเจกบุคคล กลุ่ม องค์การ ศึกษาเรื่องการจูงใจ ภาวะผู้นำ ความ\nร่วมมือและความขัดแย้งในองค์การ อำนาจอิทธิพล และการติดต่อสื่อสารในองค์การ ความสำคัญของ\nวัฒนธรรมองค์การ และผลที่มพี ฤติกรรมของมนุษย์ การพัฒนาองค์การและการบริหารการเปลี่ยนแปลง\nPrerequisites: Have earned credits of PO 241\nConcepts and theories of human behaviour in organisations; factors determining human\nbehaviour and interpersonal relationships on individual, group and organizational levels; motivation,\nleadership, cooperation and conflict within organisations; power and influence and contact and\ncommunication within organisations; importance of organizational culture and effects of human\nbehaviour; organizational development and managing change.\nร.345 องค์การและการจัดการสาธารณะไทย 3 (3-0-6)\nPO 345 Thai Public Organization and Management\nบทบาท โครงสร้าง และกระบวนการจัดการขององค์การที่มีบทบาทด้านการจัดบริการสาธารณะ\nในประเทศไทย โดยครอบคลุมทั้งกลุ่มองค์กรในภาครัฐ (governmental bodies) และกลุ่มองค์กรที่มิใช่รัฐ (non-\ngovernmental bodies) ตลอดจนศกึษาเกี่ยวกับรูปแบบ เคร่อืงมอื และแนวทางในการจัดบริการสาธารณะใน\nประเทศไทย\nRole, structure and management process of organisations which have a role in public\nmanagement in Thailand. The course covers governmental and non-governmental bodies, as well as\nthe form, tools and approaches to public management in Thailand.\nร.346 การบริหารโครงการ 3 (3-0-6)\nPO 346 Project Management\nวิชาบังคับก่อน : สอบได้วิชา ร.250\nแนวคิดเกี่ยวกับโครงการ และการบริหารโครงการ วงจรการบริหารโครงการตั้งแต่การจัดทำและ\nวิเคราะห์โครงการ การจัดองค์การของโครงการ การกำหนดอำนาจหน้าที่ความรับผดิชอบของผู้ดำเนินการ\nตามโครงการ การวางแผน การปฏิบัติการควบคุมและติดตามประเมินผลโครงการ ปัญหาในการบริหาร\nโครงการ\nPrerequisites: Have earned credits of PO 250\nConcepts of projects and project management; the project management cycle i.e. project\nsetup and analysis, project organisation, determination of powers and responsibilities of project staff,\n62 planning, operations, control, follow-up and evaluation of projects, as well as project management\nproblems.\nร.347 การประเมนิผลโครงการ 3 (3-0-6)\nPO 347 Project Evaluation\nวิชาบังคับก่อน : สอบได้วิชา ร.250\nแนวความคิดเกี่ยวกับการประเมินผลโครงการ และการป้อนกลับของข้อมูล หลักการ วิธีการ และ\nกระบวนการประเมินผล ตัวแบบการประเมินผลโครงการ การใช้เครื่องมือวัดและเทคนิคการวัดผล\nโครงการ การดำเนินการประเมินผล โครงการ และการประเมนิผลกับสภาพแวดล้อมด้านต่าง ๆ\nPrerequisites: Have earned credits of PO 250\nApproaches to project evaluation and information feedback; evaluation principles, methods and\nprocesses; project evaluation formats; use of tools and methods to measure project results; carrying\nout project evaluation; result evaluation and different environmental aspects.\nร.348 ความรเู้บือ้งตน้ เกี่ยวกับนโยบายและการวางแผนสิ่งแวดล้อม 3 (3-0-6)\nPO 348 Introduction to Environmental Policy and Planning\nการวางแผนและการตัดสินใจทางนโยบายเกี่ยวกับสิ่งแวดล้อมและพลังงานในระดับประเทศ\nจริยธรรมด้านสิ่งแวดล้อม เทคนิคการวิเคราะห์สิ่งแวดล้อม กลยุทธ์ในการสร้างความร่วมมือในการ\nตัดสินใจด้านสิ่งแวดล้อม จุดแข็งและจุดอ่อนของเทคนิคต่าง ๆ อันได้แก่การวิเคราะห์ต้นทุนและ\nผลประโยชน์ การประเมินผลกระทบสิ่งแวดล้อม ตัวแบบและแบบจำลองต่าง ๆ การวิเคราะห์ความยั่งยืน\nและการประเมินความเสี่ยง รวมทั้งเทคนิคความร่วมมอื ในการตัดสินใจและการแก้ไขความขัดแย้งที่มีการใช้\nในทางปฏิบัติสำหรับการวางแผนด้านสิ่งแวดล้อมและพลังงาน\nThis course focuses on national environmental and energy policy-making; environmental\nethics; the techniques of environmental analysis; and strategies for collaborative environmental\ndecision-making. The primary objective of the course is to help students formulate a personal theory\nof environmental planning practice. The course is taught comparatively, with constant references to\nexamples from around the world. The national environmental and energy policy-making,\nenvironmental ethics, the techniques of environmental analysis, and strategies for collaborative\nenvironmental decision making. Strengths and weaknesses of key techniques of environmental\nanalysis like cost-benefit analysis, environmental impact assessment, modelling and simulation,\nsustainability analysis, and risk assessment. Collaborative decision-making and dispute resolution\ntechniques as they are used in the practice of environmental and energy facility planning.\n63 ร.349 ความสัมพันธ์ระหว่างหน่วยงานของรัฐและการบริหารจัดการเครือข่าย 3 (3-0-6)\nPO 349 Intergovernmental Relations and Network Governance\nวิชาบังคับก่อน : สอบได้วิชา ร.241\nแนวคิดพื้นฐานและการถ่ายทอดสู่กลไกการปฏิบัติของรูปแบบความสัมพันธ์ระหว่างหน่วยงานของ\nรัฐรูปแบบต่าง ๆ ที่การบริหารจัดการภาครัฐใช้ โดยเฉพาะในกระบวนนโยบายและการบริการสาธารณะใน\nบริบทปัจจุบัน การศึกษาการใช้รูปแบบความสัมพันธ์ระหว่างหน่วยงานภาครัฐผ่านกรณีศึกษาในประเทศ\nทุก ๆ ระดับ และต่างประเทศในระบบโลกจะช่วยใหส้ามารถเรียนรู้ทำความเข้าใจในความเชื่อมโยงที่สำคัญ\nของหน่วยงานต่าง ๆ ข้ามสายงานในการบริหารจัดการเครือข่ายเพื่อตอบสนองประเด็นสาธารณะที่\nเปลี่ยนไปในปัจจุบัน พร้อม ๆ กับดำเนินภารกิจหลักตามหน้าที่การปฏิบัติงานของหน่วยงานเหล่านั้น ใน\nการศึกษานักศึกษาต้องศึกษาทำความเข้าใจเงื่อนไขทางประวิติศาสตร์ การเมืองการปกครอง ลักษณะ\nประเด็นสาธารณะ สัมพันธภาพที่ทางการและไม่ทางการของหน่วยงาน และการแลกเปลี่ยน\nทรัพยากรในการปฏิบัติงาน เพื่อสังเคราะหรู์ปแบบวิธีการที่เหมาะสมในแต่ละบริบท\nPrerequisites: Have earned credits of PO 241\nConceptual frameworks and empirical translation into practices on intergovernmental relations\nare the main structure public administrative system operates in response to emerging public issues,\nand the focus through which public policy and services are made and delivered. Contemporary public\nadministrators build critical linkages across organizational boundaries while simultaneously managing\nthe internal functions of their agencies. Therefore, understanding of the historical, societal, and political\nfoundations of intergovernmental relations is foundation to the design of effective network governance.\nThe study includes intergovernmental relations in policy process, fiscal relations between government\nbodies, limitations and challenges in intergovernmental relations, comparative framework and\npractices, and future positions of intergovernmental relations.\nร.350 การบริหารรัฐกิจไทย 3 (3-0-6)\nPO 350 Introduction to Thai Public Administration\nวิชาบังคับก่อน: สอบได้วชิา ร.241\nการศึกษาในรายวิชานี้จะมุ่งทำความเข้าใจถึงระบบบริหารงานภาครัฐของไทยการเบื้องต้น\nซึ่งจะครอบคลุมเนื้อหาสำคัญ 3 ประการ ได้แก่หนึ่ง การทำความเข้าใจถึงพัฒนาการในระบบการเมือง-\nการบริหารไทย โดยเฉพาะอย่างยิ่งพัฒนาการของระบบบริหารงานภาครัฐไทยสมัยใหม่กับการก่อรูปของ\nรัฐสมัยใหม่สอง จะศึกษาถึงโครงสร้าง รูปแบบ และคุณลักษณะของระบบบริหารงานภาครัฐไทยใน\nปัจจุบัน โดยจะครอบคลุมกลไกของรัฐที่สำคัญทั้งการบริหารราชการส่วนกลาง การบริหารราชการส่วน\nภูมิภาค การบริหารราชการส่วนท้องถิ่น รัฐวิสาหกิจ และหน่วยงานของรัฐรูปแบบอื่น ๆ และสาม จะศึกษา\nถึงประเด็นปัญหา ปัจจัยท้าทาย และแนวโน้มความเปลี่ยนแปลงที่สำคัญของการบริหารรัฐกิจไทย\n64 Prerequisites: Have earned credits of PO 241\nIt is an introductory course and aims to provide a basic understanding of the key\ncharacteristics of public administration in Thailand. The core contents of the course can be divided into\nthree parts. Firstly, it will focus on the historical development of the politico-administrative institutions\nin Thailand. Especially, it will discuss on how the process of state-building in the 19th century affect\nthe structure and practices of contemporary Thai public administration. Secondly, it will introduce the\ngeneral structure and key mechanisms of the current administrative system to the students. It will\ncover a basic structure and work process of each types of the Thai administrative mechanisms at all\nlevels including central administration, provincial administration, local administration, state enterprise\nand public organization. The last part will discuss on problematic features and future threats of the\nThai public administration as well as on how the system responds to key contextual changes in the\n21st century.\nร.353 การบริหารแรงงาน 3 (3-0-6)\nPO 353 Labour Administration\nความสัมพันธ์ระหว่างประชากรกับกำลังแรงงาน บทบาทของแรงงานในการพัฒนาเศรษฐกิจ\nสภาพและปัญหาของแรงงาน หลักการและแนวทางกำหนดนโยบายด้านแรงงาน บทบาทของรัฐบาลในด้าน\nการบริหารแรงงาน ทั้งในแง่ของการกำหนดค่าจ้างขั้นต่ำ การคุ้มครองแรงงาน การแรงงานสัมพันธ์ การ\nจัดหางานและการพัฒนาฝีมอื แรงงาน การให้หลักประกันสังคม และบทบาทของศาลแรงงานในการบริหาร\nแรงงาน ตลอดจนการศึกษาโดยเน้นถึงปัญหาการบริหารแรงงานในประเทศไทยด้วย\nRelationship between population and the workforce; role of labour in economic development;\ncondition and problems of labour; principles and approaches to determining labour policy; role of\ngovernment in labour administration both in deciding minimum wages, labour control, labour relations,\nemployment and labour skill development; social security provision and the role of the labour court in\nlabour administration, as well as studying labour administration problems in Thailand.\nร.356 เทคโนโลยีนวัตกรรมและการบริหารจัดการระบบข้อมูลสาธารณะ 3 (3-0-6)\nPO 356 Technology, Innovation and Public Management Information Syste\nการทำความเข้าใจปฏิสัมพันธ์และความสัมพันธ์ระหว่างเทคโนโลยีนวัตกรรม และการบริหาร\nจัดการระบบข้อมูลสาธารณะ บทบาท และอิทธิพลของเทคโนโลยีและนวัตกรรมที่มีผลต่อการบริหารรัฐกิจ\nแนวคิดและเครื่องมือเกี่ยวกับการบริหารจัดการระบบข้อมูล เพื่อนำไปปรับใช้กับหน่วยงานราชการ\nรัฐวิสาหกิจ องค์การอิสระ และองค์การสาธารณะต่าง ๆ โดยอาศัยกรณีศึกษาจากองค์การทั้งภาครัฐและ\nภาคเอกชน ทั้งในและต่างประเทศ เพื่อให้เกิดการเรยีนรู้อย่างรูปธรรม\n65 To understand the interactions and relationships between technology, innovation, and public\nmanagement information systems. The role, definition, and influence of technology and innovation, on\npublic administration. Concepts and tools for managing information systems to adapt to government\nagencies, state enterprises, independent organizations, and public organizations, covering theoretical\nand practical issues related to public information management. This course relies on case studies from\nboth public and private organizations, both locally and internationally, for concrete learning.\nร.357 การพัฒนาทรัพยากรมนุษย์ 3 (3-0-6)\nPO 357 Human Resource Development\nวิชาบังคับก่อน : สอบได้วิชา ร.251\nศึกษาปรัชญาและแนวคิดการพัฒนาทุนมนุษย์เปรียบเทียบในระดับมหภาคทั้งในและต่างประเทศ\nและศกึษาแนวคิด กระบวนการ เครื่องมือ และกรณีศึกษาในการพัฒนาทรัพยากรมนุษย์ที่ใช้ในองค์การทั้ง\nในภาครัฐและในภาคเอกชน ทั้งในด้านการพัฒนาองค์การ การพัฒนาความก้าวหน้าในอาชีพ การจัดการ\nฝกึอบรม และการจัดทำแผนการพัฒนาบุคลากร ตลอดจนการวัดความคมุ้ค่าในการพัฒนาบุคลากร\nPrerequisites: Have earned credits of PO 251\nA study of Human Resource Developemnt that focuses on a comparative perspective of\nhuman capital development philosophies and concepts at the macro level comparing Thailanad and\nother countries, and the concepts, processes, tools and case studies in human resource development\nused in organizaions both in public and private sectors. The scope of study includs organizational\ndevelopment (OD), career development (CD), training management, training roadmap (TRM) and HRD\nevaluation.\nร. 358 การบริหารการพัฒนาในบริบทโลก 3 (3-0-6)\nPO 358 Development Administration in Global Context\nวิชาบังคับก่อน : สอบได้วชิา ร.241\nศึกษาแนวคิดและทฤษฎีของการพัฒนาและการบริหารการพัฒนา สภาพแวดล้อมที่มีผลต่อการ\nบริหารการพัฒนา และผลกระทบที่เกิดขึน้บทบาทตัวแสดง (Actors) ทั้งภาครัฐ เอกชน และประชาสังคมใน\nการบริหารการพัฒนา กลไกและกระบวนการบริหารพัฒนา รวมทั้ง ปัญหาในการบริหารการพัฒนาต่างๆ\nโดยเน้นศึกษาการบริหารการพัฒนาในประเทศไทยเปรียบเทียบกับประเทศอ่นื\nPrerequisites: Have earned credits of PO 241\nThis course studies the concepts and theories of development and development\nadministration, theenvironmental conditions affecting development administration and resulting effects,\nthe role of actors in the state and private sectors and civil society in development administration,\n66 mechanisms and processes of development administration as well as development administration\nproblems, with studies comparing Thailand and other countries.\nร.359 การบริหารรัฐกิจเปรียบเทียบ 3 (3-0-6)\nPO 359 Public Administration in Comparative Perspective\nวิชาบังคับก่อน : สอบได้วิชา ร.241\nการบริหารรัฐกิจของประเทศต่าง ๆ ทั้งประเทศที่พัฒนา เช่น สหรัฐอเมริกา อังกฤษ ฝรั่งเศส\nออสเตรเลีย ญี่ปุ่น ต้น และประเทศที่กำลังพัฒนาโดยเฉพาะประเทศในภูมิภาคเอเชีย เช่น เอเชีย\nตะวันออกเฉียงใต้ และเอเชียใต้ โดยศึกษาโครงสร้างการบริหารงาน กระบวนการบริหารงาน รูปแบบและ\nลักษณะขององคืกรในภาครัฐ วัฒนธรรมและพฤติกรรมการทำงาน นวัตกรรมการบริหารงานใหม่ ๆ ปัจจัย\nของความสำเร็จ และความล้มเหลวของการพัฒนา การบริหารงานภาครัฐในแต่ละประเทศ ตลอดจน\nวิธีการในการจัดการปัญหาในการบริหารงานของภาครัฐ เชน่ปัญหาการคอร์รัปชั่น\nPrerequisites: Have earned credits of PO 241\nPublic administration in different countries, both developed countries such as the USA, UK,\nFrance, Australia and Japan; and developing countries, especially in Asia i.e. in south and southeast\nAsia. The focus is on administrative structure, administrative processes, forms and characteristics of\nstate bodies, working culture and behaviour, innovations in administration, factors in success and\nfailure of development of administration of state bodies in different countries as well as methods of\nmanaging problems such as corruption in administration of state bodies.\nร.360 การบริหารการคลังและงบประมาณ 3 (3-0-6)\nPO 360 Public Budgeting and Fiscal Administration\nวิชาบังคับก่อน : สอบได้วิชา ร.241\nเศรษฐกิจกับการคลัง เป้าหมายและหน้าที่ด้านเศรษฐกิจของรัฐ กิจกรรมทางการคลัง ระบบการ\nคลัง การจัดการด้านรายรับ การจัดการด้านภาษีอากรและหนี้สาธารณะของประเทศ การจัดการด้าน\nรายจ่าย ความสำคัญและบทบาทของงบประมาณ กระบวนการงบประมาณ ระบบงบประมาณ ปัญหา\nทางการคลังและงบประมาณ และผลกระทบของสิ่งแวดล้อมที่มีผลต่อการบริหารการคลังและงบประมาณ\nของประเทศ\nPrerequistes: Have earned credits of PO 241\nEconomy and fiscal administration; economic goals and duties of the state; fiscal activity; the\nfiscal system; income management; management of taxation and national debt; management of\nexpenditure; importance and role of the budget; budget systems; fiscal administration and budgeting\nproblems and effects of surrounding conditions on national budgeting and public administration.\n67 ร.361 นโยบายสาธารณะและการจัดการปกครอง 3 (3-0-6)\nPO 361 Public Policy and Governance\nวิชาบังคับก่อน : สอบได้วิชา ร.241\nความหมาย คุณลักษณะ และธรรมชาติของนโยบายสาธารณะ แนวทางในการศึกษานโยบาย\nสาธารณะ รวมถึง การวิเคราะห์นโยบายเบื้องต้น เทคนิคการจัดโครงสร้างปัญหาและค้นหาทางเลือก\nการศกึษากระบวนการนโยบาย ตัวแบบที่อธิบายถึงผู้เล่นและการตอ่สู้ในยุคที่รัฐผู้เล่นหลัก บทบาทของ\nรัฐและตัวแสดงนอกรัฐภายใต้บริบทการจัดการปกครอง โดยใช้กรณีศึกษานโยบายในบริบทที่หลากหลาย\nรวมทั้งการเรยีนรู้นโยบายที่น่าสนใจผ่านแง่มุมของการประเมินผล\nPrerequisites: Have earned credits of PO 241\nMeaning, attributes, and nature of public policy, Approaches of studying public policy. Policy\nanalysis through problem structuring and alternative searching. Policy process and models explaining\nactors and their contestations within the era of state-led policy. Roles of state actor and non-state\nactors within the context of governance. Cases of public policies in several context and an evaluation\non interesting policies are included in this course.\nร.363 การบริหารการคลังท้องถิ่น 3 (3-0-6)\nPO 363 Local Financial Administration\nวิชาบังคับก่อน : สอบได้วิชา ร.360\nแนวความคิดและหลักการในการกระจายอำนาจทางการคลังให้แก่ท้องถิ่น วงจรงบประมาณ\nการบริหารการคลังของท้องถิ่นทั้งในด้านการจัดการรายรับและรายจ่าย รวมทั้งหนี้ขององค์กรปกครอง\nส่วนท้องถิ่น การบัญชีเบื้องต้น การพัฒนาเศรษฐกิจและศักยภาพทางการคลังขององค์กรปกครองส่วน\nท้องถิ่น ตลอดจนความสัมพันธ์ระหว่างการคลังท้องถิ่นและการคลังระดับชาติ โดยเน้นศึกษากรณีทั้งของ\nประเทศไทยและต่างประเทศ\nPrerequisites: Have earned credits of PO 360\nConcepts and principles of fiscal decentralization; budget cycle; local fiscal administration\nincluding techniques in managing local revenues and expenditures; local debt administration; basic\naccounting; local economic development; local fiscal improvement, as well as intergovernmental fiscal\nrelations, with an emphasis on case studies from Thailand and abroad\nร.364 การจัดการความหลากหลายวัฒนธรรมองค์การ 3 (3-0-6)\nPO 364 Diversity and Organizational Culture Management\nวิชาบังคับก่อน : สอบได้วิชา ร.343\nวิชานี้มุ่งเน้นศึกษาเกี่ยวกับความหลากหลายทางวัฒนธรรมที่ผลมาจากโลกาภิวัตน์ การ\nวิเคราะห์ความหมาย บทบาทและอิทธิพลของวัฒนธรรมในชีวิตประจำวันและชีวิตการทำงาน พยายามทำ\n68 ความเข้าใจและเรียนรู้วิธีการจัดการกับความหลากหลายทางวัฒนธรรมที่เพิ่มมากยิ่งขึ้นซึ่งมีความสำคัญ\nต่อการเข้าใจการเปลี่ยนแปลงทางด้านวัฒนธรรม การบริหารจัดการวัฒนธรรมถืออีกหนึ่งประเด็นที่\nวิชานี้มุ่งเน้น การศึกษาและวิเคราะห์การบริหารจัดการวัฒนธรรมที่มีผลกระทบต่อการพัฒนาสังคมและ\nเศรษฐกิจของประเทศ วิชานีว้างอยู่บนพืน้ฐานสหวิทยาการและใช้ตัวอย่างจากเอเชยี และทั่วโลก\nPrerequisites: Have earned credits of PO 343\nThe subject focuses on the multicultural education that results from globalization. Analysis of\nmeaning, role, and influence of culture on everyday life and work life. Learn to understand and learn\nhow to handle more multiculturalism, which is important for understanding cultural change. Cultural\nmanagement is another area where this course of study focuses on the social and economic\ndevelopment of the country. Cultural management is another issue that focuses on this subject. Study\nand analysis of cultural management affecting the social and economic development of the country.\nThe course draws from many disciplines and uses examples from Asia and around the world.\nร.366 การบริหารจัดการส่งิ แวดล้อมอย่างยั่งยืน 3 (3-0-6)\nPO 366 Sustainable Environmental Management\nวิชาบังคับก่อน : สอบได้วิชา ร.241\nหลักการ แนวคิดที่เกี่ยวข้องกับการบริหารจัดการสิ่งแวดล้อม ความสัมพันธ์ระหว่างปัจจัยทาง\nการเมือง เศรษฐกิจ และสังคม บทบาทของภาครัฐ ภาคเอกชน ภาคประชาสังคม และองค์กรระหว่าง\nประเทศในการบริหารจัดการสิ่งแวดล้อม ทั้งในประเทศไทยและประเทศอื่น ๆ ศึกษาเกี่ยวกับแนวทางและ\nรูปแบบการบริหารจัดการแบบ ต่าง ๆ ที่มีการใช้ในการบริหารจัดการสิ่งแวดล้อม เน้นการวิเคราะห์\nกรณีศึกษาในประเด็นร่วมสมัยและที่ท้าทายการบริหารจัดการระดับระหว่างประเทศ อาทิการปรับตัวต่อ\nเปลี่ยนแปลงสภาพภูมอิากาศ การอนุรักษ์ความหลากหลายทางชีวภาพ และเมืองขนาดใหญ่\nPrerequisites: Have earned credits of PO 241\nPrinciples, concepts and approaches to environmental management; relationship between\npolitical, economic and social factors that determine environmental management and its application;\nrole of and cooperation between the state, the private sector, people’s movements, NGOs and\ninternational organizations relating to environmental management, both nationally and globally, as well\nas experiences of environmental management in Thailand and in other countries. A feature of the\ncourse's examination of contemporary approaches will be in-depth critical analyses of prominent\ncases of environmental management, and the emerging international environmental challenges for\nclimate change adaptation, agro-ecosystems, biodiversity conservation and megacities.\n69 ร.367 แนวทางวเิคราะหน์ โยบายและหลักปฏิบัติแบบบูรณาการ 3 (3-0-6)\nPO 367 Integrated Approach to Policy Analysis and Practice\nวิชาบังคับก่อน : สอบได้วิชา ร.361\nแนวทางและหลักการวิเคราะหน์ โยบายสาธารณะเพื่อออกแบบนโยบายที่บูรณาการและตอบโจทย์\nความซับซ้อนของปัญหาสาธารณะในปัจจุบัน ตั้งแต่การวิเคราะห์ปัญหาและผลกระทบอย่างครอบคลุม\nและระบบ (Holistic approach) การใช้กรอบแนวคิดข้ามศาสตร์อาทิเช่นหลักภูมิสังคม ภูมิเศรษฐศาสตร์\nการจัดการสิ่งแวดล้อมอย่างยั่งยืน การบริหารเครือข่าย และความรู้เฉพาะประเด็นนโยบายอื่น ๆ โดย\nมุ่งเน้นการวิเคราะห์เชิงระบบและแนวทางร่วมคิดร่วมสร้าง (Co-creation) ห้องปฏิบัติการเพื่อทดสอบและ\nเรียนรู้นโยบาย (Policy lab) นวัตกรรมเชิงนโยบาย (Policy innovation) การจัดการความเปลี่ยนแปลง\n(Transition management) เพื่อทดลองออกแบบนโยบาย และระบบและแนวปฏิบัติที่บูรณาการและ\nครอบคลุม\nPrerequisites: Have earned credits of PO 361\nThis course offers theoretical foundation and analytical frameworks for introducing integrated\npolicy making in the complex societal and dynamic political context. This covers systematic and holistic\napproach to analyze policy problem and its impact. The combination of multidisciplinary frameworks\nand insights based on Social and Economic Geography, Sustainable Environmental Management and\nNetwork Management and other relevance expertise and knowledge in both policy and practice are\nincluded in this course. Rather than providing fixed policy solutions, the focus of this course is on a\njourney of integrated approach to policy making which highlights collaborative and co-creation\nprocess, policy learning and policy lab, innovative process and policy innovation, and transition\nmanagement in policy design and practice.\nร.368 นโยบายและการจัดการเมอืง 3 (3-0-6)\nPO368 Urban Policy and Management\nวิชาบังคับก่อน : สอบได้วชิา ร.241\nความหมาย และ วัฎจักรของเมือง บทบาทของเมืองในมิติการพัฒนาทางการเมืองเศรษฐกิจและ\nสังคม วิเคราะห์สภาพปัญหาที่มาพร้อมกับการเติบโตของเมือง เข้าใจถึงทิศทางการพัฒนาเมือง รวมทั้ง\nองค์กรที่เกี่ยวข้องในกระบวนการนโยบายและการจัดการ และแนวทางในการบริหารจัดการเมืองในมิติต่าง\nๆ เช่น ผังเมือง สิ่งแวดล้อม และการบริการทางสังคม รวมทั้งกระบวนการและเทคนิคการมีส่วนรว่มในการ\nจัดการเมอืง โดยศึกษาประสบการณทั์้งในประเทศและต่างประเทศ\nPrerequisites: Have earned credits of PO 241\nMeaning and cyclical development of urban spaces; role of urban areas in terms of political,\neconomic and social development; analysis of problems accompanying urban growth; understanding\nthe direction of urban development, organisations involved in urban policy and management and\n70 approaches to managing urban areas in different aspects, such as urban planning, environment and\nsocial services , as well as processes and techniques to increase involvement in urban planning, with\nnational and international case studies.\nร.369 การบริหารจัดการองค์กรปกครองสว่นท้องถิ่น 3 (3-0-6)\nPO 369 Local Government Management\nวิชาบังคับก่อน : สอบได้วิชา ร.241\nบทบาทและการดำเนินงานขององค์กรปกครองส่วนท้องถิ่นในฐานะองค์กรที่มีความรับผิดชอบ\nในการจัดบริการสาธารณะท้องถิ่น ทำความเข้าใจกับลักษณะสำคัญและความแตกต่างระหว่างองค์กร\nปกครองสว่นท้องถิ่นและองค์กรภาครัฐประเภทอื่น ๆ กระบวนการนโยบายสาธารณะท้องถิ่น กระบวนการ\nบริหาร การบริหารงานทรัพยากรบุคคล การคลังสาธารณะและงบประมาณ ความสัมพันธ์ระหว่าง\nส่วนกลาง ภูมิภาคและองค์กรปกครองส่วนท้องถิ่น รวมทั้งการมีส่วนร่วมของประชาชนในการทำงานของ\nองค์กรปกครองส่วนท้องถิ่น โดยใหค้วามสำคัญกับกรณีศกึษาทั้งในประเทศไทยและต่างประเทศ\nPrerequisites: Have earned credits of PO 241\nThis course studies the role and operations of local government as an organisation with\nresponsibilities for local public administration, understanding important characteristics and differences\nbetween local government and other state bodies, local public policy processes, administration\nprocesses, human resource management, public fiscal administration and budgeting, the relationship\nbetween central, regional and local government as well as public involvement in the workings of local\ngovernment, with case studies from Thailand and abroad.\nร.443 สัมมนาการบริหารรัฐกิจ 3 (3-0-6)\nPO 443 Seminar in Public Administration\nวิชาบังคับก่อน : สอบได้วิชา ร.241\nการสัมมนาแลกเปลี่ยนความรู้ในประเด็นร่วมสมัยต่างๆ ทางด้านการบริหารรัฐกิจทั้งในประเทศ\nไทยและในต่างประเทศ รวมถึงประเด็นปัญหาอื่นๆ ที่เกี่ยวข้องทางด้านการบริหารรัฐกิจที่ตกลงร่วมกัน\nระหว่างผู้สอนและนักศกึษา\nPrerequisites: Have earned credits of PO 241\nThis seminar involves the exchange of ideas on various contemporary topics in the field of\npublic administration both nationally and internationally, as well as other issues related to public\nadministration as agreed for discussion by the instructor and students.\n71 ร.444 การบริหารรัฐกิจกับการพัฒนาระหว่างประเทศ 3 (3-0-6)\nPO 444 Public Administration and International Development\nบทบาท แนวคิดและความสัมพันธ์ของการบริหารรัฐกิจกับการพัฒนาระหว่างประเทศ การศึกษา\nพัฒนาการและอิทธิพลของการพัฒนาระหว่างประเทศที่ส่งผลทั้งทางตรงและทางอ้อมต่อการบริหารรัฐกิจ\nภายในประเทศ ทั้งในระดับส่วนกลาง ภูมิภาค และท้องถิ่น การนำนโยบายด้านการพัฒนาระหว่างประเทศ\nสู่การปฏิบัติในระดับประเทศ มุ่งเน้นเสริมสร้างทักษะการนักบริหารรัฐกิจในระดับระหว่างประเทศที่\nมองปัญหาแบบองค์รวมตั้งแต่ระดับระหว่างประเทศ ระดับภูมิภาคและระดับประเทศ ตลอดจนการจัดการ\nปัญหาในลักษณะการประยุกต์องค์ความรสู้หวิทยาการ\nThe role, concept and the relationship between Public Administration and International\nDevelopment. A study of the development and influence of international development approach that\ndirectly and indirectly impacts on central, regional, and local government administration. The course\nfocuses on analysing the application of international development policy to practice at the national\nlevel. The focus is also on enhancing the skills of a public administration practitioner who studies\nholistic problems from a national level to International level, as well as problem management with\napplied interdisciplinary knowledge.\nร.445 การบริหารจัดการองค์การไม่แสวงหากำไรและธุรกิจเพื่อสังคม 3 (3-0-6)\nPO 445 Non Profit Management and Social Entrepreneurship\nหลักการ แนวคิดและความหมายขององค์การไม่แสวงหากำไรและธุรกิจเพื่อสังคม มุ่งเน้นบทบาท\nและการบริหารจัดการองค์การไม่แสวงหากำไรและธุรกิจเพื่อสังคมในการแก้ไขปัญหาระดับประเทศและ\nต่างประเทศโดยศึกษาผ่านประสบการณ์ของผู้เชี่ยวชาญด้านองค์การไม่แสวงหากำไรและผู้ประกอบธุรกิจ\nเพื่อสังคม ฝึกทักษะและเทคนิคด้านการจัดการของนักศึกษาทั้งในด้านการบริหารภาครัฐและภาคเอกชน\nเพื่อเตรียมความพร้อมในการรับมือกับประเด็นต่างๆ ตลอดจนทำความเข้าใจต่ออิทธิพลขององค์การไม่\nแสวงหากำไรและธุรกิจเพื่อสังคมตอ่ภาครัฐและภาคประชาชน\nPrinciples, concepts and definitions of non-profit organizations and social enterprises. Focus on\nthe role and management of non-profit organizations and social enterprises in addressing national and\ninternational issues by studying the experiences of non-profit organizations and social entrepreneurs.\nPractice skills and management techniques for students in the areas of public administration and the\nprivate sector to prepare them for dealing with issues. The course focuses on understanding the\ninfluence of non-profit organizations and social enterprises on public and private and people.\n72 ร.446 การจัดการความเสี่ยงและความตอ่ เนื่ององค์การ 3 (3-0-6)\nPO 446 Organizational Risk and Continuity Management\nการเปลี่ยนแปลงของทั้งองค์การโดยธรรมชาตแิละความซับซ้อนของสภาพแวดล้อมองค์การ สง่ผล\nให้พื้นฐานความรู้ความเข้าใจและความสามารถในการวิเคราะห์ความเสี่ยงและสิ่งท้าทายขององค์การใน\nการดำเนินงานสมรรถนะหลัก ในการจะออกแบบความสามารถในการปรับตัวต่อการเปลี่ยนแปลงเพื่อ\nความอยู่รอดและการพัฒนาที่ต่อเนื่องขององค์การ การศึกษาด้วยกรณีศึกษาการวิเคราะห์และจัดการ\nความเสี่ยงและความต่อเนื่ององค์การจะช่วยให้สามารถเข้าใจลำดับขั้น กระบวนการ การพัฒนาสมรรถนะ\nและการสร้างทีมยุทธวิธี ในการจัดการความเสี่ยงและให้องค์การสามารถจัดการได้ต่อเนื่องอย่างมี\nประสิทธิภาพและมีผลกระทบน้อยที่สุด\nIn the dynamic changes and complex environment organizations operate, ability to\nunderstand, identify, and analyze the challenges and risks faced in carrying out policy implementation\nand service delivery are required under the continuity management framework. This includes the\nlearning and practicing on steps to manage the challenges, to understand the respective roles and\nresponsibilities for adaptive capacity, to develop a robust continuity plan including the process, the\nmechanisms, capacity required and tactical team to dive in to reduce impacts. Cases from domestic\nand international organizations are examined.\nร.449 การบริหารจัดการความเสี่ยงภัยพิบัติ 3 (3-0-6)\nPO 449 Disaster Risk Governance\nพื้นฐานและกลไกของการบริหารการจัดการความเสี่ยงภัยพิบัติครอบคลุมทุกประเภทภัยและการ\nบริหารจัดการในทุกระดับ ทั้งภายใต้กรอบการพัฒนาที่ยั่งยืนของโลก กรอบการดำเนินงานเพื่อการลด\nความเสี่ยงภัยพิบัติเซนได กรอบการปฏิบัติภายใต้ความร่วมมือของอาเซียน และนโยบายและการบริหาร\nจัดการของประเทศไทยและประเทศอื่น ๆ เพื่อสร้างความเข้าใจและความสามารถในการวิเคราะห์นโยบาย\nกลไก บทบาทและสัมพันธภาพที่ระบบขององค์กรทุกภาคส่วน และภาคประชาชน รวมทั้งวัฒนธรรม\nการปฏิบัติงานด้านความปลอดภัย เพื่อสร้างแนวทางชุมชนฐานในการจัดการความเสี่ยงภัยพิบัติตลอดจน\nสามารถสังเคราะห์จากกรณีศึกษาทั้งในละต่างประเทศ เพื่อออกแบบระบบที่สามารถปรับตัวต่อ\nสถานการณ์วิกฤติรูปแบบต่าง ๆ ต่อการดำรงไว้ซึ่งสมรรถนะในการคืนกลับสู่สภาวะปรกติและพัฒนาได้ดี\nขึน้กว่าเดิม\nFoundations and mechanisms of disaster risk governance involving multi-hazards and all levels\nof governance, domestically and internationally. The study includes the translation into practices from\nSustainable Development Goals, Sendai Disaster Risk Reduction Framework, ASEAN Agreement on\nDisaster Management and Emergency Response, and Disaster Risk Policy and Governance of Thailand\nand others. Disaster risks from domestic and international cases will be used to understand and\nanalyze policies, mechanisms, roles and interactions among involving stakeholders as well as citizen,\n73 and safety management culture to design more resilient communities and systems to build all back to\nbetter cope with the next risks to come.\nร.453 สัมมนาการจัดการทุนมนุษย์เชิงกลยุทธ์ 3 (3-0-6)\nPO 453 Seminar on Strategic Human Resource Management\nวิชาบังคับก่อน : สอบได้วชิา ร.251\nสัมมนาปรากฏการณ์ร่วมสมัยทางด้านการจัดการทุนมนุษย์เชิงกลยุทธ์ การผลิกโฉมการจัดการ\nและการพัฒนาทุนมนษย์ ผลกระทบและแนวโน้มที่อาจะเกิดขึ้นในการจัดการทุนมนุษย์ในภาครัฐและใน\nภาคเอกชน ตลอดจนการปรับเปลี่ยนมุมมองเชิงรุกเพื่อการพัฒนาบทบาทและการเสริมสร้างเครือข่ายใน\nการจัดการทุนมนุษย์เชิงกลยุทธ์\nPrerequisite: Have earned credits of PO 251\nThis seminar focuses on contemporary issues in strategic human capital management (SHCM),\nhuman capital management and development transformation, the impacts and trends in human capital\nmanagement in public and private sectors. The focus also includes the changing perspectives on HR\nroles for proactive and preemtive actions and the networks in SHCM.\nร.455 สัมมนาประเด็นนโยบายสาธารณะ 3 (3-0-6)\nPO 455 Seminar on Contemporary Issues in Public Policy\nวิชาบังคับก่อน : สอบได้วิชา ร.361\nสัมมนาประเด็นร่วมสมัยในแต่ละด้านของนโยบายที่เลือก เช่น นโยบายด้านสุขภาพ ด้าน\nสิ่งแวดล้อม ต้น โดยเลือกประเด็นตามความสนใจของผู้ศึกษา\nPrerequisites: Have earned credits of PO 361\nThis seminar discusses contemporary issues regarding selected policies, such as health policy\nand environmental policy, based on students’ interest.\nร.463 สัมมนาการบริหารการคลังสาธารณะ 3 (3-0-6)\nPO 463 Seminar on Public Finance\nวิชาบังคับก่อน : สอบได้วชิา ร.360\nวิเคราะห์นโยบายเกี่ยวกับการคลังสาธารณะ บทบาทของรัฐบาลในระบบเศรษฐกิจ กลไกและ\nเครื่องมือต่าง ๆ ของรัฐบาล สถาบันการคลัง ตลอดจนศึกษาถึงระบบการคลัง ซึ่งเกี่ยวข้องกับระบบภาษี\nอากร การบริหารรายรับและรายจ่ายของรัฐบาล การก่อหนี้สาธารณะอันส่งผลกระทบต่อสาธารณะ\nPrerequisites: Have earned credits of PO 360\nThis seminar analyses public financial policy, the role of government in the economic system,\ngovernment mechanisms and tools and financial institutions, as well as studies the financial system\n74 which ties in with the taxation system, government income and expenditure management and\nincurment of public debt which impacts on the public.\nร.467 สัมมนาการบริหารรัฐวิสาหกิจ 3 (3-0-6)\nPO 467 Seminar of Public Enterprises on Management\nวิชาบังคับก่อน : สอบได้วิชา ร.241\nสัมมนาถึงประวัติความมา รูปแบบ ฐานะ การจัดองค์การ โครงสร้าง การบริหารงานบุคคล\nการบริหารงานคลัง ความสัมพันธ์ระหว่างองค์การรัฐวิสาหกิจด้วยกัน และความสัมพันธ์ของรัฐวิสาหกิจ\nกับหน่วยงานของรัฐบาล การควบคุมโดยรัฐบาล ซึ่งจะได้พิจารณาถึงความเกี่ยวพันทางการเมือง\nเศรษฐกิจ สังคม ที่มีผลกระทบต่อวัตถุประสงค์และนโยบายของรัฐบาลด้วย การอภิปรายเพื่อหามาตรการ\nในการประเมินผลงานและบทบาทของรัฐวิสาหกิจที่มตี่อการวางแผนและการพัฒนาประเทศ\nPrerequisites: Have earned credits of PO 241\nThis seminar looks at the background, form, status, organisation, structure, personnel\nmanagement, financial management, the relationship between state bodies and state enterprises as\nwell as the relationship of state enterprises with governmental bodies and control by government.\nThe seminar considers the political, economic and social connections that affect government objectives\nand policy, the debate to establish standards by which to measure results and the role of state\nenterprises in national planning and development.\nร.468 ทฤษฎีเกมสำหรับนักรัฐศาสตร์ 3 (3-0-6)\nPO 468 Game theory for political scientists\nวิชาบังคับก่อน : สอบได้วชิา ร.241\nทฤษฎีเกมแนวทางวิทยาศาสตร์ในการศึกษาปฏิสัมพันธ์ทางสังคมที่เน้นด้านกลยุทธ์ของการ\nตัดสินใจระหว่างบุคคลหรือกลุ่มตั้งแต่สองคนขึ้นไป ซึ่งวิชานี้จะครอบคลุมองค์ประกอบพื้นฐานของทฤษฎี\nเกมและ วิธีการประยุกต์ในด้านรัฐศาสตร์และ เศรษฐศาสตร์การเมือง โดยจุดมุ่งหมายของการเรียน คือ\nการสร้างความเข้าใจ และเครื่องมือที่ลึกซึ้งเกี่ยวกับทฤษฎีเกม เพื่อช่วยให้เข้าใจแนวคิดการพัฒนาและ\nประยุกต์ใชใ้นด้านบริหารรัฐกิจ และขับเคลื่อนนโยบายสาธารณะอย่างยั่งยืน\nPrerequisites: Have earned credits of PO 241\nGame theory provides a scientific approach to the study of social interactions which focusses\non the strategic aspects of decision-making between two or more individuals or groups. This course\nwill cover the basic elements of game theory and how they have been applied in the area of political\nscience and political economy. The aim of the course is to provide a deeper understanding of game\ntheoretic tools and to help you understand how these ideas have been developed and applied in the\n75 political science. Understanding a profound tool on game theory tools helps to understand the concept\nof development and application in public administration and drive sustainable public policy.\nร. 567 การฝึกงานทางบริหารรัฐกิจ 3 (0-6-3)\nPO 567 Internship in Public Administration\nวิชาบังคับก่อน : นักศึกษาปีที่ 3 ขึน้ ไป\nมุ่งให้นักศึกษามีความรู้ความเข้าใจเกี่ยวกับการบริหารงานในองค์การในภาคปฏิบัติ และสามารถ\nนำความรู้ไปประยุกต์ใช้ในสภาพการทำงานที่แท้จริง โดยให้นักศึกษาได้เข้าฝึกงานในส่วนราชการ\nรัฐวิสาหกิจ หรือหน่วยงานที่เกี่ยวข้องในประเด็นต่างๆ ซึ่งอาจารย์ผู้สอนกำหนดไว้ทั้งนี้ เพื่อการฝึก\nทักษะและสร้างประสบการณ์ในการทำงานรว่มกับบุคคลอื่น ๆ\nPrerequisites: Students must be in their 3rd year of study upwards\nThe course aims for students to build knowledge and understanding of organizational\nmanagement in practice and for students to apply this knowledge to real life work. Students will\ncomplete a work placement at a government office, state enterprise or any organisation related to\nrelevant issues as designated by the instructor. The goal is for students to practise their skills and\nbuild experience in working with others.\nร.569 สหกิจศึกษาสาขาบริหารรัฐกิจ 3 (0-6-3)\nPO 569 Integrated Practices in Public Administration\nวิชาบังคับก่อน : นักศึกษาปีที่ 4 ที่ผ่านวิชา ร.567\nมุ่งให้นักศึกษามีความรู้ความเข้าใจเกี่ยวกับการบริหารงานในองค์การในภาคปฏิบัติ และสามารถ\nนำความรู้ไปประยุกต์ใช้ในสภาพการทำงานที่แท้จริง โดยให้นักศกึษาได้เข้าปฏิบัติงานสหกิจในส่วนราชการ\nรัฐวิสาหกิจ หรอืหน่วยงานที่เกี่ยวข้องในประเด็นต่าง ๆ ซึ่งเกี่ยวข้องกับกลุ่มวิชาหลักที่นักศกึษาเลือกศึกษา\nทั้งนี้ เพื่อการฝึกทักษะและสร้างประสบการณ์ในการทำงานในฐานะบุคลากรของหน่วยงาน เพื่อเรียนรู้\nและรับผิดชอบในการปฏิบัติงานตรงตามความตอ้งการในการเข้าสู่ตลาดแรงงานในอนาคต\nPrerequisites: Students must be in their 4th year of study and pass PO 567\nThe course aims for students to build knowledge and understanding of organizational\nmanagement in practice and for students to apply this knowledge to real life work. Students will\ncomplete a work placement at a government office, state enterprise or any organization related to\nrelevant issues as designated by the instructor to correspond to the selected module of academic\nconcentration. The goal is for students to practice their skills and build experience in working as\norganization assets to be responsible and accountable to the performance and tasks committed for\nfuture careers of preferences.\n76 2.2.3) สาขาการระหว่างประเทศ\nร.272 ประวัติศาสตร์การทูต 3 (3-0-6)\nPO 272 Diplomatic History\nประวัติความสัมพันธ์ระหว่างประเทศโดยหยิบยกเหตุการณ์และการตกลงทางการทูตครั้งสำคัญที่\nมีผลกระทบต่อระบบความสัมพันธ์ระหว่างประเทศ โดยเริ่มศึกษาตั้งแต่สมัยที่มีการประชุมระหว่างชาติที่\nเวียนนา เมื่อปีค.ศ. 1815 มาจนถึงปัจจุบัน\nHistory of international relations, with examples of events and diplomatic agreements that\nhave impacted on the system of international relations, from the Treaty of Vienna in 1815 until the\npresent.\nร.280 การเมอืงระหว่างประเทศ: ทฤษฎีและกรณีศกึษา 3 (3-0-6)\nPO 280 International Politics: Theories and Case Studies\nวิชาบังคับก่อน : สอบได้วชิา ร.271\nสำรวจแนวคิดทฤษฎีความสัมพันธ์ระหว่างประเทศและประยุกต์ใช้ในการวิเคราะห์การเมือง\nระหว่างประเทศ ตลอดจนการตอบสนองของชุมชนระหว่างประเทศต่อสถานการณ์ โดยศกึษาความขัดแย้ง\nและความรว่มมอืทั้งในเร่อืงความมั่นคง เศรษฐกิจ สังคม และวัฒนธรรม\nPrerequisites: Have earned credits of PO 271\nExplores theories and concepts in international relations and applies to the analysis of\ninternational politics. In addition, the course looks at reactions – mainly conflicts and cooperation in\nsecurity, economic, and cultural dimensions – of the international community to particular events.\nร.282 การอ่านและการวิเคราะหใ์ นความสัมพันธ์ระหว่างประเทศ 3 (3-0-6)\nPO 282 Reading and Analysis in International Relations\nวิชาบังคับก่อน : สอบได้วชิา ร.280\nสัมมนาการอ่านและการวิเคราะห์แนวความคิด ทฤษฎี และประเด็นร่วมสมัยในความสัมพันธ์\nระหว่างประเทศ เพื่อพัฒนาทักษะการอ่าน การคิดวิเคราะห์ และการวิพากษ์ อันจะเสริมสร้างศักยภาพใน\nการนำเสนอ การถกเถียง และการเขียนเชงิวิพากษ์\nPrerequisite: Have earned credits of PO 280\nSeminar on reading and analysis of ideas, theories, and contemporary issues ininternational\nrelations. This course aims to develop reading, analytical, and critical skills as well as improve the\nabilities to present, argue, write, and critique.\n77 ร.283 ความสัมพันธ์ระหว่างประเทศในเอเชียตะวันออกเฉียงใต้ 3 (3-0-6)\nPO 283 International Relations in Southeast Asia\nวิชาบังคับก่อน : สอบได้วชิา ร.280\nศึกษาความสัมพันธ์ระหว่างประเทศของชาติในเอเชียตะวันออกเฉียงใต้ และความสัมพันธ์ของ\nประเทศเหล่านี้กับประเทศมหาอำนาจและประเทศในภูมิภาคอื่น ๆ ตลอดจนบทบาทของประเทศในภูมิภาค\nเอเชียตะวันออกเฉียงใต้ในการเมอืงโลก\nPrerequisites: Have earned credits of PO 280\nExplores international relations of Southeast Asian countries and their relationship with major\npowers and countries in different regions. It includes roles of Southeast Asian countries in global\npolitics.\nร.293 กฎหมาย องค์การและระบอบระหว่างประเทศ 3 (3-0-6)\nPO 293 International Law Organizations and Regimes\nวิชาบังคับก่อน : สอบได้วชิา ร.271\nศึกษาที่มาและพัฒนาการขององค์การและระบอบระหว่างประเทศ โดยเน้นวิเคราะห์โครงสร้าง\nอำนาจหน้าที่บทบาท และการดำเนินงานขององค์การต่างๆ ในการสร้างและพัฒนาระบอบระหว่าง\nประเทศ ตลอดจนแนวทางแก้ไขปัญหาทางการเมือง เศรษฐกิจ และสังคมโลก พร้อมวิเคราะห์ประเมิน\nความสำเร็จและล้มเหลว\nPrerequisites: Have earned credits of PO 271\nStudies the origin and development of international organizations and regimes. It focuses on\ntheir structure, functions and processes in creating and developing international regimes as well as in\nsolving world social, economic and political problems, including the assessment of the\naccomplishments and failures\nร.370 การต่างประเทศของไทย 3 (3-0-6)\nPO 370 Thai Foreign Relations\nวิชาบังคับก่อน : สอบได้วิชา ร.280\nความสัมพันธ์ระหว่างไทยกับต่างประเทศในสมัยต่าง ๆ พิจารณาปัจจัยและกระบวนการในการ\nกำหนดนโยบาย แบบแผนของนโยบาย การดำเนินนโยบายต่างประเทศ ตลอดจนผลกระทบของนโยบาย\nต่างประเทศที่มผีลตอ่การเมอืงภายในของไทย\nPrerequisites: Have earned credits of PO 280\n78 International relations of Thailand in different eras; consideration of factors and processes in\npolicymaking; policy planning; foreign policy implementation and effects of foreign policy on internal\nThai politics.\nร.373 ความสัมพันธ์ระหว่างประเทศในเอเชียตะวันออก 3 (3-0-6)\nPO 373 International Relations in East Asia\nวิชาบังคับก่อน : สอบได้วชิา ร.280\nศึกษาความสัมพันธ์ระหว่างประเทศของชาติในเอเชียตะวันออก และความสัมพันธ์ของประเทศ\nเหล่านี้กับประเทศมหาอำนาจและประเทศในภูมิภาคอื่น ๆ ตลอดจนบทบาทของประเทศในภูมิภาคเอเชีย\nตะวันออกในการเมืองโลก\nPrerequisites: Have earned credits of PO 280\nExplores international relations of East Asian countries and their relationship with major powers\nand countries in different regions. It includes roles of East Asian countries in global politics.\nร.374 การเมอืงและการต่างประเทศของสหราชอาณาจักร 3 (3-0-6)\nPO 374 British Politics and Foreign Affairs\nวิชาบังคับก่อน : สอบได้วิชา ร.280\nศึกษาการเมืองในสหราชอาณาจักรและการต่างประเทศ โดยมีประเด็นสำคัญ เช่น การ\nพันธมิตรทางการทหารกับประเทศมหาอำนาจอ่นืการแทรกแซงด้านมนุษยธรรม การโอนอำนาจส่วนกลาง\nให้สกอตแลนด์ (devolution) การเมืองของการให้สัญชาติและผยู้ายถิ่นฐาน ความสัมพันธ์กับยุโรป และการ\nลงประชามตอิอกจากการสมาชิกสหภาพยุโรป\nPrerequisite: Have earned credits of PO 280\nA study of British politics and foreign policies. Important issues include, for example: military\nalliances with other major powers; humanitarian interventions; Scottish devolution; the politics of\nmigration and citizenship; relationships with Europe and the Brexit referendum.\nร.375 ความสัมพันธ์ระหว่างประเทศในละตินอเมรกิา 3 (3-0-6)\nPO 375 International Relations in Latin America\nวิชาบังคับก่อน : สอบได้วชิา ร.280\nศกึษาความสัมพันธ์ระหว่างประเทศของชาติในละตนิอเมริกา และความสัมพันธ์ของประเทศเหล่านี้\nกับประเทศมหาอำนาจและประเทศในภูมิภาคอื่น ๆ ตลอดจนบทบาทของประเทศในภูมิภาคละตินอเมริกา\nในการเมืองโลก\n79 Prerequisites: Have earned credits of PO 280\nExplores international relations of Latin America countries and their relationship with major\npowers and countries in different regions. It includes roles of Latin America countries in global politics.\nร.376 ความสัมพันธ์ระหว่างประเทศในตะวันออกกลาง 3 (3-0-6)\nPO 376 International Relations in Middle East\nวิชาบังคับก่อน : สอบได้วชิา ร.280\nศึกษาความสัมพันธ์ระหว่างประเทศของชาติในตะวันออกกลาง และความสัมพันธ์ของประเทศ\nเหล่านี้กับประเทศมหาอำนาจและประเทศในภูมิภาคอื่น ๆ ตลอดจนบทบาทของประเทศในภูมิภาค\nตะวันออกกลางในการเมืองโลก\nPrerequisites: Have earned credits of PO 280\nExplores international relations of Middle East countries and their relationship with major\npowers and countries in different regions. It includes roles of Middle East countries in global politics.\nร.377 สิ่งแวดล้อมกับความสัมพันธ์ระหว่างประเทศ 3 (3-0-6)\nPO 377 Environment and International Relations\nวิชาบังคับก่อน : สอบได้วชิา ร.280\nหลักการและแนวความคิดเกี่ยวกับความสัมพันธ์ระหว่างประเทศด้านสิ่งแวดล้อม ความเชื่อมโยง\nระหว่างประเด็นปัญหาด้านสิ่งแวดล้อมกับความสัมพันธ์ระหว่างประเทศ กระบวนการทางนโยบาย\nสิ่งแวดล้อมของประเทศต่าง ๆ รวมทั้งประเทศไทย บทบาทขององค์การระหว่างประเทศและองค์กรพัฒนา\nเอกชนระหว่างประเทศ (INGOs) ในเรื่องสิ่งแวดล้อม การค้ากับสิ่งแวดล้อม ความตกลงพหุภาคีด้าน\nสิ่งแวดล้อม (Multilater Environmental Agreements- MEAs) และความร่วมมือระหว่างประเทศในด้านต่าง\nๆ เกี่ยวกับสิ่งแวดล้อม โดยเน้นกรณีศึกษาในปัจจุบัน\nPrerequisite: Have earned credits of PO 280\nPrinciples and concepts of international relations from the environmental aspect; the link\nbetween environmental problems and international relations; environmental policy processes in\ndifferent countries, including Thailand; role of international organisations and international NGOs in\nenvironmental issues; trade and the environment; Multilateral Environmental Agreements (MEAs) and\ninternational cooperation on various environmental issues, focusing on current case studies.\nร.379 พิธีทางการทูตและการกงสุล 3 (3-0-6)\nPO 379 Diplomatic Protocol and Consular Affairs\nวิชาบังคับก่อน : สอบได้วชิา ร.280\nศึกษาวิวัฒนาการของพิธีการทูตและการกงสุลจากสนธิสัญญาระหว่างประเทศ อาทิอนุสัญญา\nกรุงเวียนนาว่าด้วยความสัมพันธ์ทางการทูต ค.ศ. 1961 อนุสัญญาว่าด้วยความสัมพันธ์ทางการกงสุล ค.ศ.\n80 1963 และอนุสัญญาว่าด้วยคณะทูตพิเศษ ค.ศ. 1969 วิชาครอบคลุมเนื้อหาและหลักปฏิบัติเกี่ยวกับ\nภารกิจ หน้าที่ เอกสิทธิ์ และความคุ้มครองทางการทูตและการกงสุลในการทูตร่วมสมัย\nPrerequisite: Have earned credits of PO 280\nStudy the historical evolution of diplomatic protocol and consular affairs through related\ninternational treaties such as Vienna Convention in 1961, in 1963, and in 1969. The course covers\nboth academic knowledge and practices on protocol and consular duties, roles, privileges as well as\nimmunity of the contemporary diplomacy.\nร.383 การเมอืงและการต่างประเทศของจนี 3 (3-0-6)\nPO 383 Chinese Politics and Foreign Affairs\nวิชาบังคับก่อน : สอบได้วชิา ร.280\nศึกษาการเมืองของประเทศจีน โดยวิเคราะห์พัฒนาการ สถาบัน ลักษณะเด่น และข้อท้าทายใน\nการเมืองร่วมสมัย ตลอดจนศึกษาการ ต่างประเทศของจีน ทั้งพัฒนาการ ปัจจัย และตัวแสดงที่มีผลต่อ\nการกำหนดและดำเนินนโยบายต่างประเทศ และประเด็นท้าทายต่าง ๆ โดยมุ่งวิเคราะห์ปฏิสัมพันธ์ระหว่าง\nการเมอืงภายในกับการต่างประเทศ\nPrerequisite: Have earned credits of PO 280\nStudy Chinese politics by analysing evolution, institution, uniqueness and challenges of\ncontemporary politics. The course will also study the international relations of China including\ndevelopment, factors and actors that have impacted on determining, processing foreign policy and\nvarious challenges. It aims at analysing the interaction of domestic politics and foreign affairs\nร.384 การเมอืงและการต่างประเทศของญี่ปุ่น 3 (3-0-6)\nPO 384 Japanese Politics and Foreign Affairs\nวิชาบังคับก่อน : สอบได้วชิา ร.280\nศึกษาการเมืองของประเทศญี่ปุ่น โดยวิเคราะห์พัฒนาการ สถาบัน ลักษณะเด่น และข้อท้าทายใน\nการเมืองร่วมสมัย ตลอดจนศึกษาการ ต่างประเทศของญี่ปุ่น ทั้งพัฒนาการ ปัจจัย และตัวแสดงที่มีผลต่อ\nการกำหนดและดำเนินนโยบายต่างประเทศ และประเด็นท้าทายต่าง ๆ โดยมุ่งวิเคราะห์ปฏิสัมพันธ์ระหว่าง\nการเมอืงภายในกับการต่างประเทศ\nPrerequisite: Have earned credits of PO 280\nStudy Japanese politics by analysing evolution, institution, uniqueness and challenges of\ncontemporary politics. The course will also study the international relations of Japan including\ndevelopment, factors and actors that have impacted on determining, processing foreign policy and\nvarious challenges. It aims at analysing the interaction of domestic politics and foreign affairs\n81 ร.385 การเมอืงและการต่างประเทศของรัสเซีย 3 (3-0-6)\nPO 385 Russian Politics and Foreign Affairs\nวิชาบังคับก่อน : สอบได้วชิา ร.280\nศกึษาการเมืองของประเทศรัสเซีย โดยวิเคราะหพั์ฒนาการ สถาบัน ลักษณะเด่น และข้อท้าทายใน\nการเมอืงร่วมสมัย ตลอดจนศึกษาการต่างประเทศของรัสเซีย ทั้งพัฒนาการ ปัจจัย และตัวแสดงที่มีผลต่อ\nการกำหนดและดำเนินนโยบายต่างประเทศ และประเด็นท้าทายต่าง ๆ โดยมุ่งวิเคราะห์ปฏิสัมพันธ์ระหว่าง\nการเมืองภายในกับการต่างประเทศ\nPrerequisite: Have earned credits of PO 280\nStudy Russian politics by analysing evolution, institution, uniqueness and challenges of\ncontemporary politics. The course will also study the international relations of Russia including\ndevelopment, factors and actors that have impacted on determining, processing foreign policy and\nvarious challenges. It aims at analysing the interaction of domestic politics and foreign affairs\nร.386 การเมอืงและการต่างประเทศของสหรัฐอเมริกา 3 (3-0-6)\nPO 386 U.S. Politics and Foreign Affairs\nวิชาบังคับก่อน : สอบได้วชิา ร.280\nศึกษาการเมืองของประเทศสหรัฐอเมริกา โดยวิเคราะห์พัฒนาการ สถาบัน ลักษณะเด่น และข้อ\nท้าทายในการเมืองร่วมสมัย ตลอดจน ศึกษาการต่างประเทศของสหรัฐอเมริกา ทั้งพัฒนาการ ปัจจัย และ\nตวั แสดงที่มีผลต่อการกำหนดและดำเนินนโยบายต่างประเทศ และ ประเด็นท้าทายต่าง ๆ โดยมุ่งวิเคราะห์\nปฏิสัมพันธ์ระหว่างการเมอืงภายในกับการต่างประเทศ\nPrerequisite: Have earned credits of PO. 280\nStudy U.S. politics by analysing evolution, institution, uniqueness and challenges\nOf contemporary politics. The course will also study the international relations of U.S. including\ndevelopment, factors and actors that have impacted on determining, processing foreign policy and\nvarious challenges. It aims at analysing the interaction of domestic politics and foreign affairs\nร.387 ความสัมพนัธ์ระหว่างประเทศในยุโรป 3 (3-0-6)\nPO 387 International Relations in Europe\nวิชาบังคับก่อน : สอบได้วชิา ร.280\nความสัมพันธ์ระหว่างประเทศต่าง ๆ ในทวีปยุโรป และวิเคราะห์นโยบายต่างประเทศของประเทศ\nเหล่านี้ โดยพิจารณาถึงการรวมกลุ่มของประเทศ เช่น สหภาพยุโรป นาโต้ความร่วมมอื ในด้านต่าง ๆ ของ\nประเทศในทวีปยุโรปและความขัดแย้งระหว่างประเทศที่เกิดขึ้นจากการล่มสลายของลัทธิคอมมิวนิสต์ใน\nยุโรปตะวันออก นอกจากนี้ยังศึกษาบทบาทของกลุ่มประเทศในยุโรปที่มีต่อการเมืองระหว่างประเทศด้วย\nPrerequisite: Have earned credits of PO 280\n82 Relationship between the different European states and analysis of foreign policy of these\ncountries, considering groupings of these countries such as the European Union and NATO;\ncooperation on various issues between European countries and conflict between countries created\nafter the fall of communism in Eastern Europe. The course will also look at the role of Europena states\nin international politics.\nร.388 มหาอำนาจกับระเบียบโลก 3 (3-0-6)\nPO 388 Major Powers and the World Order\nวิชาบังคับก่อน : สอบได้วชิา ร.280\nศึกษาการเมืองของมหาอำนาจในระเบียบโลกตั้งแต่หลังสงครามโลกครั้งที่ 2 โดยเน้นบทบาทของ\nสหรัฐอเมริกา และสหภาพโซเวียตในระเบียบโลกช่วงสงครามเย็น บทบาทของสหรัฐอเมริกาในระเบียบโลก\nช่วงหลังสงครามเย็น และบทบาทของมหาอำนาจใหม่ เช่น จีน รัสเซีย อินเดีย และญี่ปุ่น รวมทั้งพิจารณา\nมโนทัศน์สำคัญ เช่น ระเบียบระหว่างประเทศ ระบบขั้วอำนาจ อำนาจนำ จักรวรรดิสงครามและสันติภาพ\nความขัดแย้ง ความร่วมมือ อุดมการณ์ วัฒนธรรม ต้น รวมทั้งศึกษากรอบการวิเคราะห์และข้อถกเถียง\nที่เกี่ยวข้อง\nPrerequisite: Have earned credits of PO 280\nStudies politics of the major powers in world orders since the end of the Second World War\nwith an emphasis on the roles of the United States and the Soviet Union in the Cold War world order,\nthe roles of the United States in the post-Cold War world order, and the roles of emerging powers\nsuch as China, Russia, India, and Japan. The course also examines important concepts, frameworks\nand arguments such as polarity, order, hegemony, empire, war and peace, conflict, cooperation,\nideology, and culture.\nร.389 ความสัมพันธ์ระหว่างประเทศในเอเชียใต้ 3 (3-0-6)\nPO 389 International Relations in South Asia\nวิชาบังคับก่อน : สอบได้วชิา ร.280\nความสัมพันธ์ระหว่างประเทศของกลุ่มประเทศเอเชียใต้อันประกอบด้วย อินเดีย ปากีสถาน\nอัฟกานิสถาน บังคลาเทศ ศรีลังกา เนปาล ภูฐานและมัลดีฟส์ โดยจะเน้นความสำคัญของกลุ่มประเทศนี้ที่\nมีต่อขบวนการไม่ฝักใฝ่ฝ่ายใด กลุ่มประเทศอัฟริกา ตะวันออกกลาง เอเชียแปซิฟิค และประเทศอื่น ๆ\nตลอดจนศึกษาความร่วมมอื ในการจัดตงั้องค์กร ความร่วมมือในภูมิภาคระหว่างกลุ่มประเทศเอเชยี ใต้ด้าน\nเศรษฐกิจ การเมือง สังคม และความร่วมมือระหว่างกลุ่มเอเชียใต้กับองค์กรภูมิภาคอื่น ๆ เช่น อาเซียน\nเอเปค และสหภาพยุโรป\n83 Prerequisite: Have earned credits of PO 280\nRelationship between states in South Asia, comprising India, Pakistan, Afghanistan,\nBangladesh, SriLanka, Nepal, Bhutan and the Maldives, focusing on the importance of these countries\nin non-alignment movements with states in Africa, the Middle East, the Asia Pacific and other regions.\nThe course will also study cooperation in forming organisations, cooperation within the South Asian\nregion in terms of economy, politics and society as well as cooperation between South Asia and\norganisations of states in other regions, such as ASEAN, APEC and the EU.\nร.393 การวิเคราะหน์ โยบายต่างประเทศ 3 (3-0-6)\nPO 393 Foreign Policy Analysis\nวิชาบังคับก่อน : สอบได้วชิา ร.280\nทฤษฎี แนวความคิด กรอบการวิเคราะห์ และกระบวนการกำหนดนโยบายต่างประเทศโดยทั่วไป\nโดยเน้นถึงปัจจัยต่าง ๆ ทั้งภายในและภายนอก ตลอดจนโครงสร้างหน่วยงาน และระบบการเมืองที่มี\nบทบาทในการกำหนด และดำเนินนโยบายต่างประเทศ รวมทั้งศึกษาถึงผลกระทบต่าง ๆ ที่สำคัญจากการ\nดำเนนินโยบายต่างประเทศด้วย\nPrerequisite: Have earned credits of PO 280\nTheories, concepts, analytical framework and processes of general foreign policy making,\nfocusing on various internal and external factors, departmental structure and political systems that\nimpact on foreign policy making and implementation, as well as the different major effects of foreign\npolicy implementation.\nร.394 ยทุ ธศาสตรศ์ กึษาและความมั่นคงระหว่างประเทศ 3 (3-0-6)\nPO 394 Strategic Studies and International Security\nวิชาบังคับก่อน : สอบได้วชิา ร.280\nแนวคิดยุทธศาสตร์และความมั่นคงระหว่างประเทศ เช่น ความมั่นคงร่วมกัน (Collective Security)\nการป้องกันร่วมกัน (Collective Defense) และ ความมั่นคงโดยร่วมมือกัน (Cooperative Security) รวมทั้ง\nประเด็นความมั่นคงที่สำคัญ ๆ ในภูมิภาคเอเชียแปซิฟิค\nPrerequisite: Have earned credits of PO 280\nConcepts of strategy and international security such as collective security, collective defence\nand cooperative security, as well as important security issues in the Asia Pacific region.\n84 ร.395 สื่อกับการเมอืงโลก 3 (3-0-6)\nPO 395 Media and Global Politics\nวิชาบังคับก่อน : สอบได้วชิา ร.280\nศกึษาบทบาทและอิทธิพลของสื่อที่มตี่อการเมอืงโลก ทั้งสื่อดั้งเดิม และส่อื ใหม่ส่อืกระแสหลักและ\nสื่อกระแสรอง รวมถึงสื่อภาพยนตร์และเพลง ตลอดจนอิทธิพลของรัฐที่มีต่อการกำหนดแนวทางในการ\nนำเสนอเหตุการณ์ของสื่อ โดยแนะนำทฤษฎีที่เกี่ยวข้องกับความสัมพันธ์ระหว่างสื่อกับการเมือง ศึกษา\nลักษณะบทบาท และอิทธิพลของสื่อ ที่มีต่อการกำหนดนโยบาย ต่างประเทศและการเมืองโลกในประเด็น\nต่าง ๆ\nPrerequisite: Have earned credits of PO 280\nExamines the roles and influences of media – traditional and modern, mainstream and\nalternative – in global politics. The covered domain includes movies and music. In addition, the course\nstudies state’s influences on media’s portrayal of events by introducing theories related to the\nrelationship between media and politics. The characteristics, roles, and influences of media on\ninternational policy-making and global politics will also be covered.\nร.396 การทูตและการเจรจาระหว่างประเทศ 3 (3-0-6)\nPO 396 Diplomacy and International Negotiation\nวิชาบังคับก่อน : สอบได้วชิา ร.280\nศึกษาถึงทฤษฎีขั้นตอน ยุทธศาสตร์การเจรจาระหว่างประเทศ ความสำคัญของอำนาจ รวมทั้ง\nปัจจัยทางสังคมและวัฒนธรรมที่มีต่อการเจรจาระหว่างประเทศ โดยเน้นกรณีศึกษาที่สำคัญและการ\nจำลองสถานการณจ์ รงิ\nPrerequisite: Have earned credits of PO 280\nstudy theories, steps and strategies in international negotiation and the importance of power\nas well as social and cultural factors impacting on international negotiation, focusing on case studies\nand simulations.\nร.397 การเมอืงของการพัฒนาระหว่างประเทศและ 3 (3-0-6)\nความรว่มมอืระหว่างประเทศเพื่อการพัฒนา\nPO 397 Politics of International Development and International Development Cooperation\nวิชาบังคับก่อน : สอบได้วิชา ร.280\nศึกษาพัฒนาการ ทฤษฎีและแนวคิดด้านการพัฒนาระหว่างประเทศ นโยบายและปฏิบัติการของ\nการพัฒนาระหว่างประเทศที่ดำเนินการโดยตัวแสดงที่รัฐ และ มิใช่รัฐ ความร่วมมือระหว่างประเทศ\nเพื่อการพัฒนาระหว่างประเทศในกลุ่มเหนือกับกลุ่มใต้ และระหว่างประเทศในกลุ่มใต้ด้วยกันเอง\nPrerequisite: Have earned credits of PO 280\n85 A study of evolution, theories, and approaches of International Development; development\npolicies and practices conducted by state- and non-state- actors; international development\ncooperation between Global North and Global South, as well as among countries in Global South.\nร.398 ประชาสังคมโลก 3 (3-0-6)\nPO 398 Global Civil Society\nวิชาบังคับก่อน : สอบได้วชิา ร.280\nศึกษาพัฒนาการ ทฤษฎีและแนวคิด รวมทั้งศักยภาพและปัญหาของภาคประชาสังคมโลก โดยใช้\nกรณีศึกษา เช่น การท้าทายระบบเศรษฐกิจแนวเสรีนิยมใหม่การบริหารจัดการทรัพยากรร่วม การตอบ\nสองตอ่ปัญหาการเปลี่ยนแปลงสภาพภูมอิากาศ และการตอ่ต้านสงคราม ต้น\nPrerequisite: Have earned credits of PO 280\nA study of evolution, theories, and approaches as well as potential and challenges of global\ncivil society; case studies of global civil society include issues such as challenges to neo-liberal\neconomic world order, natural resources governance, response to climate change, and anti-war\nmovement.\nร.399 ความมั่นคงของมนุษย์ 3 (3-0-6)\nPO 399 Human Security\nศกึษาแนวคิด นโยบายและการปฏิบัติเกี่ยวกับ “ความมั่นคงของมนุษย์” ในบริบทการเมืองโลก โดย\nนำเสนอพัฒนาการทางกระบวนทัศน์ที่ให้กำเนิดแนวคิดเรื่องความมั่นคงของมนุษย์รวมถึงสำรวจประเด็น\nความไม่มั่นคงของมนุษย์ในศตวรรษที่ 21 ตลอดจนนโยบายในการแก้ไขปัญหาดังกล่าว\nStudies concepts and policy practices concerning “human security” in global politics through\nthe examination of conceptual development of human security, problems of human in the 21 st\ncentury and policy responses\nร.474 สัมมนานโยบายต่างประเทศไทย 3 (3-0-6)\nPO 474 Seminar: Thai Foreign Policies\nวิชาบังคับก่อน : สอบได้วชิา ร.280\nศกึษาลักษณะนโยบายและปัจจัยต่าง ๆ ที่ส่งผลกระทบต่อนโยบายต่างประเทศของไทยต่อประเทศ\nมหาอำนาจ และประเทศเพื่อนบ้าน\nPrerequisite: Have earned credits of PO 280\nStudy policy charateristics and various factors affecting Thai foreign policy towards major\npowers and neighbouring countries\n86 ร.476 ทฤษฎีวพิากษ์ในความสัมพันธ์ระหว่างประเทศ 3 (3-0-6)\nPO 476 Critical Theories in International Relations\nวิชาบังคับก่อน : สอบได้วชิา ร.280\nศึกษากรอบแนวความคิด และทฤษฎีความสัมพันธ์ระหว่างประเทศกระแสวิพากษ์ เช่น สรรสร้าง\nนิยม (Constructivism) สตรีนิยม (Feminism) หลังโครงสร้างนิยม (Poststructuralism) หลังอาณานิคมนิยม\n(Postcolonialism) ต้น โดยประยุกต์ทฤษฎีและแนวความคิดกับประเด็นร่วมสมัยในการเมอืงโลก\nPrerequisite: Have earned credits of PO 280\nA study of theories and conceptual frameworks in the critical international relations tradition\nsuch as Constructivism, Feminism, Poststructuralism, and Postcolonialism. The study of theories also\ninvolves application to contemporary issues in global politics.\nร.478 สัมมนาภูมภิาคนิยม 3 (3-0-6)\nPO 478 Seminar: Regionalism\nวิชาบังคับก่อน : สอบได้วิชา ร.280\nศึกษาเปรียบเทียบความร่วมมือและการบูรณาการในระดับภูมิภาค เน้นกรอบการศึกษาในเชิง\nเปรียบเทียบครอบคลุมทั้งมิติทางประวัติศาสตร์ ทฤษฎี และหลักปฏิบัติ เพื่อทำความเข้าใจความเหมือน\nและความต่างของโครงสร้าง เส้นทาง และความเสื่อมถอยของกระแสภูมิภาคนิยม ตลอดจนให้ความสนใจ\nกับอิทธิพลของการบูรณาการเหล่านั้นต่อการเมือง ความมั่นคง เศรษฐกิจ และ สังคมวัฒนธรรมระหว่าง\nประเทศในปัจจุบัน\nPrerequisite: Have earned credits of PO 280\nComparative study of cooperation and integration at regional level by focusing on comparative\nframeworks in history, theories and practices for understanding the commonality and diversity of\ninsttitution, path of development and fall of regionalism trend. The course will also emphasize on the\ninternational impacts of such integration on political, security, economic and socio-cultural dimensions\nat present.\nร.479 สัมมนาปัญหาความขัดแย้งระหว่างประเทศและการแก้ไข 3 (3-0-6)\nPO 479 Seminar: Problems in International Conflicts and Resolutions\nวิชาบังคับก่อน : สอบได้วิชา ร.280\nลักษณะ รูปแบบ และสาเหตุของความขัดแย้งระหว่างประเทศในมิตติ่าง ๆ ระดับต่าง ๆ ตลอดจน\nการแสวงหาแนวทางแก้ไขความขัดแย้งเหล่านั้นทั้งในลักษณะทวิภาคและพหุภาคี\nPrerequisite: Have earned credits of PO 280\nCharacteristics, form and causes of internaitonal conflicts on different issues and at different\nlevels as well as the search for resolutions, both bilaterally and multilaterally.\n87 ร.480 ทฤษฎีความสัมพันธ์ระหว่างประเทศระดับสูง 3 (3-0-6)\nPO 480 Advanced International Relations Theories\nวิชาบังคับก่อน : สอบได้วชิา ร.280\nศกึษาทฤษฎีความสัมพันธ์ระหว่างประเทศอย่างลกึซึ่ง เพื่อทำความเข้าใจฐานคิดและข้อโต้แย้งของ\nสำนักต่าง ๆ ไม่ว่าจะสำนักคิดในกระแสหลักเช่น สภาพจริงนิยม เสรีนิยม มาร์กซิส และสำนักคิด\nทางเลือก เช่น สรรสร้างนิยม สตรีนิยม หลังโครงสร้างนิยม ต้น เพื่อใช้วิเคราะห์นโยบายของประเทศ\nต่าง ๆ ตลอดจนทำความเข้าใจปรากฏการณ์ และ ความพลวัตของ ประเด็นและปัญหาในความสัมพันธ์\nระหว่างประเทศในปัจจุบัน\nPrerequisite: Have earned credits of PO 280\nStudy theories of internaitonal relations in depth for understanding core ideas and various\narguments from diferent schools including the main stream approaches eg. Realism, Liberalism, and\nMarxism as well as the alternative approaches eg. Constructivism, Feminism, and Poststructuralism.\nThe couse aims for analysing policies from various counrties along with understanding phenomena and\ndynamics of issuses and problems in international relations at present.\nร.488 สัมมนาหัวข้อเฉพาะในความสัมพันธ์ระหว่างประเทศ 3 (3-0-6)\nPO 488 Seminar: Selected Topics in International Relations\nวิชาบังคับก่อน : สอบได้วชิา ร.280\nศึกษาปัญหาเฉพาะที่เกี่ยวข้องกับความสัมพันธ์ระหว่างประเทศ ผ่านแนวคิดทฤษฎี และ\nกรณีศกึษา เพื่อทำความเข้าใจต่อความซับซ้อนของการเมอืงระหว่างประเทศ\nPrerequisite: Have earned credits of PO 280\nStudy selected topics concerning international relations through theoretical frameworks and\ncase studies for understanding the complexity of international politics.\nร.489 สัมมนาหัวข้อเฉพาะในเศรษฐกิจการเมอืงระหว่างประเทศ 3 (3-0-6)\nPO 489 Seminar: Selected Topics in International Political Economy\nวิชาบังคับก่อน : สอบได้วชิา ร.280\nศึกษาประเด็นพิเศษที่เกี่ยวข้องกับความสัมพันธ์ระหว่างประเทศ ผ่านแนวคิดทฤษฎี และ\nกรณีศกึษา เพื่อทำความเข้าใจต่อความซับซ้อนของการเมอืง ความมั่นคง และเศรษฐกิจโลก\nPrerequisite: Have earned credits of PO 280\nStudy special issues concerning international relations through theoretical frameworks and\ncase studies for understanding the complexity of global politics, security and economy.\n88 ร.495 สัมมนา : ประชาคมอาเซียน 3 (3-0-6)\nPO 495 Seminar: ASEAN Community\nวิชาบังคับก่อน : สอบได้วชิา ร.280\nศึกษาทฤษฎีพัฒนาการ โครงสร้าง กระบวนการ และกรณีศึกษาเกี่ยวกับอาเซียน รวมทั้ง\nวิเคราะหศั์กยภาพและปัญหาความรว่มมือในมิตกิารเมืองความมั่นคง เศรษฐกิจ สังคมและวัฒนธรรม\nPrerequisite: Have earned credits of PO 280\nStudy theories, evolution, institutional configuration, procedure and case studies concerning\nASEAN. The course will also analyse potential and problems of cooperaiton in political, security,\neconomic and socio-cutural dimensions\nร.496 สัมมนาสงครามโลกศกึษา 3 (3-0-6)\nPO 496 Seminar on World War Studies\nวิชาบังคับก่อน : สอบได้วชิา ร.280\nศึกษาผลกระทบ ประสบการณ์ และมรดกตกทอดของสงครามโลกทั้งสองครั้งที่เกิดขึ้นต่อ\nประชาคมโลกในมิติต่าง ๆ ที่ไม่ได้จำกัดอยู่ในยุโรป ผ่านเอกสารชั้นปฐมภูมิเพื่อสร้างความรู้ความเข้าใจที่\nเกี่ยวกับสงครามโลกในเชิงวิพากษ์\nPrerequisite: Have earned credits of PO 280\nA study of impacts, experiences, and legacies of the two World Wars, which are not exclusive\nto Europe, through primary documents to build a comprehensive understanding of the two World Wars\nfrom a critical perspective.\nร.497 วิทยาศาสตร์และเทคโนโลยีในการเมืองโลก 3 (3-0-6)\nPO 497 Science and Techology in World Politics\nวิชาบังคับก่อน : สอบได้วชิา ร.280\nศกึษาประเด็นทางวิทยาศาสตร์และเทคโนโลยีที่มผีลกระทบต่อการเมืองโลก และการออกแบบ\nนโยบายนวัตกรรมทางด้านวิทยาศาสตร์และเทคโนโลยีของรัฐ อีกทั้งจะพิจารณากรณีศึกษาว่า\nวิทยาศาสตร์และเทคโนโลยีของชาติต่าง ๆ ส่งผลต่อประเด็นความมั่นคง สิ่งแวดล้อม สารสนเทศ การ\nสื่อสาร การเงนิพลังงาน และสุขภาพอย่างไร\nPrerequisite: Have earned credits of PO 280\nA study on how science and technology have impacts on global politics and on\npolicy design on science and technology innovation policy. This course considers different case studies\nof how science and technology policies of different countries affects various issues, including security,\nenvironment, information, communication, finance, energy, and health.\n89 ร.498 รัฐที่มใิช่มหาอำนาจในความสัมพันธ์ระหว่างประเทศ 3 (3-0-6)\nPO 498 Non-Major Powers in International Relations\nวิชาบังคับก่อน : สอบได้วชิา ร.280\nศกึษายุทธศาสตรแ์ ละพฤติกรรมของรัฐที่ไม่ใช่มหาอำนาจ โดยพิจารณา ขอ้จำกัดเชิงโครงสร้างที่\nมีต่อการทูต การเลือกสรรพันธมิตร การดำเนนิยุทธศาสตร์ทางเศรษฐกิจและ soft power ตลอดจนการ\nแสวงหาสถานภาพในสังคมระหว่างประเทศ\nPrerequisite: Have earned credits of PO 280\nA study of strategies and behaviours of non-major powers by focusing on\nstructural limitations on their diplomacy, alignment choices, economic strategy, soft power strategy,\nand status-seeking strategy in international relations.\nร.499 ภูมริัฐศาสตร์ 3 (3-0-6)\nPO 499 Geopolitics\nวิชาบังคับก่อน : สอบได้วชิา ร.280\nศกึษาประวัติพัฒนาการ แนวคิดและแนวทางด้านภูมิรัฐศาสตร์ ปัจจัยทางภูมิรัฐศาสตร์ เชน่\nภูมิศาสตร์ ทรัพยากรธรรมชาติและความหลากหลายทางวัฒนธรรม และอิทธิพลต่อความสัมพันธ์ระหว่าง\nประเทศ การทูต และพฤติกรรมของรัฐ กรณีศกึษาด้านประเด็นและข้อถกเถียงทางภูมริัฐศาสตร์\nPrerequisite: Have earned credits of PO 280\nA study of history, evolution, schools of thought and approaches of geopolitics;\ngeopolitical factors, such as geography, natural resources, and cultural diversity, and the impact on\ninternational relations, diplomacy, and behavior of states; case studies on geopolitical issues and\ndebates\nร.576 การฝกึงานทางการระหว่างประเทศ 3 (0-6-3)\nPO 576 Internship in International Affairs\nวิชาบังคับก่อน : นักศกึษาชั้นปี 3 ขึ้นไป\nส่งเสริมให้นักศึกษามีประสบการณ์ภาคปฏิบัติมีความรู้ความเข้าใจเกี่ยวกับการปฏิบัติงานในสาขา\nการระหว่างประเทศ และสามารถนำความรู้และประสบการณ์จากการฝึกงานไปประยุกต์ใช้ในสภาพการ\nทำงานที่แท้จริง โดยให้นักศึกษาได้เข้าฝึกงานในหน่วยงานราชการ รัฐวิสาหกิจ ภาคเอกชน องค์กรเอกชน\nองค์การระหว่างประเทศ สื่อสารมวลชน สถาบันค้นคว้าวิจัย องค์กรฝ่ายนิติบัญญัติรัฐสภา และพรรค\nการเมือง ฯลฯ โดยประเด็นต่าง ๆ ในการฝึกงานอาจารย์ผู้สอนจะผกู้าหนด ทั้งนี้ เพื่อการฝึกทักษะ\nและสร้างประสบการณ์ในการทำงานในสภาพที่แท้จริง\n90 Prerequisites: Students must be in their 3rd year of study upwards\nThis internship encourages students to gain experience in the field, develop knowledge and\nunderstanding of international affairs work and be able to apply their knowledge and experience in\nreal life. Students will complete an internship in a government office, state enterprise, in the private\nsector, an international organisation, a media organisation, a research institution, a legislative body,\nparliament, a political party etc. Issues for training will be decided by the instructor. The aim is to\npractise skills and build experience of working in the real world.\nรายวิชาโทจากคณะสถาปัตยกรรมศาสตร์และการผังเมือง\nผม. 243 แบบจำลองการวางแผนการใช้ที่ดิน 3 (3-0-6)\nUP 243 Land Use Models\nทฤษฎี แนวความคิด และเทคนิคการวางแผนสำหรับการใช้ประโยชน์ที่ดินประเภทต่างๆและ\nรูปแบบการวางแผนในเขตเมือง ทั้งของประเทศไทยและประเทศต่างๆ ในเชิงเปรียบเทียบ เพื่อให้เกิดความ\nเข้าใจถึงข้อดีข้อเสีย ตลอดจนความเหมาะสม และข้อจำกัดในการประยุกต์ทฤษฎีและแนวความคิดต่างๆ\nเหล่านี้ตลอดจนแนวทางการดำเนินการของประเทศต่างๆ อย่างมีเหตุมีผล และสามารถวิพากษ์รูปแบบ\nการวางแผนการใชที่ดนิ ในประเทศไทยอย่างเหตุผล\nTheories, concepts, and techniques for land use planning are explored. Also, land use models\napplied to urban areas, both in Thailand and abroad will be discussed in a comparative way. Students will\ngain a better understanding of advantages and disadvantages, as well as opportunities and limitations, in\napplying the ideas through sound development actions in various countries, and be enabled to rationally\nanalyze the land use planning in Thailand.\nผม. 252 เศรษฐศาสตร์เมืองเพื่อการวางแผนและผังเมือง 3 (3-0-6)\nUP 252 Urban Economics for Planning\nความรู้พื้นฐานด้านเศรษฐศาสตร์ ทฤษฎีและแนวความคิดด้านเศรษฐศาสตร์เมือง โดยชี้ให้เห็น\nถึงโครงสร้างทางเศรษฐกิจของเมือง ความสัมพันธ์ระหว่างการเจริญเติบโตทางเศรษฐกิจกับการพัฒนา\nเมือง โลกาภิวัตน์ ที่มีผลต่อเศรษฐกิจระดับเมือง แนวความคิดเกี่ยวกับการกำหนดที่ตั้งของกิจกรรมทาง\nเศรษฐกิจของเมืองในสาขา การผลิตและการบริการต่าง ๆ รวมถึงความเชื่อมโยงกับการเติบโตของเมือง\nการเปลี่ยนแปลงการใชป้ระโยชน์ที่ดิน และการพัฒนาโครงสร้างพื้นฐานของเมอืง\nThis course focuses on theories and concepts of urban economics, relation between\neconomic development and urban development, the impacts of globalization to urban economic\nactivity allocation, the impact of industrial growth on urbanization, infrastructure development and the\nchange of land use. It also explores the economics of urban problems such as poverty, inadequate\nhousing, congestion, pollution, and crime.\n91 ผม. 358 สังคมเมืองและการปกครอง 3 (3-0-6)\nUP 358 Urban Society and Governance\nการประยุกต์ทฤษฎีและแนวความคิดทางสังคมวิทยา และองค์กรรัฐ กับการวางแผนพัฒนาเมือง\nโดยการศึกษาครอบคลุมถึงกลุ่มทางสังคม ประชาสังคม และ การมีส่วนร่วม ระบบการปกครอง ส่วนกลาง\nส่วนภูมิภาค และส่วนท้องถิ่นที่เกี่ยวข้องกับการพัฒนาเมอืง รวมถึงการบริหารจัดการภาครัฐ บทบาท อำนาจ\nและหน้าที่ของรัฐในงานผังเมอืงและการจัดใหบ้ริการสาธารณะต่างๆ แก่ประชาชน\nThe course explores theories and concepts in sociology and state agencies related to urban\ndevelopment. Social group, civil society and participation in urban policy and planning will be discussed.\nGovernmental structure of central, regional and local administration, including public administration, state’s\nrole, power and duty in urban policy and planning and public services provision will be explored.\nผม. 463 การพัฒนาและบริหารจัดกำรอสังหารมิทรัพย์ 3 (3-0-6)\nUP 463 Real Estate Development and Management\nแนวความคิดพื้นฐานที่นำไปใช้สำหรับการใช้ประโยชน์จากทรัพยากรที่ดิน เพื่อการพัฒนา\nโครงการอสังหาริมทรัพย์ ความเข้าใจในธุรกิจอสังหาริมทรัพย์ และความสัมพันธ์ที่มีต่อการพัฒนาเศรษฐกิจ\nเมือง กระบวนการลงทุนและดำเนินโครงการซึ่งประกอบด้วย การกำหนดแนวความคิด การวางแผน\nกฎหมายที่เกี่ยวข้อง พฤติกรรมผู้บริโภค การศึกษาความไปได้ทางการตลาดและการเงิน การชำระภาษี\nรวมทั้งหลักการบริหารโครงการซึ่งมคีวามหลากหลาย ครอบคลุมทั้งโครงการประเภทพาณิชยกรรมและพัก\nอาศัย\nThe course emphasizes on fundamental concepts applied in the process of land utilization\nfor real estate development, which give students an insight into real estate business and its inter-\nconnectedness with urban economic development. The course pays attention to the process of\ninvestment and development comprising of conceptual design, project planning, the examination of\nlegal papers and consumer behavior, marketing and financial feasibility and tax payment. Principles of\nmanagement, which are varied according to project types e.g. commercial and residential, are also\nincluded\nผม. 466 การจัดการสิ่งแวดล้อมเมืองและชนบท 3 (3-0-6)\nUP 466 Urban and Rural Environmental Management\nความเชื่อมโยงและพึ่งพาอาศัยซึ่งกันและกันระหว่างเมืองและชนบทในเรื่องการใช้ประโยชน์\nจากทรัพยากร สถานการณ์ปัญหาสิ่งแวดล้อมและการเปลี่ยนแปลงทรัพยากรธรรมชาติในเมืองและชนบท\nบทบาทของหน่วยการบริหารและการปกครองที่ต่างกัน ทั้งในระดับท้องถิ่น จังหวัด อนุภาค ภาคและ\n92 ประเทศต่อการวางแผนสิ่งแวดล้อมและบริหารจัดการทรัพยากรธรรมชาติภายใต้แนวคิดการพัฒนาอย่าง\nยั่งยืน (Sustainable Development) และกระแสการเปลี่ยนแปลงต่างๆ ที่โลกเผชิญอยู่\nThe course emphasizes on the interconnection and dependency between urban and rural\nareas in the aspect of natural resources utilization, environmental problems and the change of natural\nresources in urban and rural areas, the role of administrative organizations in local, provincial, sub-\nregional, regional, and national level on environmental and natural resources management planning\nunder the concept of sustainable development and other challenges the world is facing.\nวิชาบังคับนอกคณะ\nศ.210 เศรษฐศาสตรเ์ บือ้งต้น 3 (3-0-6)\nEC210 Introductory Economics\n(เฉพาะนักศึกษานอกคณะเศรษฐศาสตร์เท่านั้น และจะไม่นับหน่วยกิตให้หากสอบได้วิชา ศ.211 หรือ\nศ.212 หรอืศ.213 หรอืศ.214 ก่อนหรอืหลัง หรอืกาลังศึกษาวิชาเหล่านีอ้ยู่)\nหลักคิดและแนวคิดวิเคราะหท์างเศษฐศาสตรเ์ พื่อการเข้าใจและการตัดสินใจในเรื่องรอบตัวตั้งแต่\nการทำธุรกิจและการดำเนินนโยบายของรัฐบาลผ่านมุมมองทางเศรษฐศาสตร์จุลภาคและมหาภาค ใน\nส่วนเศรษฐศาสตร์จุลภาคจะศกึษาแก่นความคิดทางเศรษฐศาสตรแ์ ละการเข้าใจจากตัวอย่างที่จริงเพื่อ\nเข้าใจการตัดสินใจเลือกภายใต้ข้อจำกัดของผู้บริโภคและผู้ประกอบการ เนื้อหาครอบคลุมหลักการทำงาน\nร่วมกันของอุปสงค์และอุปทานผ่านกลไกตลาดและโครงสร้างตลาดประเภทต่าง ๆ ตั้งแต่ตลาดผูกขาดไป\nถึงตลาดแข่งขันสมบูรณ์ รวมไปถึงแนวคิดความล้มเหลวของตลาดและบทบาทของภาครัฐบาลเพื่อ\nเสริมสร้างสวัสดิการสังคม ในส่วนเศรษฐศาสตร์มหภาคพิจารณาพฤติกรรมในองค์รวม ศึกษาตัววัด\nรายได้ประชาชาติการทำงานของระบบการเงินการธนาคาร การดำเนินนโยบายการเงิน และ นโยบาย\nการคลัง เพื่อรักษาเสถียรภาพและเสริมสร้างการเจริญเติบโตทางเศรษฐกิจ ในภาคต่างประเทศศึกษาถึง\nความสำคัญ ของการค้าและการเงินระหว่างประเทศ และข้อโต้แย้งระหว่างการค้าเสรี และการปกป้อง\nตลาด\n(For non-Economics majors only; credits will not be awarded to students who are taking or have\ncompleted EC211 or EC212 or EC 213 or EC 214)\nThis course introduces the economic method of thinking to better understand real-world decision-\nmaking and improve analytical skills to better understand business and policy concerns. The\nfundamentals of modern economics, the general principles of microeconomics and macroeconomics,\nare introduced. Microeconomics covers how to apply the fundamental economic principles that explain\nwhy individuals and businesses make decisions with limited resources. The interactions of supply and\ndemand in market operations are covered, as well as a variety of market structures ranging from\nmonopoly to perfect competition. Furthermore, the course explores different sorts of failures and how\ngovernment intervention policies might increase social welfare. Microeconomics covers how to apply\n93 the fundamental economic principles that explain why individuals and businesses make decisions with\nlimited resources. The interactions of supply and demand in market operations are covered, as well as\na variety of market structures ranging from monopoly to perfect competition. Furthermore, the course\nexplores different sorts of failures and how government intervention policies might increase social\nwelfare.\nอ.221 การอ่านและการเขียนเชงิบูรณาการ 3 (3-0-6)\nEG 221 Integrated Reading and Writing\nวิชาบังคับก่อน : สอบได้สษ.105 หรือ ได้รับยกเว้น สษ.105 หรือ ได้รับการอนุมัติจากสาขาวิชา\nภาษาอังกฤษ\nทักษะการอ่านบทความหลากหลายประเภท ความสามารถในการวิเคราะห์ ค้นคว้า และสังเคราะห์\nข้อมูลจากแหล่งข้อมูลที่เชื่อถือได้การถอดความ สรุปความและการแสดงความคิดเห็นด้วยการเขียน โดย\nใช้ภาษาของตนเอง\nPrerequisite: have earned credits of EL 105 or exemption or obtained approval by the English\nDepartment\nReading skills for various types of text; ability to analyze, research and synthesize information\nfrom reliable sources; ability to paraphrase, summarize texts and reflect their views in the form of\nwriting in their own words.\nสษ.217 การฟังและการพูดด้านวิชาการ 3 (3-0-6)\nEL 217 Speaking and Listening for Academic Purposes\nการฝึกฝนทักษะการสื่อสารภาษาอังกฤษด้านการพูดและการฟังในบริบททางวิชาการผ่าน\nแหล่งข้อมูลที่หลากหลาย การศึกษาเทคนิคและกลยุทธ์สำหรับการพูดโดยมุ่งเน้นการนำเสนอและการ\nอภปิรายกลุ่ม\nPractice in English oral communication and listening skills for an academic environment from a\nvariety of sources. Study of techniques and strategies for speaking with an emphasis on presentations\nand participation in group discussions.\nสษ.231 ภาษาอังกฤษสำหรับรัฐศาสตร์ 1 3 (3-0-6)\nEL 231 English for Political Science 1\nการศึกษาประเด็นทางรัฐศาสตร์เพื่อพัฒนาทักษะทางภาษาอังกฤษ การประยุกต์ใช้งานวิจัยทาง\nรัฐศาสตร์สมัยใหม่สิ่งพิมพ์ สื่อ และบทความทางรัฐศาสตรเ์ พื่อกำรอภปิราย การนำเสนอ และการสะท้อน\nความคิดภาษาอังกฤษ การศกึษารูปแบบภาษาเชิงเทคนิคที่ใช้ในรัฐศาสตร์ การฝึกการบรรยายแนวคิด\nทางรัฐศาสตร์ การเขียนเล่าปัญหาทางรัฐศาสตร์ การให้ความเห็นเกี่ยวกับจุดยืนทางการเมือง และรวมถึง\nการคิดวิเคราะหใ์ นการแก้ปัญหา\n94 Study of current political issues for the development of English. Application of updated political\nresearch, publications, media and political texts for English discussions, presentations and reflections.\nStudy of different patterns of technical language used in political science. Practice in describing\npolitical concepts, narrating political problems, giving comments on political stances and integrating\ncritical thinking in problem-solving activities.\nสษ.331 ภาษาอังกฤษสำหรับรัฐศาสตร์ 2 3 (3-0-6)\nEL331 English for Political Science 2\nวิชาบังคับก่อน : สอบได้สษ.231\nการศึกษาประเด็นทางรัฐศาสตร์ทั้งในและต่างประเทศที่ทันสมัยและร่วมสมัย การวิเคราะห์ด้วย\nตนเองและการอภิปรายโดยใช้ภาษาอังกฤษในประเด็นทางรัฐศาสตร์ การฝึกการสรุปความ การนำเสนอ\nและความคิด วิเคราะห์ การพัฒนากระบวนการเรียนรู้ทางภาษาด้วยตนเองโดยใช้ส่อืที่ใชใ้นทางรัฐศาสตร์\nPrerequisite: Have earned credits of EL 231\nStudy of current and ongoing national and international political issues. Student-centered\nanalysis and English discussion of political issues. Practice in summarizing, presenting, and critical\nthinking. Development of self-directed language learning using authentic political materials.\n95",
    "หมวดที่ 5": "หมวดที่ 5 การจัดกระบวนการเรียนรู้\nลำดับ ผลลัพธ์การเรียนรู้ของหลักสูตร (PLOs) การจัดกระบวนการเรียนรู้วธิีการวัดและประเมนิผล\nด้านความรู้ (Knowledge)\nK 1 ผู้เรียนมีความรู้พื้นฐานด้านกรอบแนวคิด และทฤษฎีที่บรรยายและสาธิต การสอบภาคทฤษฎี\nเกี่ยวข้องกับการศกึษาทางด้านรัฐศาสตร์ การนำเสนอ/การทำรายงาน\nK 2 ผู้เรียนมีความรู้ความเข้าใจในบริบท และพัฒนาการทาง บรรยายและสาธิต การสอบภาคทฤษฎี\nประวัติศาสตร์ที่เกี่ยวข้องกับการเมอืงการปกครอง การนำเสนอ/การทำรายงาน\nการบริหารรัฐกิจ และการระหว่างประเทศ\nK 3 ผู้เรียนมีความรู้และความเข้าใจในปรากฏการณ์ร่วมสมัย บรรยายและสาธิต การสอบภาคทฤษฎี\nที่เกี่ยวข้องกับการเมืองการปกครอง การบริหารรัฐกิจ การนำเสนอ/การทำรายงาน\nและการระหว่างประเทศ\nK 4 ผเู้รียนมีความรู้เกี่ยวกับสถานะ บทบาท และอำนาจหน้าที่บรรยายและสาธิต การสอบภาคทฤษฎี\nของหน่วยงาน องค์กร หรือตัวแสดงที่เกี่ยวข้องกับ การนำเสนอ/การทำรายงาน\nการเมืองการปกครอง การบริหารรัฐกิจ และการระหว่าง\nประเทศ\nด้านทักษะ (Skills)\nS 1 ผเู้รียนมีทักษะด้านการวิจัย และการปรับประยุกต์ใช้การเรียนแบบ Project Based Learning การนำเสนอ\nเครื่องมือการวิจัยขั้นตน้\nS 2 ผเู้รียนมีทักษะในการคิดวิเคราะหป์ รากฏการณ์ทางสังคม การเรียนแบบ Project Based Learning การประเมินผล และการ\nและการเมอืงอย่างเหตุผล นำเสนอ\nS 3 ผเู้รียนมีทักษะทางการส่อืสารเพื่อการทำงานรว่มกับผอูื่น การเรียนแบบ Project Based Learning การทำรายการ และการ\nนำเสนอ\n96 ลำดับ ผลลัพธ์การเรียนรู้ของหลักสูตร (PLOs) การจัดกระบวนการเรียนรู้วธิีการวัดและประเมนิผล\nS 4 ผเู้รียนมีทักษะทางภาษาทั้งภาษาไทย และภาษาต่าง การเรียนแบบ Project Based Learning การทำรายการ และการ\nประเทศเพื่อการทำงาน หรือเพื่อการศกึษาต่อ นำเสนอ\nS 5 ผเู้รียนมีทักษะด้านเทคโนโลยีสารสนเทศเพื่อปรับ การเรียนแบบ Project Based Learning การทำรายการ และการ\nประยุกต์ใชก้ำรทำงาน นำเสนอ\nด้านจรยิธรรม (Ethic)\nE 1 ผู้เรียนแสดงออกซึ่งความเคารพในสิทธิ และเสรีภาพต่อ การเรียนแบบ Project Based Learning การทำรายการ และการ\nทั้งตนเองและผอูื่น นำเสนอ\nE 2 ผู้เรียนแสดงออกซึ่งความตระหนักในสิทธิและหน้าที่ของ การเรียนแบบ Project Based Learning การทำรายการ และการ\nความพลเมืองที่ดีนำเสนอ\nE 3 ผู้เรียนมีความเข้าใจและปฏิบัติตามหลักคุณธรรม การเรียนแบบ Project Based Learning การทำรายการ และการ\nจริยธรรม กฎหมาย และกติกาอื่น ๆ ที่เกี่ยวข้องกับการ นำเสนอ\nทำงานและการอยู่รว่มกันในสังคม\nด้านลักษณะบุคคล (Character)\nC 1 ผู้เรียนแสดงออกซึ่งการยอมรับและเคารพในความ การเรียนแบบ Project Based Learning การทำรายการ และการ\nแตกต่างหลากหลายของผู้อื่นทั้งในทางความคิดเห็น และ นำเสนอ\nในทางการกระทำ\nC 2 ผเู้รียนแสดงออกซึ่งความมีวุฒิภาวะและความผู้นำทั้ง การเรียนแบบ Project Based Learning การนำเสนอ\nในทางความคิด การทำงาน และการอยู่รว่มกับผอูื่น\nC 3 ผเู้รียนแสดงออกซึ่งความสามารถในการคิดวเิคราะห์ การเรียนแบบ Project Based Learning การนำเสนอ\nและการสื่อสารอย่างสร้างสรรค์\n97",
    "หมวดที่ 6": "หมวดที่ 6 ความพร้อมและศักยภาพในการบริหารจัดการหลักสูตร\nหลักสูตรมีความพร้อมตามกฎกระทรวงมาตรฐานการจัดการศกึษาระดับอุดมศกึษา พ.ศ.\n2565 ข้อ 6 ที่ประกอบด้วย 4 ด้าน ได้แก่\n6.1 ด้านกายภาพ\n6.1.1 ห้องเรียนและห้องปฏิบัติการ\nคณะรัฐศาสตร์ มีห้องบรรยายที่เหมาะสมแก่การจัดการเรียนการสอนด้วยอุปกรณ์\nและเทคโนโลยีสารสนเทศที่ทันสมัย มีเครื่องคอมพิวเตอร์ สำหรับให้นักศึกษาได้ศึกษาค้นคว้าเอกสาร\nข้อมูลเพิ่มเติม และสำหรับใช้ประกอบการเรียนการสอนที่ห้องศูนย์ประมวลข้อมูล ห้องบรรยายและห้อง\nประชุมจะตั้งอยู่ที่อาคารคณะรัฐศาสตร์ทั้งหมด ได้แก่\n1. หอ้งอ่านหนังสือ หอ้งคอมมอ่น และหอ้งกิจกรรม ชั้น 1\n2. หอ้งปฏิบัติการ หอ้งประชุม หอ้งอาจารย์ที่ปรึกษา ชั้น 2\n3. หอ้งปฏิบัติการคอมพิวเตอร์ หอ้งบรรยาย ชั้น 3\n4. หอ้งปฏิบัติการ หอ้งบรรยาย ชั้น 4\n5. หอ้งปฏิบัติการ ชั้น 5\n6.1.2 สิ่งอำนวยความสะดวกเพื่อการเรียนรู้ (เช่น ห้องสมุด ฐานข้อมูลออนไลน์)\nคณะรัฐศาสตร์มีห้องสมุดศาสตราจารย์ดเิรก ชัยนาม คณะรัฐศาสตร์ ซึ่งมีหนังสอื และตำรา\nเรียนภาษาไทย จำนวนประมาณ 17,954 เล่ม และภาษาต่างประเทศ จำนวนประมาณ 32,000 เล่ม และมี\nการจัดหาทรัพยากรการเรียนการสอนเพิ่มเติม เพื่อจัดสรรงบประมาณสำหรับการจัดหาตำรา หนังสือ\nอ้างอิง เพิ่มเติมทุกปีการศึกษา ไว้ในห้องสมุดเพื่อให้นักศึกษาได้รับข้อมูล และความรู้ใหม่จากการศึกษา\nค้นคว้าเพิ่มเติม\n6.2 ด้านวิชาการ\nจำนวนผลงานทางวชิาการ สัดส่วนอาจารย์ : ผลงาน\nจำนวนอาจารย์\nงานวจิัยหรือ ผลงานทางวชิาการอื่น ๆ รวมผลงานทาง\nบทความวจิัย (ชิ้น) เช่น ตำรา หนังสือ/ บทความ วชิาการทั้งหมด ประจำหลักสูตร\nวจิัย อื่น ๆ\nวิชาการอื่น ๆ สิ่งประดิษฐ์ (ชิ้น) (คน)\nต้น (ชิ้น)\n22 0 22 9 22 -\nรวม 2\n98 6.3 ด้านการเงนิ และการบัญชี\n6.3.1 งบอุดหนุนจากคณะ/มหาวิทยาลัย\n- งบประมาณกองทุนค่าธรรมเนียม\n- งบประมาณแผ่นดิน\n6.3.2 ทุนสนับสนุนการศกึษาอาจารย์และนักศกึษา\n- ทุนสนับสนุนการศกึษาต่อระดับปริญญาเอก\n6.3.3 ประมาณการรายได้และค่า ใช้จ่ายนักศกึษาของหลักสูตร\nงบดำเนินการ 33,677,200.00 บาท\nหมวดค่าตอบแทน 28,554,300.00 บาท\nหมวดค่าใช้สอย 4,229,700.00 บาท\nหมวดค่าวัสดุ 893,200.00 บาท\nรวมทั้งสิ้น 33,677,200.00 บาท\nค่าใช้จ่ายต่อหัวนักศกึษาประมาณ 112,257.00 บาท ต่อปี โดยมีการบริหารจัดการ\nโครงการปกติใช้งบประมาณแผน่ดิน และจากงบรายได้หน่วยงาน\n6.4 ด้านการบริหารจัดการ\n6.4.1 จำนวนอาจารย์ (ประจำ/พิเศษ)\nอาจารย์ประจำ 33 คน อาจารย์พิเศษ 1 คน\n6.4.2 จำนวนเจ้าหน้าที่\nหลักสูตร ฯ ได้รับการสนับสนุนเจ้าหน้าที่นักวิชาการศกึษา 4 คน นักแนะแนวการศกึษา\nและอาชีพ 1 คน และเจ้าหน้าที่บริหารงานทั่วไป 1 คน มีการกำหนดคุณสมบัติเฉพาะสำหรับตำแหน่งของ\nบุคลากรสายสนับสนุนตามมาตรฐานกำหนดตำแหน่ง และตามระเบียบการบริหารพนักงานมหาวิทยาลัย\nของมหาวิทยาลัยธรรมศาสตร์ นอกจากนี้ยังส่งเสริมให้บุคลากรสายสนับสนุนได้รับการพัฒนาความรู้ทาง\nวิชาการ\n6.4.3 กำกับดูแลและประเมินผล\nการประเมินและปรับปรุงยุทธศาสตร์ที่วางแผนไว้เพื่อพัฒนาการเรียนการสอนนั้น\nพิจารณาจากตัวผู้เรียน โดยอาจารย์ผู้สอนจะต้องประเมินผู้เรียนในทุก ๆ วิชาว่ามีความเข้าใจหรือไม่ ใน\nการประเมินอาจประเมินจากการทดสอบย่อย การสังเกตพฤติกรรมของนักศึกษา กำรอภปิรายโต้ตอบจาก\nนักศึกษา การตอบคำถามของนักศึกษาในชั้นเรียน เมื่อรวบรวมข้อมูลจากที่กล่าวข้างต้นแล้ว จะสามารถ\nประเมินเบือ้งต้นได้ว่า ผู้เรียนมีความเข้าใจหรือไม่หากวิธีการที่ใช้ไม่สามารถทำให้ผู้เรียนเข้าใจได้อาจารย์\nผู้สอนอาจจะปรับเปลี่ยนวิธีสอน และในการการทดสอบกลางภาคเรียนและปลายภาคเรียน จะสามารถชี้\nวัดได้ว่าผเู้รียนมีความเข้าใจหรือไม่ในเนือ้หาที่ได้สอนไป หากพบว่ามีปัญหาก็จะต้องมีการดำเนินการศึกษา\nเพื่อพัฒนาการเรียนการสอนในโอกาสต่อไป\n99 มคอ.2\n6.5 อาจารย์ผู้รับผิดชอบหลักสูตรและอาจารย์ประจำหลักสูตร\nตำแหน่งทาง สำเร็จการศึกษาจาก\nลำดับที่ชื่อ - สกุล คุณวุฒิสาขาวิชา\nวชิาการ สถาบัน ปีพ.ศ.\n1 รอง ชลิดาภรณ์ ส่งสัมพันธ์ Ph.D. Government The Claremont Graduate School, 2534\nศาสตราจารย์ California, U.S.A.\nM.A. Political Science The Claremont Graduate School, 2532\nCalifornia, U.S.A.\nร.บ. การเมอืงการปกครอง มหาวิทยาลัยธรรมศาสตร์ 2526\n2 รอง ประจักษ์ ก้องกีรติ Ph.D. Department of Political and Social Change Australian National 2556\nศาสตราจารย์ University,Canberra,Australia\nM.A. Political Science Department University of Wisconsin-Madison 2551\nศศ.ม. ประวัติศาสตร์ มหาวิทยาลัยธรรมศาสตร์ 2545\nร.บ. การเมอืงการปกครอง มหาวิทยาลัยธรรมศาสตร์ 2540\n3. รอง อรรถสิทธิ์ พานแก้ว Ph.D. Political Science Georgia State University, U.S.A. 2553\nศาสตราจารย์ M.A. Public Administration Georgia State University, U.S.A. 2547\nร.บ. รัฐประศาสนศาสตร์ จุฬาลงกรณ์มหาวิทยาลัย 2543\nศ.บ. เศรษฐศาสตร์ มหาวิทยาลัยรามคำแหง 2540\n4. รอง ชนินท์ทิรา ณ ถลาง Ph.D. International Development University of Bristol, UK 2550\nศาสตราจารย์ M.A. Devolopment Administration and Planning University of Bristol, UK 2546\nร.บ. ความสัมพันธ์ระหว่างประเทศ จุฬาลงกรณ์มหาวิทยาลัย 2543\n100 มคอ.2\nตำแหน่งทาง สำเร็จการศึกษาจาก\nลำดับที่ชื่อ - สกุล คุณวุฒิสาขาวิชา\nวชิาการ สถาบัน ปีพ.ศ.\n5. รอง สุนิดา อรุณพิพัฒน์ Ph.D. International Public Policy University fo Tsukuba, Japan 2555\nศาสตราจารย์ M.Sc. Politics of the World Econnmy London School of Economics and 2549\nPolitical Science, UK\nM.Phil. Development Studies University of Cambridge, UK 2548\nศศ.ม. เศรษฐศาสตร์แรงงาน จุฬาลงกรณ์มหาวิทยาลัย 2545\nร.บ. รัฐประศาสนศาสตร์ จุฬาลงกรณ์มหาวิทยาลัย 2542\n6. ผชู่วย ประพิมพ์ฝัน เชียงกูล Ph.D. Politics and International Studies University of Warwick, UK. 2558\nศาสตราจารย์ M.A. Political Economy University of Sydney, Australia. 2553\nB.Sc. Economics National University of Singapore, 2551\nSingapore.\n7. รอง ไตรรัตน์ โภคพลำกรณ์ สส.ด. การบริหารสังคม มหาวิทยาลัยธรรมศาสตร์ 2548\nศาสตราจารย์ พบ.ม. รัฐประศาสนศาสตร์ สถาบันบัณฑิตพัฒนบริหารศาสตร์ 2526\nร.บ. บริหารรัฐกิจ มหาวิทยาลัยธรรมศาสตร์ 2523\n8. รอง สุนิสา ช่อแก้ว ปร.ด. การบริหารการพัฒนา สถาบันบัณฑิตพัฒนบริหารศาสตร์ 2556\nศาสตราจารย์ รป.ม. การบริหารทรัพยากรมนุษย์ สถาบันบัณฑิตพัฒนบริหารศาสตร์ 2550\nศศ.บ. รัฐศาสตร์ มหาวิทยาลัยเกษตรศาสตร์ 2548\n101 มคอ.2\nตำแหน่งทาง สำเร็จการศึกษาจาก\nลำดับที่ชื่อ - สกุล คุณวุฒิสาขาวิชา\nวชิาการ สถาบัน ปีพ.ศ.\n9. อาจารย์ นาอีม แลนิ Ph.D. Spatial Planning and Environment University of Groningen, the 2564\nNetherlands\nM.Sc. Spatial Sciences (Research) University of Groningen, the 2560\nNetherlands\nร.บ. การเมอืงและการระหว่างประเทศ มหาวิทยาลัยธรรมศาสตร์ 2557\n102",
    "หมวดที่ 7": "หมวดที่ 7 การประเมินผลการเรียนและเกณฑ์การสำเร็จการศึกษา\n7.1 การประเมินผลการเรียนของนักศกึษา\n7.1.1 การประเมินผลการเรียน\nให้ไปตามข้อบังคับมหาวิทยาลัยธรรมศาสตร์ ว่าด้วยการศึกษาระดับปริญญาตรีพ.ศ. 2561\nข้อ 35 – 48\n7.1.2 กฎระเบียบหรอืหลักเกณฑ์ในการให้ระดับคะแนน (เกรด)\n7.1.2.1 การวัดผล ให้ไปตามข้อบังคับมหาวิทยาลัยธรรมศาสตร์ ว่าด้วยการศึกษาระดับ\nปริญญาตรีพ.ศ. 2561 ข้อ 35 – 48\n7.1.2.2 การวัดผลการศึกษาแบ่ง 8 ระดับ ซึ่งผลการศึกษารายวิชาที่มีค่าระดับและนำมา\nคำนวณระดับคะแนนเฉลี่ย มีอักษร ความหมาย และค่าระดับ ดังนี้\nอักษร ความหมาย ความหมาย ค่าระดับ\nภาษาอังกฤษ\nA ผลการประเมินขนั้ชั้นเลิศ Excellent 4.0\nB+ ผลการประเมินขนั้ดีมาก Very Good 3.5\nB ผลการประเมินขนั้ดี Good 3.0\nC+ ผลการประเมินขนั้ดีพอใช้ Almost Good 2.5\nC ผลการประเมินขนั้พอใช้ Fair 2.0\nD+ ผลการประเมินขนั้ค่อนข้าง Almost Fair 1.5\nอ่อน\nD ผลการประเมินขนั้อ่อน Poor 1.0\nF ผลการประเมินขนั้ตก Failed 0\n7.1.2.3 รายวิชาที่นักศึกษาได้ค่าระดับไม่ว่าค่าระดับใดตามวรรคแรกและไม่ว่าจะรายวิชาบังคับ\nหรือรายวิชาเลือกให้นำมาคำนวณค่าระดับเฉลี่ยสำหรับภาคและค่าระดับเฉลี่ยสะสมทุกครั้งไป ในกรณีที่\nนักศึกษาจดทะเบียนศึกษารายวิชาภาคฤดูร้อน ให้ถือว่าผลการศึกษาภาคฤดูร้อนส่วนหนึ่งของผล\nการศึกษาในภาคสอง และให้นำค่าระดับของทุกรายวิชาที่ศึกษาไปคำนวณระดับเฉลี่ยสำหรับภาครวมกับ\nค่าระดับของรายวิชาที่ศึกษาในภาคสองและให้ถือว่าค่าระดับเฉลี่ยสำหรับภาคสอง อย่างไรก็ดีหาก\nนักศึกษาถูกถอนชื่อออกจากทะเบียนนักศึกษาเนื่องจากผลการศึกษาในภาคสองให้การจดทะเบียนศึกษา\nรายวิชาในภาคฤดูร้อนนนั้ อันใชบั้งคับมิได้\n7.1.3 กระบวนการทวนสอบมาตรฐานผลสัมฤทธิ์ของนักศกึษา\n7.1.3.1 การทวนสอบมาตรฐานผลการเรียนรู้ขณะนักศึกษายังไม่สำเร็จการศกึษา\nการทวนสอบผลการเรียนรแู้ต่ละรายวิชาของหลักสูตร สามารถทวนสอบได้หลายวิธี เช่น ทวนสอบ\nจากคะแนนสอบข้อเขียน จากงานที่มอบหมาย โดยมีกระบวนการแตล่ะรายวิชาอาจแตกต่างกันขึน้อยู่กับ\nลักษณะของแต่ละวิชา\n103 7.1.3.1 การทวนสอบมาตรฐานผลการเรียนรู้หลังจากนักศกึษาสำเร็จการศกึษา\nวิธีการทวนสอบมาตรฐานผลการเรียนรู้ของนักศึกษาหลังจากสำเร็จการศึกษา เพื่อนำมาปรับปรุง\nหลักสูตรและปรับปรุงกระบวนการเรียนการสอน มดีังตอ่ ไปนี้\n7.1.3.1.1 การประเมินการได้งานทำของบัณฑิตและความพึงพอใจของผู้ใช้บัณฑิต โดย\nจัดทำแบบสอบถามไปยังบัณฑติ\n7.1.3.1.2 ตรวจสอบความพึงพอใจของผู้ใช้บัณฑิต โดยจัดทำแบบสอบถามตามกรอบ\nมาตรฐานการเรียนรสู่งไปยังผใู้ช้บัณฑิต เพื่อประเมินความพึงพอใจในบัณฑติ\n7.1.3.1.3 ความเห็นจากผู้ทรงคุณวุฒิภายนอก ที่มาประเมินหลักสูตร หรืออาจารย์\nพิเศษ ต่อความพร้อมของนักศึกษาในการเรียน และคุณสมบัติอื่นๆ ที่เกี่ยวข้องกับกระบวนการเรียนรู้ และ\nการพัฒนาองค์ความรขู้องนักศึกษา\n7.1.4 การทวนสอบระดับรายวิชา\nคณะรัฐศาสตร์ กำหนดให้ทุกหลักสูตรจะต้องจัดทำการทวนสอบในระดับรายวิชา ซึ่งผู้สอน\nสามารถทวนเพื่อประเมินผลการเรียนรู้ของนักศึกษาได้หลายลักษณะตามความเหมาะสมของลักษณะวิชา\nเช่น การจัดสอบข้อเขียน การจัดทำรายงาน ฯลฯ โดยจะต้องแจ้งให้นักศึกษาทราบล่วงหน้า ทั้งนี้\nมหาวิทยาลัยและคณะกำหนดให้มีกระบวนการอุทธรณ์การประเมินผลสัมฤทธิ์ของนักศกึษาได้\n7.1.5 การทวนสอบมาตรฐานผลการเรียนรู้\nหลักสูตรรัฐศาสตรบัณฑิต กำหนดให้มีระบบและกลไกการทวนสอบเพื่อยืนยันว่าผู้สำเร็จ\nการศกึษาทุกคนมผีลการเรียนรู้ในสาขาวิชาหลักตามที่กำหนดไว้ในหลักสูตร\n7.1.6 การทวนสอบระดับหลักสูตร\nเพื่อตรวจสอบผลสัมฤทธิ์การเรียนรู้ครอบคลุมสาขาวิชาหลักตามที่หลักสูตรกำหนดและให้ไป\nตามมาตรฐานของหลักสูตร โดยจัดให้มีการประเมินจากหลายแหล่ง ด้วยการจัดทำแบบสอบถาม ความ\nพึงพอใจ ของผู้ใช้บัณฑิต เช่น นายจ้างของบัณฑิต ต้น และจัดทำแบบสอบถามบัณฑิตเมื่อจบ\nการศกึษาเพื่อประเมินหลักสูตร\n7.2 เกณฑ์การสำเร็จการศึกษาตามหลักสูตร\n7.2.1 ได้ศึกษารายวิชาต่าง ๆ ครบตามโครงสร้างหลักสูตรและมีหนว่ยกิตสะสมไม่ต่ำกว่า 129 หน่วยกิต\n7.2.2 ได้ค่าระดับเฉลี่ยสะสมไม่ต่ำกว่า 2.00 (จากระบบ 4 ระดับคะแนน)\n7.2.3 ต้องปฏิบัติตามเง่อืนไขอื่น ๆ ที่คณะและมหาวิทยาลัยธรรมศาสตร์กำหนด\n104",
    "หมวดที่ 8": "หมวดที่ 8 การประกันคณุ ภาพหลักสตู ร\nใช้ระบบประกันคุณภาพการศกึษาตามที่สภามหาวิทยาลัยเห็นชอบ\nหมวดที่ 9 ระบบและกลไกในการพัฒนาหลักสูตร\n9.1 ผลการรับฟังความคดิ เห็นจากผู้ใช้บัณฑติผู้เรยีน และนักเรยีนท่ตี้องการเข้าศึกษาในหลักสูตร\nคณะและหลักสูตรมีการจัดรับฟังความคิดเห็นและปรึกษาหารือระหว่างผู้เรียน บัณฑิต ผู้ปกครอง\nและผู้ใช้บัณฑิต ซึ่งกระทำผ่านรูปแบบการสื่อสารสองทางที่ทางการและไม่ทางการ\nเชน่คณะกรรมการแนะแนวและให้คำปรึกษา คณะกรรมการนักศกึษา การจัด Happy Hour ซึ่งการพบ\nกันระหว่างูผ้บริหารกับนักศึกษา คณะกรรมการประจำคณะที่ศิษย์เก่า และการออกไปนิเทศงานยัง\nสถานประกอบการ/หน่วยงานที่รับนักศึกษาไปฝึกงาน เพื่อนำมาปรับปรุงหลักสูตรให้ตอบสนองความ\nต้องการของูผ้เรียนในปัจจุบันและตลาดแรงงาน\nทั้งนี้ผลการรับฟังความคิดเห็นในภาพรวม พบว่า ความเห็นของทุกกลุ่มสอดคล้องไปในแนวทาง\nเดียวกัน กล่าวคือ หลักสูตรการเรียนการสอนที่มีคุณภาพ โดยสามารถสะท้อนผ่านนักศึกษาและ\nบัณฑิตที่มีคุณภาพ มีความรู้ความเชี่ยวชาญสามารถปฎิบัติงานได้จริง ทั้งนี้สอดรับกับการมีงานรองรับ\nหลังเรียนจบจากหลักสูตร อย่างไรก็ตาม มีประเด็นความท้าทายที่ต้องการให้เกิดการพัฒนา โดยเกี่ยวโยง\nกับการแข่งขันในตลาดแรงงานที่ไม่สามารถจำกัดการพิจารณาเพียงแค่ในประเทศไทยเท่านั้น แต่ควรขยาย\nขอบเขตการตอบสนองความท้าทายในตลาดแรงงานระดับภูมิภาคเอเชียจนถึงระดับโลกด้วย\n9.2 การวเิคราะห์ความเสี่ยงและผลกระทบภายนอก\nคณะและหลักสูตรมีกระบวนการในการบริหารจัดการความเสี่ยงในเรื่องหลักสูตร โดยมีการแตง่ตั้ง\nคณะกรรมการความเสี่ยง และคณะกรรมการย่อยชุดต่าง ๆ เพื่อทำหน้าที่ดูแล ตรวจสอบผลการ\nดำเนินงาน และแก้ไขปัญหาด้านการเรียนการสอน ตลอดจนคณะกรรมการจะรับฟังความเห็นของทุกกลุ่ม\nที่เกี่ยวข้อง เพือ่ดำเนนิการปรับปรุงหลักสูตร ให้ตอบสนองต่อความตอ้งการและการเปลี่ยนแปลงที่เกิดขึ้น\nทั้งนี้ความเสี่ยงสำคัญจากการรับฟังความเห็นและนำมาใช้ในการวิเคราะห์ คือ หลักสูตร\nการศึกษาที่เชื่อมโยงกับรัฐศาสตร์มีการแข่งขันกันสูง โดยไม่เพียงการแข่งขันในประเทศเท่านั้น แต่การ\nแข่งขันในระดับภูมิภาคและระดับสากลทวีความสำคัญมากขึ้นเรื่อย ๆ ซึ่งส่งผลให้การปรับปรุงหลักสูตร\nต้องคานงึถึงการตอบสนองต่อตลาดแรงงานที่ขยายวงออกจากระดับประเทศให้มากขึ้น\n9.3 ผลการดำเนินงานของหลักสูตร/ผลการประกันคุณภาพการศึกษา\nการประเมินหลักสูตรในภาพรวม\nจัดทำแบบประเมินให้บัณฑิตตอบประเมินความพึงพอใจในหลักสูตร นอกจากนี้ยังส่ง\nแบบสอบถามไปยังผู้ใช้บัณฑิตเพื่อประเมินความพึงพอใจในการการปฏิบัติงานของบัณฑิต โดยแบบ\nประเมินเหล่านี้จะประเมินในเรื่องของการนำความรู้ไปประยุกต์ใช้ในการปฏิบัติของบัณฑิต ฯลฯ เพื่อที่จะ\nนำผลการประเมินมาใช้ในการปรับปรุงพัฒนาหลักสูตร\n105",
    "หมวดที่ 9": "หมวดที่ 8 การประกันคณุ ภาพหลักสตู ร\nใช้ระบบประกันคุณภาพการศกึษาตามที่สภามหาวิทยาลัยเห็นชอบ\nหมวดที่ 9 ระบบและกลไกในการพัฒนาหลักสูตร\n9.1 ผลการรับฟังความคดิ เห็นจากผู้ใช้บัณฑติผู้เรยีน และนักเรยีนท่ตี้องการเข้าศึกษาในหลักสูตร\nคณะและหลักสูตรมีการจัดรับฟังความคิดเห็นและปรึกษาหารือระหว่างผู้เรียน บัณฑิต ผู้ปกครอง\nและผู้ใช้บัณฑิต ซึ่งกระทำผ่านรูปแบบการสื่อสารสองทางที่ทางการและไม่ทางการ\nเชน่คณะกรรมการแนะแนวและให้คำปรึกษา คณะกรรมการนักศกึษา การจัด Happy Hour ซึ่งการพบ\nกันระหว่างูผ้บริหารกับนักศึกษา คณะกรรมการประจำคณะที่ศิษย์เก่า และการออกไปนิเทศงานยัง\nสถานประกอบการ/หน่วยงานที่รับนักศึกษาไปฝึกงาน เพื่อนำมาปรับปรุงหลักสูตรให้ตอบสนองความ\nต้องการของูผ้เรียนในปัจจุบันและตลาดแรงงาน\nทั้งนี้ผลการรับฟังความคิดเห็นในภาพรวม พบว่า ความเห็นของทุกกลุ่มสอดคล้องไปในแนวทาง\nเดียวกัน กล่าวคือ หลักสูตรการเรียนการสอนที่มีคุณภาพ โดยสามารถสะท้อนผ่านนักศึกษาและ\nบัณฑิตที่มีคุณภาพ มีความรู้ความเชี่ยวชาญสามารถปฎิบัติงานได้จริง ทั้งนี้สอดรับกับการมีงานรองรับ\nหลังเรียนจบจากหลักสูตร อย่างไรก็ตาม มีประเด็นความท้าทายที่ต้องการให้เกิดการพัฒนา โดยเกี่ยวโยง\nกับการแข่งขันในตลาดแรงงานที่ไม่สามารถจำกัดการพิจารณาเพียงแค่ในประเทศไทยเท่านั้น แต่ควรขยาย\nขอบเขตการตอบสนองความท้าทายในตลาดแรงงานระดับภูมิภาคเอเชียจนถึงระดับโลกด้วย\n9.2 การวเิคราะห์ความเสี่ยงและผลกระทบภายนอก\nคณะและหลักสูตรมีกระบวนการในการบริหารจัดการความเสี่ยงในเรื่องหลักสูตร โดยมีการแตง่ตั้ง\nคณะกรรมการความเสี่ยง และคณะกรรมการย่อยชุดต่าง ๆ เพื่อทำหน้าที่ดูแล ตรวจสอบผลการ\nดำเนินงาน และแก้ไขปัญหาด้านการเรียนการสอน ตลอดจนคณะกรรมการจะรับฟังความเห็นของทุกกลุ่ม\nที่เกี่ยวข้อง เพือ่ดำเนนิการปรับปรุงหลักสูตร ให้ตอบสนองต่อความตอ้งการและการเปลี่ยนแปลงที่เกิดขึ้น\nทั้งนี้ความเสี่ยงสำคัญจากการรับฟังความเห็นและนำมาใช้ในการวิเคราะห์ คือ หลักสูตร\nการศึกษาที่เชื่อมโยงกับรัฐศาสตร์มีการแข่งขันกันสูง โดยไม่เพียงการแข่งขันในประเทศเท่านั้น แต่การ\nแข่งขันในระดับภูมิภาคและระดับสากลทวีความสำคัญมากขึ้นเรื่อย ๆ ซึ่งส่งผลให้การปรับปรุงหลักสูตร\nต้องคานงึถึงการตอบสนองต่อตลาดแรงงานที่ขยายวงออกจากระดับประเทศให้มากขึ้น\n9.3 ผลการดำเนินงานของหลักสูตร/ผลการประกันคุณภาพการศึกษา\nการประเมินหลักสูตรในภาพรวม\nจัดทำแบบประเมินให้บัณฑิตตอบประเมินความพึงพอใจในหลักสูตร นอกจากนี้ยังส่ง\nแบบสอบถามไปยังผู้ใช้บัณฑิตเพื่อประเมินความพึงพอใจในการการปฏิบัติงานของบัณฑิต โดยแบบ\nประเมินเหล่านี้จะประเมินในเรื่องของการนำความรู้ไปประยุกต์ใช้ในการปฏิบัติของบัณฑิต ฯลฯ เพื่อที่จะ\nนำผลการประเมินมาใช้ในการปรับปรุงพัฒนาหลักสูตร\n105 การประเมินผลการดำเนินงานตามรายละเอียดหลักสูตร\nการประเมินคุณภาพการศึกษาประจำปี โดยคณะกรรมการประเมินอย่างน้อย 3 คน ประกอบด้วย\nผู้ทรงคุณวุฒิในสาขาวิชาอย่างน้อย 1 คน ทั้งนี้มหาวิทยาลัยได้กำหนดให้ทุกหลักสูตรมีการพัฒนา\nหลักสูตรให้ทันสมัย แสดงการปรับปรุงดัชนีด้านมาตรฐานและคุณภาพ การศึกษาระยะ ๆ อย่างน้อย\nทุก ๆ 3 ปี และมีการประเมิน เพื่อพัฒนาหลักสูตรฯ อย่างตอ่ เนื่องทุก 5 ปี\nการทบทวนผลการประเมินและวางแผนปรับปรุง\nจากการรวบรวมข้อมูล จะทำให้ทราบปัญหาของการบริหารหลักสูตรทั้งในภาพรวม และในแต่ละ\nรายวิชากรณีที่พบปัญหาของรายวิชาก็สามารถที่จะดำเนินการปรับปรุงรายวิชานั้น ๆ ได้ทันทีซึ่งก็จะ\nการปรับปรุงย่อย ในการปรับปรุงย่อยนั้นควรทำได้ตลอดเวลาที่พบปัญหา สำหรับการปรับปรุงหลักสูตรทั้ง\nฉบับนั้น จะกระทำทุก 5 ปีทั้งนี้เพื่อให้หลักสูตรมีความทันสมัยและสอดคล้องกับความต้องการของผู้ใช้\nบัณฑติ\n9.4 แผนปรับปรุงและพัฒนาหลักสูตร\nการพัฒนาหลักสูตร วิธีการดำเนินการ\nจุดเด่น\n1) พัฒนาหลักสูตรและเนื้อหาสาระของ 1) ปรับปรุงหลักสูตรให้ทันสมัยโดยมีการพิจารณา\nรายวิชาให้มีความทันสมัย ก้าวทัน ปรับปรุงหลักสูตรทุก ๆ 5 ปี\nความก้าวหน้าที่มีการเปลี่ยนแปลง 2) จัดแนวทางการเรียนให้ไปตามกรอบ\nตลอดเวลา มาตรฐานคุณวุฒิระดับอุดมศึกษา รวมทั้ง\n2) ผลิตนักศึกษาที่ดีมีความผู้นำทาง ส่งเสริมให้นักศึกษาได้รับความที่ทันสมัยด้วย\nวิชาการ มีความรู้ความสามารถใน ตนเอง\nวิชาการที่ทันสมัย 3) ปรับปรุงหลักสูตรให้มีความทันสมัย โดย\n3) ตรวจสอบ ปรับปรุง และพัฒนา ดำเนินการปรับปรุงหลักสูตรตามระยะเวลาที่\nหลักสูตรใหมี้คุณภาพและทันสมัย กำหนด\n4) มีการประเมินมาตรฐานหลักสูตร 4) มีการประเมินหลักสูตรโดยคณะกรรมการ\nประเมินหลักสูตรทุก 5 ปี\nจุดด้อย\n1) สถานการณ์ภายนอกในสภาวะปัจจุบัน 1) ปรับปรุงหลักสูตร ด้วยการปรับเนื้อหาวิชาที่\nมีอิทธิพลต่อการพัฒนาหลักสูตร โดย เกี่ยวกับความรู้ต่าง ๆ ให้มีความทันสมัยมาก\nมุ่งหวังผลิตบัณ ฑิตที่มีความรู้ยิ่งขึ้น\nความสามารถมากขึน้\n106 ภาคผนวก\nภาคผนวก 1 ผลงานทางวิชาการ (ย้อนหลัง 5 ปี) ของอาจารย์ผู้รับผิดชอบหลักสูตรและอาจารย์\nประจำหลักสูตร\nรศ.ดร.ชลิดาภรณ์ ส่งสัมพันธ์\nบทความวิจัยหรือบทความวิชาการที่ตีพิมพ์ในวารสารวิชาการระดับนานาชาติที่มีอยู่ในฐานข้อมูล\nตามประกาศ ก.พ.อ. หรือระเบียบคณะกรรมการการอุดมศึกษาว่าด้วย หลักเกณฑ์การพิจารณา\nวารสารทางวชิาการสำหรับการเผยแพร่ผลงานทางวชิาการ พ.ศ.2556; 1.0\nJanyam S., Phuengsamran D., Pangnongyang J., Saripra W., Jitwattanapataya L., Songsamphan C.,\nBenjarattanaporn P., and Gopinath D. (2020). Protecting sex workers in thailand during the\ncovid-19 pandemic: opportunities to build back better. WHO South-East Asia journal of public\nhealth. 9(2):100-103.https://doi.org/10.4103/2224-3151.294301\nรศ.ดร.ประจักษ์ ก้องกีรติ\nบทความวิจัยหรือบทความวิชาการที่ตีพิมพ์ในวารสารวิชาการระดับนานาชาติที่มีอยู่ในฐานข้อมูล\nตามประกาศ ก.พ.อ. หรือระเบียบคณะกรรมการการอุดมศึกษาว่าด้วย หลักเกณฑ์การพิจารณา\nวารสารทางวชิาการสำหรับการเผยแพร่ผลงานทางวชิาการ พ.ศ.2556; 1.0\nKongkirati P. (2019). Overview: political earthquakes. Contemporary Southeast Asia:\nA Journal of International and Strategic Affairs. 41(2).163–169.\nบทความวิจัยหรือบทความวิชาการที่ตีพิมพ์ในวารสารวิชาการระดับนานาชาติที่มีอยู่ในฐานข้อมูล\nตามประกาศ ก.พ.อ. หรือระเบียบคณะกรรมการการอุดมศึกษาว่าด้วย หลักเกณฑ์การพิจารณา\nวารสารทางวิชาการสำหรับการเผยแพร่ผลงานทางวิชาการ พ.ศ.2556 แต่สถาบันนำเสนอสภา\nสถาบันอนุมัติและจัดทำประกาศให้ทราบการทั่วไป และแจ้งให้กพอ./กกอ. ทราบภายใน\n30 วันนับแต่วันที่ออกประกาศ (ซึ่งไม่อยู่ใน Beall's list) หรือตีพิมพ์ในวารสารวิชาการที่ปรากฏใน\nฐานข้อมูล TCI กลุ่มที่ 1; 0.8\nหทัยกาญจน์ ตรีสุวรรณ และประจักษ์ ก้องกีรติ. (2562). การเมืองวัฒนธรรมของการออกเสียง\nประชามตริ่างรัฐธรรมนูญ พ.ศ. 2559. วารสารการเมอืงการปกครอง, 9(1), 210-228.\n107 รศ.ดร.อรรถสิทธิ์ พานแก้ว\nบทความวิจัยหรือบทความวิชาการที่ตีพิมพ์ในวารสารวิชาการระดับนานาชาติที่มีอยู่ในฐานข้อมูล\nตามประกาศ ก.พ.อ. หรือระเบียบคณะกรรมการการอุดมศึกษาว่าด้วย หลักเกณฑ์การพิจารณา\nวารสารทางวชิาการสำหรับการเผยแพร่ผลงานทางวชิาการ พ.ศ.2556; 1.0\nPankaew A. and Kaewkhunok S. (2022). The new equation of south asia region: the rising role of\nchina in nepal's foreign policy. International Area Studies Review .25(2). 121–137.\nhttps://doi.org/10.1177/22338659211072940\nPankaew A., Thananithichot S., and Satidporn W. (2022). Determinants of political participation in\nthailand: an analysis of survey data (2002-2014). Asian Politics & Policy. 14(1). 92–113.\nhttps://doi.org/10.1111/aspp.12625\nรศ.ดร.ชนินท์ทิรา ณ ถลาง\nบทความวิจัยหรอืบทความวิชาการท่ตีพมิพ์ในวารสารวชิาการระดับนานาชาติที่มีอยู่ในฐานข้อมูล\nตามประกาศ ก.พ.อ. หรือระเบียบคณะกรรมการการอุดมศึกษาว่าด้วย หลักเกณฑ์การพิจารณา\nวารสารทางวิชาการสำหรับการเผยแพร่ผลงานทางวิชาการ พ.ศ.2556; 1.0\nEun, Y.-S., Acharya, A., na Thalang, C. (2022). Unpacking the dynamics of weak states’ agency.\nPacific Review, 35(2), 229–244.\nna Thalang, C. (2 0 2 2). Making sense of Thailand’s agency in changing global and regional\nenvironments. Pacific Review, 2022, 35(2), 245–268.\nna Thalang, C. (2 0 2 2). Advancing Global IR from a Thai Perspective: Opportunities for Pre-\ntheorization and Conceptualization. Contemporary Southeast Asia: A Journal of\nInternational and Strategic Affairs, 44(2), 250-273.\nna Thalang, C. (2022). Conclusion: The State of IR in Southeast Asia—Heavily Western but\nStill Evolving. Contemporary Southeast Asia: A Journal of International and Strategic Affairs,\n44(2), 315-335.\nรศ.ดร.สุนิดา อรุณพิพัฒน์\nบทความวิจัยหรือบทความวิชาการที่ตีพิมพ์ในวารสารวิชาการระดับนานาชาติที่มีอยู่ในฐานข้อมูล\nตามประกาศ ก.พ.อ. หรือระเบียบคณะกรรมการการอุดมศึกษาว่าด้วย หลักเกณฑ์การพิจารณา\nวารสารทางวชิาการสำหรับการเผยแพร่ผลงานทางวชิาการ พ.ศ.2556; 1.0\nSunida Aroonpipat. (2020). Contending eurocentric theories: the case study of Thailand's\neconomic regionalism in ASEA. Asian Journal of Political Science, 28(2), 164-191.\n108 Sunida Aroonpipat. (2018). Governing aid from China through embedded informality:\nInstitutional response to Chinese development aid in Laos. China Information, 32(1),46-68.\nบทความวิจัยหรือบทความวิชาการที่ตีพิมพ์ในวารสารวิชาการระดับนานาชาติที่มีอยู่ในฐานข้อมูล\nตามประกาศ ก.พ.อ. หรือระเบียบคณะกรรมการการอุดมศึกษาว่าด้วย หลักเกณฑ์การพิจารณา\nวารสารทางวิชาการสำหรับการเผยแพร่ผลงานทางวิชาการ พ.ศ.2556 แต่สถาบันนำเสนอสภา\nสถาบันอนุมัติและจัดทำประกาศให้ทราบการทั่วไป และแจ้งให้กพอ./กกอ. ทราบภายใน\n30 วันนับแต่วันที่ออกประกาศ (ซึ่งไม่อยู่ใน Beall's list) หรือตีพิมพ์ในวารสารวิชาการที่ปรากฏใน\nฐานข้อมูล TCI กลุ่มที่ 1; 0.8\nสุนิดา อรุณพิพัฒน์. (2565). ยุทธศาสตร์ Belt and Road Initiative ของจีน และ ยุทธศาสตร์ Free and\nOpen Indo-Pacific ของญี่ปุ่น กับการปรับแนวทางการให้ความช่วยเหลือเพื่อการพัฒนา อย่าง\nทางการ. วารสารเครือข่ายญี่ปุ่นศกึษา, 12(1), 57-81.\nผศ.ดร.ประพิมพ์ฝัน เชียงกูล\nบทความวิจัยหรือบทความวิชาการที่ตีพิมพ์ในวารสารวิชาการระดับนานาชาติที่มีอยู่ในฐานข้อมูล\nตามประกาศ ก.พ.อ. หรือระเบียบคณะกรรมการการอุดมศึกษาว่าด้วย หลักเกณฑ์การพิจารณา\nวารสารทางวชิาการสำหรับการเผยแพร่ผลงานทางวชิาการ พ.ศ.2556; 1.0\nPrapimphan Chiengkul. (2019). Uneven development, inequality and concentration of power a\ncritique of Thailand 4.0. Third World Quarterly, 40(9), 1689-1707.\nPrapimphan Chiengkul. (2018) . The Degrowth Movement: Alternative Economic Practices and\nRelevance to Developing Countries. Alternatives, 43(2), 81-95.\nรศ.ดร.ไตรรัตน์ โภคพลำกรณ์\nผลงานวิจัยท่หีน่วยงานหรอืองค์กรระดับชาติว่าจ้างให้ดำเนินการ; 1\nไตรรัตน์ โภคพลำกรณ์. (2562). การบริหารโครงการ (Project administration) : แนวคิดและกระบวนการ.\nกรุงเทพฯ : คณะรัฐศาสตร์ มหาวิทยาลัยธรรมศาสตร์. (342 หน้า).\nรศ.ดร.สุนิสา ช่อแก้ว\nบทความวิจัยหรือบทความวิชาการที่ตีพิมพ์ในวารสารวิชาการระดับนานาชาติที่มีอยู่ในฐานข้อมูล\nตามประกาศ ก.พ.อ. หรือระเบียบคณะกรรมการการอุดมศึกษาว่าด้วย หลักเกณฑ์การพิจารณา\nวารสารทางวชิาการสำหรับการเผยแพร่ผลงานทางวชิาการ พ.ศ.2556; 1.0\nLaiprakobsup, T. and Chorkaew, S. (2018). Land reform, market adjustment, and rice market growth\nin Vietnam. Studies of Transition States and Societies, 10(1), 15-36.\n109 บทความวิจัยหรือบทความทางวิชาการที่ตีพิมพ์ในวารสารวิชาการที่ปรากฏในฐานข้อมูลกลุ่มที่ 2;\n0.6\nสุนิสา ช่อแก้ว. (2564). การปรับเปลี่ยนการบริหารทรัพยากรมนุษย์ในภาครัฐไทย. รัฐศาสตร์นเิทศ.\n7(2), 55-96\nสุนิสา ช่อแก้ว. (2562). แนวโน้มในการพัฒนาระบบนักบริหารระดับสูงในภาครัฐของไทยในอีก 10 ปี\nข้างหน้า (พ.ศ. 2561-2570). Journal of HR intelligence. 14(2), 27-47.\nสุนิสา ช่อแก้ว. (2561). ถอดบทเรียนการนำเอาวิธีการเรียนรู้จากการปฏิบัติไปใช้เพื่อการพัฒนาตัวแบบ\nสมรรถนะหลักของกรมบัญชีกลาง. Journal of HR intelligence. 13(2), 74-95.\nอ.ดร.นาอีม แลนิ\nบทความวิจัยหรือบทความวิชาการที่ตีพิมพ์ในวารสารวิชาการระดับนานาชาติที่มีอยู่ในฐานข้อมูล\nตามประกาศ ก.พ.อ. หรือระเบียบคณะกรรมการการอุดมศึกษาว่าด้วย หลักเกณฑ์การพิจารณา\nวารสารทางวชิาการสำหรับการเผยแพร่ผลงานทางวชิาการ พ.ศ.2556; 1.0\nLaeni, N., van den Brink, M.A., & Arts, J. (2 0 2 1). Institutional Conditions for Inclusive, Flood\nResilient Urban Deltas: A Comparative Institutional Analysis of Two International\nResilience Programs in Southeast Asia. Water, 13(18), 2478.\nLaeni, N., van den Brink, M.A., Busscher, T., Ovink, H., & Arts, J. (2 0 2 0). Building Local\nInstitutional Capacities for Urban Flood Adaptation: Lessons from the Water as Leverage\nProgram in Semarang, Indonesia. Sustainability, 12(23), 10104.pp. 1-22\nLaeni, N., van den Brink, M. A., Trell, E. M., & Arts, E. J. M. M. (2 02 0). Going Dutch in the\nMekong Delta: a framing perspective on water policy translation. Journal of Environmental\nPolicy & Planning, 1-18.\n110 ภาคผนวก 2 ตารางเปรียบเทียบโครงสร้างและองค์ประกอบของหลักสูตร ฉบับ พ.ศ. 2561\nกับฉบับ พ.ศ. 2566 ดังนี้\nหลักสูตร ฉบับ พ.ศ. 2561 หลักสูตร ฉบับ พ.ศ. 2566 สรุปการ\nเปลี่ยนแปลง\n1) ชื่อหลักสูตรและชอื่ปริญญา\nหลักสูตรรัฐศาสตรบัณฑติหลักสูตรรัฐศาสตรบัณฑติคงเดิม\n2) จำนวนการรับนักศึกษา\nปีการศึกษาละ 270 คน ปีการศึกษาละ 270 คน คงเดิม\n3) เกณฑ์การสำเร็จการศึกษา\n1. ได้ศึกษารายวิชาต่าง ๆ ครบตามโครงสร้าง 1. ได้ศึกษารายวิชาต่าง ๆ ครบตามโครงสร้าง ลดจำนวน\nหลักสูตร และมีหน่วยกิตสะสมไม่ต่ำกว่า 139 หลักสูตร และมีหน่วยกิตสะสมไม่ต่ำกว่า 129 หน่วยกิตรวม\nหน่วยกิต หน่วยกิต ตลอดหลักสูตร\n2. ได้ค่าระดับเฉลี่ยสะสมไม่ต่ำกว่า 2.00 2. ได้ค่าระดับเฉลี่ยสะสมไม่ต่ำกว่า 2.00 จาก 139 หน่วย\n(จากระบบ 4 ระดับคะแนน) (จากระบบ 4 ระดับคะแนน) กติ  129\n3. ต้องปฏิบัติตามเงื่อนไขอื่น ๆ ที่คณะและ 3. ต้องปฏิบัติตามเงื่อนไขอื่น ๆ ที่คณะ หน่วยกิต\nมหาวิทยาลัยธรรมศาสตรก์าหนด และมหาวิทยาลัยธรรมศาสตรก์าหนด\n4) โครงสร้างและองค์ประกอบของหลักสูตร ปรับลดจำนวน\n1. วิชาศึกษาทั่วไป 30 หน่วยกิต 1. วิชาศึกษาทั่วไป 30 หน่วยกิต หน่วยกิต เหลือ\n129 หน่วยกิต\n2. วิชาเฉพาะ 103 หน่วยกิต 2. วิชาเฉพาะ 78 หน่วยกิต\nลดวิชาแกนจาก\nวิชาแกน 22 หน่วยกติวิชาแกน 21 หน่วยกติ\n22 หน่วยกิต\nวิชาเฉพาะสาขา 42 หน่วยกติวิชาเฉพาะสาขา 42 หน่วยกติ\n21 หน่วยกิต / ลด\nวิชาบงัคับนอกคณะ 15 หน่วยกิต วิชาบงัคับนอกคณะ 15 หน่วยกิต\nวิชาโท หรือวิชา\nวิชาโท หรอืวิชำเลอืก 24 หน่วยกติ 3. วิชาโท หรอืวิชำเลือก 15 หน่วยกิต\nเลือก จาก 24\n3. วิชาเลือกเสรี 6 หน่วยกิต 4. วิชาเลือกเสรี 6 หน่วยกิต\nหน่วยกิต  15\nรวมตลอดหลักสูตร 139 หน่วยกิต รวมตลอดหลักสูตร 129 หน่วยกิต\nหน่วยกิต\n5) โครงสร้างของหลักสูตร โดยเปรียบเทยีบใน\nลักษณะวชิาต่อวิชา\n1. วิชาศึกษาทั่วไป 1. วิชาศึกษาทั่วไป\nวิชาศึกษาทั่วไปส่วนที่ 1 รวม 30 หน่วยกิต แบ่ง 5 หมวด รวม 30 หน่วยกิต\nหมวดสังคมศาสตร์ บังคับ 2 วิชา 6 หน่วยกิต หมวดความเท่าทันโลกและสังคม บังคับ 2 วิชา\n6 หน่วยกิต\nมธ.100 พลเมอืงกับการลงมอื 3 (3-0-6) ย้ายไปหมวดการ\nแก้ปัญหา บรกิารสังคมแล\n111 หลักสูตร ฉบับ พ.ศ. 2561 หลักสูตร ฉบับ พ.ศ. 2566 สรุปการ\nเปลี่ยนแปลง\nการเรียนรจู้าก\nการปฏิบัติ\nมธ.101 โลก อาเซยีน และไทย 3 (3-0-6) ย้ายไปอยู่วชิา\nเลือก\nมธ.122 กฎหมายในชีวติประจำ วัน 3 (3-0-6) ย้ายมาจากวชิา\nศกึษาทั่วไป\nส่วนที่ 2\nมธ.124 สังคมกับเศรษฐกิจ 3 (3-0-6) ย้ายมาจากวชิา\nศึกษาทั่วไปส่วนที่\n2\nหมวดมนุษยศาสตร์ บังคับ 1 วิชา 3 หน่วยกิต หมวดสุนทรียะและทักษะการส่อืสาร\nบังคับ 2 วิชา 6 หน่วยกิต เพิ่มหน่วยกติ\nมธ.102 ทักษะชวีิตทางสังคม 3 (3-0-6) ย้ายไปวิชาเลือก\n/ ปรับชื่อวิชา\nศศ.101 การคิด อ่าน และเขียน 3 (3-0-6) ย้ายมาจากหมวด\nอย่างมีวจิารณญาณ ภาษา/ปรับรหสั\nสษ.105 ทักษะการสอื่สารทาง 3 (3-0-6) ย้ายมาจากหมวด\nภาษาองักฤษ ภาษา/ปรับรหสั\nหมวดวิทยาศาสตร์และคณติศาสตร์ หมวดคณิตศาสตร์ วิทยาศาสตร์ และ\nบังคับ 1 วิชา 3 หน่วยกติ เทคโนโลยีบงัคับ 1 วิชา 3 หน่วยกิต\nมธ.107 ทักษะดิจทิลักับการแกปั้ญหา 3 (3-0-6) ม ธ .1 07 ทักษะดิจทิลักับการ 3 (3-0-6) ค งเดิม\nแก้ปัญหา\nหมวดสุขภาวะและทักษะแห่งอนาคต\nบังคับ 1 วิชา 3 หน่วยกติ\nมธ.242 นวัตกรรมการแก้ปัญหา 3 (3-0-6) เปิดเพิ่ม\nกับการคดิ เชิงออกแบบ\nหมวดการบริการสังคมและการเรียนรู้จากการ\nปฏิบัติบงัคับ 1 วิชา 3 หน่วยกติ\nมธ.100 พลเมอืงกับการลงมอื 3 (3-0-6) ย้ายมาจากหมวด\nแก้ปัญหา สังคมศาสตร์\nมธ.200 พลเมอืงกับการลงมอื แก้ 3 (3-0-6) เปิดเพิ่ม\nปัญหาโดยออกแบบการเรียนรเู้อง\n112 หลักสูตร ฉบับ พ.ศ. 2561 หลักสูตร ฉบับ พ.ศ. 2566 สรุปการ\nเปลี่ยนแปลง\nหมวดภาษา บังคับ 3 วิชา 9 หน่วยกติ\nมธ.050 การพัฒนาทักษะ 3 (3-0-6) ปิด/ตดัออก\nภาษาองักฤษ\nมธ.104 การคิด อ่าน และเขยีน 3 (3-0-6) ย้ายไปหมวด\nอย่างมีวจิารณญาณ สุนทรยีะและ\nทักษะการสื่อสาร\nมธ.105 ทักษะการสื่อสารด้วย 3 (3-0-6) ย้ายไปหมวด\nภาษาองักฤษ สุนทรยีะและ\nทักษะการสื่อสาร\nมธ.106 ความคดิสร้างสรรคแ์ ละ 3 (3-0-6) ย้ายไปวิชาเลือก\nการสอื่สาร\nวิชาศึกษาทั่วไปส่วนที่ 2\nบังคับ 2 วิชา 6 หน่วยกิต\nมธ.122 กฎหมายในชีวติประจำ วัน 3 (3-0-6) ย้ายไปหมวด\nความเท่าทันโลก\nและสงัคม\nมธ.124 สังคมกับเศรษฐกิจ 3 (3-0-6) ย้ายไปหมวด\nความเท่าทันโลก\nและสงัคม\nเลือก 1 วิชา 3 หน่วยกิต เลือก 3 วิชา 9 หน่วยกิต เพิ่มหน่วยกติ\nมธ.111 ประเทศไทย ในมิติทาง 3 (3-0-6) ศศ.102 ประเทศไทยในมติทาง 3 (3-0-6) ปรับรหัสวิชา\nประวัตศิาสตร์ สังคม และวัฒนธรรม ประวัตศิาสตร์ สังคม และวัฒนธรรม\nมธ.113 ความรพูื้น้ฐานทางปรชัญา 3 (3-0-6) ปิด/ตดัออก\nและศาสนา\nมธ.143 มนุษย์กับสิ่งแวดล้อม 3 (3-0-6) มธ.143 มนุษย์กับสิ่งแวดล้อม 3 (3-0-6) คงเดิม\nมธ.101 โลก, อาเซยีน และไทย 3 (3-0-6) ย้ายมาจาก\nหมวดสังคม\nศาสตร์\nมธ.121 มนุษย์ สงัคมและวัฒนธรรม 3 (3-0-6) เปิดเพิ่ม\nอซ.126 ความเชื่อและศาสนา 3 (3-0-6) เปิดเพิ่ม\nในบรบิทสังคมและการเมืองอาเซยีน\nวสห.102 สังคมไทยในโลกสมยั ใหม่ 3 (3-0-6) เปิดเพิ่ม\nมธ.102 ชีวติกับสุนทรยีภาพ 3 (3-0-6) ย้ายมาจาก\nหมวด\n113 หลักสูตร ฉบับ พ.ศ. 2561 หลักสูตร ฉบับ พ.ศ. 2566 สรุปการ\nเปลี่ยนแปลง\nมนุษยศาสตร์\n/ ปรับชื่อวิชา\nมธ.106 ความคดิสร้างสรรคแ์ ละ 3 (3-0-6) ย้ายมาจาก\nการสอื่สาร หมวดภาษา\nศศ.104 พัฒนาการของโลกสมัยใหม่ 3 (3-0-6) เปิดเพิ่ม\nศศ.105 ปรัชญาและศาสนาเพื่อ 3 (3-0-6) เปิดเพิ่ม\nความพลเมือง\nปด.104 เส้นทางสู่ความสมัย 3 (3-0-6) เปิดเพิ่ม\nใหม่และโลกาภิวัตน์\nมธ.103 ชีวติกับความยั่งยืน 3 (3-0-6) เปิดเพิ่ม\nมธ.151 คณิตศาสตรทั์่วไประดับ 3 (3-0-6) เปิดเพิ่ม\nมหาวิทยาลยั\nมธ.155 สถติพนื้ฐาน 3 (3-0-6) เปิดเพิ่ม\nดท.100 นวัตกรรมดิจทิลั 3 (3-0-6) เปิดเพิ่ม\nมธ.108 การพัฒนาและจดัการตนเอง 3 (3-0-6) เปิดเพิ่ม\nมธ.201 ความรทู้างการเงนิสา หรับ 3 (3-0-6) เปิดเพิ่ม\nบุคคล\nสษ.115 การสื่อสารทางภาษา 3 (3-0-6) เปิดเพิ่ม\nองักฤษเพ่อือาชีพ\nมธ.240 เศรษฐกจิภูมิรัฐศาสตร์โลก 3 (3-0-6) เปิดเพิ่ม\nมธ.243 ทักษะดิจติอลเพ่อือนาคต 3 (3-0-6) เปิดเพิ่ม\nลศ.209 ความรพูื้น้ฐานด้านนวัตกรรม 3 (3-0-6) เปิดเพิ่ม\nสงัคมและการประกอบธุรกิจเพื่อสังคม\nมธ.431 การเรียนรจู้ากการสร้าง 15 (0-45-45) เปิดเพิ่ม\nสตาร์ทอัพของตนเอง\n2. วิชาเฉพาะ 103 หน่วยกิต 2. วิชาเฉพาะ 78 หน่วยกิต\n2.1 วิชาแกน 22 หน่วยกิต 2.1 วิชาแกน 21 หน่วยกิต\nร.210 ปรัชญาการเมอืงเบื้องต้น 3 (3-0-6) ร.210 ปรัชญาการเมอืงเบื้องต้น 3 (3-0-6) คงเดิม\nร.211 ความรเู้บื้องต้นทางรัฐศาสตร์ 3 (3-0-6) ร . 211 ความรเู้บื้องต้นทางรัฐศาสตร์ 3 (3-0-6) คงเดิม\nร.241 ความรเู้บื้องตน้ทาง 3 (3-0-6) ร .241 ความรเู้บื้องตน้ทาง 3 (3-0-6) คงเดิม\nบรหิารรัฐกจิบรหิารรัฐกจิ\nร.271 ความรเู้บื้องตน้ทางความ 3 (3-0-6) ร . 2 7 1 ค วา ม ร เู้บื้อ ง ต น้ทำ ง ค วา ม 3 (3-0-6) ค ง เดิม\nสมัพันธ์ระหว่างประเทศ สัมพันธ์ระหว่างประเทศ\nร.300 วิธีวิทยาทางสังคมศาสตร์ 3 (3-0-6) ร.300 วิธีวิทยาทางสังคมศาสตร์ 3 (3-0-6) ค ง เดิม\n114 หลักสูตร ฉบับ พ.ศ. 2561 หลักสูตร ฉบับ พ.ศ. 2566 สรุปการ\nเปลี่ยนแปลง\nร.321 การเมืองการปกครองของไทย 3 (3-0-6) ร.321 การเมืองการปกครองของไทย 3 (3-0-6) ค ง เดิม\nร.380 พัฒนาการเศรษฐกิจและการ 3 (3-0-6) ร.380 พัฒนาการเศรษฐกิจและการ 3 (3-0-6) คงเดิม\nเมอืงโลก เมอืงโลก\nร.400 การฝึกงานทางรัฐศาสตร์ 3 (3-0-6) ปิด/ตดัออก\n2.2 วิชาเฉพาะสาขา 42 หน่วยกิต 2.2 วิชาเฉพาะสาขา 42 หน่วยกิต\n2.2.1 สาขาการเมืองการปกครอง 2.2.1 สาขาการเมืองการปกครอง\nวิชาบังคับสาขา 7 วิชา 21 หน่วยกิต วิชาบังคับสาขา 6 วชิา 18 หน่วยกิต\nร.221 พรรคการเมือง 3 (3-0-6) ร.221 พรรคการเมือง 3 (3-0-6) คงเดิม\nกลมุ่ผลประโยชน์และการเลือกตั้ง กลมุ่ผลประโยชน์และการเลือกตั้ง\nร.222 พลวัตการเมืองท้องถ่นิ 3 (3-0-6) ร.222 พลวัตการเมืองท้องถ่นิ 3 (3-0-6) คงเดิม\nร.312 การเมืองกับกฎหมายมหาชน 3 (3-0-6) ร.312 การเมืองกับกฎหมายมหาชน 3 (3-0-6) คงเดิม\nร.320 การเมอืงการปกครองเปรียบเทียบ 3 (3-0-6) ร.320 การเมอืงการปกครอง 3 (3-0-6) คงเดิม\nเปรียบเทียบ\nร.322 สถาบนัการเมืองและ 3 (3-0-6) ร.322 สถาบนัการเมืองและ 3 (3-0-6) คงเดิม\nรัฐธรรมนูญ รัฐธรรมนูญ\nร.412 ทฤษฎีว่าด้วยสงัคมและ 3 (3-0-6) ร.412 ทฤษฎีว่าด้วยสงัคมและ 3 (3-0-6) คงเดิม\nการเมือง การเมือง\nร.420 กฎหมายปกครอง 3 (3-0-6) ร.418 กฎหมายปกครอง 3 (3-0-6) ย้ายไปวิชาเลือก\n/ ปรับรหัสวิชา\nวิชาเลือกในสาขา 7 วิชา 21 หนว่ยกิต วิชาเลือกในสาขา 8 วชิา 24 หน่วยกิต\nร.212 ประวัติความคดิทางการ 3 (3-0-6) ร.212 ประวัติความคดิทางการ 3 (3-0-6) คงเดิม\nเมอืงเบื้องต้น เมอืงเบื้องต้น\nร.224 พนื้ฐานทางเศรษฐกิจและ 3 (3-0-6) ร.224 พนื้ฐานทางเศรษฐกิจและ 3 (3-0-6) คงเดิม\nสังคมของการเมอืงการปกครองไทย สังคมของการเมอืงการปกครองไทย\nร.304 พฤติกรรมการเมือง ความคดิ 3 (3-0-6) ร.304 พฤติกรรมการเมือง ความคดิ 3 (3-0-6) คงเดิม\nเห็นสาธารณะและจิตวิทยา เห็นสาธารณะและจิตวิทยา\nร.307 ทฤษฎีการเมืองแนวสตรนีิยม 3 (3-0-6) ร.307 ทฤษฎีการเมืองแนวสตรนีิยม 3 (3-0-6) คงเดิม\nร.309 ทุน ธุรกิจกับการเมือง 3 (3-0-6) ร.309 ทุน ธุรกิจกับการเมือง 3 (3-0-6) คงเดิม\nร.311 ขบวนการเคลื่อนไหวทาง 3 (3-0-6) ร.311 ขบวนการเคลื่อนไหวทาง 3 (3-0-6) คงเดิม\nสงัคมกับพื้นที่ทางการเมือง สงัคมกับพื้นที่ทางการเมือง\nร.314 ประวัติความคดิทาง 3 (3-0-6) ร.314 ประวัติความคดิทาง 3 (3-0-6) คงเดิม\nการเมืองไทย การเมืองไทย\nร.315 ปรัชญาสงครามและสนัติภาพ 3 (3-0-6) ร.315 ปรัชญาสงครามและสนัติภาพ 3 (3-0-6) คงเดิม\n115 หลักสูตร ฉบับ พ.ศ. 2561 หลักสูตร ฉบับ พ.ศ. 2566 สรุปการ\nเปลี่ยนแปลง\nร.319 ทฤษฎีการเมืองว่าด้วยเสรี 3 (3-0-6) ร.319 ทฤษฎีการเมืองว่าด้วยเสรี 3 (3-0-6) คงเดิม\nนยิมและประชาธิปไตย นยิมและประชาธิปไตย\nร.323 การเมืองว่าด้วยการพฒันำ 3 (3-0-6) ร.323 การเมืองว่าด้วยการพฒันำ 3 (3-0-6) คงเดิม\nร.326 การเมืองการปกครอง 3 (3-0-6) ร.326 การเมืองการปกครอง 3 (3-0-6) คงเดิม\nตะวันออกกลาง ตะวันออกกลาง\nร.327 การเมืองการปกครอง 3 (3-0-6) ร.327 การเมืองการปกครอง 3 (3-0-6) คงเดิม\nเอเชยี ใต้ เอเชยี ใต้\nร.330 การเมืองการปกครองเอเชยี 3 (3-0-6) ร.330 การเมืองการปกครองเอเชยี 3 (3-0-6) คงเดิม\nตะวันออกเฉยีงใต้ตะวันออกเฉยีงใต้\nร.333 การเมอืงการปกครองเอเชยี 3 (3-0-6) ร.333 การเมอืงการปกครองเอเชยี 3 (3-0-6) คงเดิม\nตะวันออก ตะวันออก\nร.336 การเมืองการปกครอง 3 (3-0-6) ร.336 การเมืองการปกครอง 3 (3-0-6) คงเดิม\nพหอุ เมรกิา พหอุ เมรกิา\nร.337 การเมืองการปกครองยุโรป 3 (3-0-6) ร.337 การเมืองการปกครองยุโรป 3 (3-0-6) คงเดิม\nร.403 สัมมนา : ภาษากับการเมือง 3 (3-0-6) ร.403 สัมมนา : ภาษากับการเมือง 3 (3-0-6) คงเดิม\nร.404 สัมมนา : ศาสนากับการเมือง 3 (3-0-6) ร.404 สัมมนา : ศาสนากับการเมือง 3 (3-0-6) คงเดิม\nร.405 สัมมนา : การเมืองและนวนยิาย 3 (3-0-6) ร.405 สัมมนา : การเมืองและนวนยิาย 3 (3-0-6) คงเดิม\nร.406 การเมืองของเพศสภาพและ 3 (3-0-6) ร.406 การเมืองของเพศสภาพและ 3 (3-0-6) คงเดิม\nเพศวิถี เพศวิถี\nร.407 ความมั่นคงศึกษาเชิงวพิากษ์ 3 (3-0-6) ปิด/ตดัออก\nร.408 รัฐและสังคม 3 (3-0-6) ร.408 รัฐและสังคม 3 (3-0-6) คงเดิม\nร.409 ประชาธิปไตยและการพัฒนา 3 (3-0-6) ร.409 ประชาธิปไตยและการพัฒนา 3 (3-0-6) คงเดิม\nประชาธิปไตย ประชาธิปไตย\nร.414 สัมมนาแนวความคดิทางการ 3 (3-0-6) ร.414 สัมมนาแนวความคดิทางการ 3 (3-0-6) คงเดิม\nเมอืงไทย เมอืงไทย\nร.415 สมัมนา : ความรนุ แรงและสนัติวธิี 3 (3-0-6) ร.415 สมัมนา : ความรนุ แรงและสนัติวธิี 3(3-0-6) คงเดิม\nร.416 สัมมนา : ประเด็นปัญหา 3 (3-0-6) ร.416 สัมมนา : ประเด็นปัญหา 3 (3-0-6) คงเดิม\nปรัชญาการเมือง ปรัชญาการเมือง\nร.419 ความคดิทางการเมอืงแบบ 3 (3-0-6) ปิด/ตดัออก\nยโู ทเปีย\nร.423 สัมมนาการเปลยี่นแปลงทาง 3 (3-0-6) ปิด/ตดัออก\nสงัคมและการเมืองในเอเชยีตะวัน\nออกเฉยีงใต้\n116 หลักสูตร ฉบับ พ.ศ. 2561 หลักสูตร ฉบับ พ.ศ. 2566 สรุปการ\nเปลี่ยนแปลง\nร.424 สัมมนาปัญหาการเมือง 3 (3-0-6) ร . 424 สัมมนาปัญหาการเมือง 3 (3-0-6) คงเดิม\nการปกครองของไทย การปกครองของไทย\nร.425 สัมมนาปัญหาในทางรฐัศาสตร์ 3 (3-0-6) ร .425 สัมมนาปัญหาในทางรฐัศาสตร์ 3 (3-0-6) คงเดิม\nร.426 สัมมนาทฤษฎีเก่ยีวกับการ 3 (3-0-6) ร.426 สัมมนาทฤษฎีเก่ยีวกับการ 3 (3-0-6) คงเดิม\nเมอืงการปกครองเปรียบเทียบ เมอืงการปกครองเปรียบเทียบ\nร.427 การเมืองเชิงชาติพันธุ์และ 3 (3-0-6) ร.427 การเมืองเชิงชาติพันธุ์และ 3 (3-0-6) คงเดิม\nวัฒนธรรม วัฒนธรรม\nร.428 สัมมนาทหารและการเมือง 3 (3-0-6) ร.428 สัมมนาทหารและการเมือง 3 (3-0-6) คงเดิม\nร.429 สัมมนาเรื่องผู้นำทางการเมือง 3 (3-0-6) ปิด/ตดัออก\nร.434 สัมมนาปัญหาทฤษฎีการเมือง 3 (3-0-6) ร.434 สัมมนาปัญหาทฤษฎีการเมือง 3 (3-0-6) คงเดิม\nกับปัญหาร่วมสมัย กับปัญหาร่วมสมัย\nร.437 สัมมนาความรเู้กี่ยวกับระเบียบ 3 (3-0-6) ปิด/ตดัออก\nวิธีวิเคราะห์ทางปรัชญาและการเมอืง\nร.438 หลักและระเบยีบทาง 3 (3-0-6) ร.438 หลักและระเบยีบทาง 3 (3-0-6) คงเดิม\nราชการไทย ราชการไทย\nร.439 เทคโนโลยีกับการเมือง 3 (3-0-6) ร.439 เทคโนโลยีกับการเมือง 3 (3-0-6) คงเดิม\nร.519 การวจิัยของแต่ละบุคคลภายใต้ 3 (2-2-5) ร.519 การวจิัยของแต่ละบุคคล 3 (2-2-5) คงเดิม\nการแนะนำเกี่ยวกับกระบวนทัศน์ ภายใต้การแนะนำเกี่ยวกับกระบวนทัศน์\nทางรัฐศาสตร์ ทางรัฐศาสตร์\nร.523 การฝึกงานทางการเมอืง 3 (0-6-3) เปิดเพิ่ม\nการปกครอง\nร.537 การศึกษาวิจัยภาคสนาม 3 (2-2-5) ปิด/ตดัออก\nทางรัฐศาสตร์\nร.539 การวิจัยของแต่ละบุคคลภายใต้การ3 (2-2-5) ร.539 การวิจัยของแต่ละบุคคลภายใต้ 3 (2-2-5) คงเดิม\nแนะนำเกี่ยวกับประเดน็ทางรัฐศาสตร์ ภายใต้การแนะนำเกี่ยวกับประเด็นทาง\nรัฐศาสตร์\n2.2.2 สาขาบริหารรัฐกิจ 2.2.2 สาขาบริหารรัฐกิจ\nวิชาบังคับสาขา 7 วิชา 21 หน่วยกิต วิชาบังคับสาขา 6 วชิา 18 หน่วยกิต\nร.242 ทฤษฎอีงคก์ารและการจัดการ 3 (3-0-6) ร.242 ทฤษฎอีงคก์ารและการจัดการ 3 (3-0-6) คงเดิม\nร.250 การวางแผนและการจดัการ 3 (3-0-6) ร.250 การวางแผนและการจดัการ 3 (3-0-6) คงเดิม\nเชิงกลยุทธ์ในบรบิทสาธารณะ เชิงกลยุทธ์ในบรบิทสาธารณะ\nร.251 การบรหิารทรัพยากรมนุษย์ 3 (3-0-6) ร.251 การบรหิารทรัพยากรมนุษย์ 3 (3-0-6) คงเดิม\nภาครัฐ ภาครัฐ\nร.350 การบรหิารรัฐกจิ ไทย 3 (3-0-6) ร.350 การบรหิารรัฐกจิ ไทย 3 (3-0-6) คงเดิม\n117 หลักสูตร ฉบับ พ.ศ. 2561 หลักสูตร ฉบับ พ.ศ. 2566 สรุปการ\nเปลี่ยนแปลง\nร.360 การบรหิารการคลังและ 3 (3-0-6) ร.360 การบรหิารการคลังและ 3 (3-0-6) คงเดิม\nงบประมาณ งบประมาณ\nร.361 นโยบายสาธารณะและการ 3 (3-0-6) ร.361 นโยบายสาธารณะและการ 3 (3-0-6) คงเดิม\nจัดการปกครอง จัดการปกครอง\nร.420 กฎหมายปกครอง 3 (3-0-6) ตัดออก\n/ปรับรหัสวิชา\nวิชาเลือกในสาขา 7 วิชา 21 หนว่ยกิต วิชาเลือกในสาขา 8 วิชา 24 หนว่ยกิต\nร.342 เคร่อืงมอืการบริหารและการ 3 (3-0-6) ร.342 เคร่อืงมอืการบริหารและการ 3 (3-0-6) คงเดิม\nจัดการ จัดการ\nร.343 พฤติกรรมและวัฒนธรรมองคก์าร 3 (3-0-6) ร.343 พฤติกรรมและวัฒนธรรมองคก์าร3 (3-0-6) คงเดิม\nร.345 องคก์ารและการจัดการ 3 (3-0-6) ร.345 องคก์ารและการจัดการ 3 (3-0-6) คงเดิม\nสาธารณะไทย สาธารณะไทย\nร.346 การบรหิารโครงการ 3 (3-0-6) ร.346 การบรหิารโครงการ 3 (3-0-6) คงเดิม\nร.347 การประเมินผลโครงการ 3 (3-0-6) ร.347 การประเมินผลโครงการ 3 (3-0-6) คงเดิม\nร.348 ความรเู้บื้องต้นเก่ยีวกบั 3 (3-0-6) ร.348 ความรเู้บื้องต้นเก่ยีวกบั 3 (3-0-6) คงเดิม\nนโยบายและการวางแผนสิ่งแวดล้อม นโยบายและการวางแผนสิ่งแวดล้อม\nร.349 ความสัมพนัธ์ระหว่าง 3 (3-0-6) ร.349 ความสัมพนัธ์ระหว่าง 3 (3-0-6) คงเดิม\nหน่วยงานของรัฐและการบรหิาร หน่วยงานของรัฐและการบรหิาร\nจัดการเครอืข่าย จัดการเครอืข่าย\nร.353 การบรหิารแรงงาน 3 (3-0-6) ร.353 การบรหิารแรงงาน 3 (3-0-6) คงเดิม\nร.355 การบรหิารจัดการสวสัดิการ 3 (3-0-6) ปิด/ตดัออก\nสงัคม\nร.356 เทคโนโลยีนวัตกรรมและการ 3 (3-0-6) ร.356 เทคโนโลยีนวัตกรรมและการ 3 (3-0-6) คงเดิม\nบรหิารจดัการระบบข้อมูลสาธารณะ บรหิารจดัการระบบข้อมูลสาธารณะ\nร.357 การพัฒนาทรัพยากรมนุษย์ 3 (3-0-6) ร.357 การพัฒนาทรัพยากรมนุษย์ 3 (3-0-6) คงเดิม\nร.358 การบรหิารการพัฒนา 3 (3-0-6) ร.358 การบรหิารการพัฒนา 3 (3-0-6) คงเดิม\nในบรบิทโลก ในบรบิทโลก\nร.359 การบรหิารรัฐกจิ เปรียบเทียบ 3 (3-0-6) ร.359 การบรหิารรัฐกจิ เปรียบเทียบ 3 (3-0-6) คงเดิม\nร.363 การบรหิารการคลังทอ้งถ่นิ 3 (3-0-6) ร.363 การบรหิารการคลังทอ้งถ่นิ 3 (3-0-6) คงเดิม\nร.364 การจัดการความหลากหลาย 3 (3-0-6) ร.364 การจัดการความหลากหลาย 3 (3-0-6) คงเดิม\nวัฒนธรรมองคก์าร วัฒนธรรมองคก์าร\nร.366 การบรหิารจัดการสิ่งแวดล้อม 3 (3-0-6) ร.366 การบรหิารจัดการสิ่งแวดล้อม 3 (3-0-6) คงเดิม\nอย่างยั่งยืน อย่างยั่งยืน\n118 หลักสูตร ฉบับ พ.ศ. 2561 หลักสูตร ฉบับ พ.ศ. 2566 สรุปการ\nเปลี่ยนแปลง\nร.367 เทคนิคการวเิคราะห์และการ 3 (3-0-6) ร.367 แนวทางวิเคราะหน์ โยบาย 3 (3-0-6) ปรับชื่อวิชา\nออกแบบนโยบาย และหลักปฏิบัติแบบบูรณาการ / ปรับคำอธิบาย\nร.368 นโยบายและการจดัการเมือง 3 (3-0-6) ร.368 นโยบายและการจดัการเมือง 3 (3-0-6) คงเดิม\nร.369 การบรหิารจัดกำรองคก์ ร 3 (3-0-6) ร.369 การบรหิารจัดกำรองคก์ ร 3 (3-0-6) คงเดิม\nปกครองส่วนท้องถนิ่ปกครองส่วนท้องถนิ่\nร.443 สัมมนาการบริหารรัฐกจิ 3 (3-0-6) ร.443 สัมมนาการบริหารรัฐกจิ 3 (3-0-6) คงเดิม\nร.444 การบรหิารรัฐกจิกับการ 3 (3-0-6) ร.444 การบรหิารรัฐกจิกับการ 3 (3-0-6) คงเดิม\nพัฒนาระหว่างประเทศ พัฒนาระหว่างประเทศ\nร.445 การบรหิารจัดกำรองคก์ารไม่ 3 (3-0-6) ร.445 การบรหิารจัดกำรองคก์าร 3 (3-0-6) คงเดิม\nแสวงหากา ไรและธุรกิจเพื่อสังคม ไม่แสวงหากำไรและธุรกิจเพื่อสังคม\nร.446 การจัดการความเสยี่งและ 3 (3-0-6) ร.446 การจัดการความเสยี่งและ 3 (3-0-6) คงเดิม\nความต่อเนอื่งองคก์าร ความต่อเนอื่งองคก์าร\nร.449 การบรหิารจัดการความเสี่ยง 3 (3-0-6) ร.449 การบรหิารจัดการความเสี่ยง 3 (3-0-6) คงเดิม\nภยัพิบัติภยัพิบัติ\nร.453 สมัมนาการจัดการทรพัยำกร 3 (3-0-6) ร.453 สมัมนาการจัดการทุนมนุษย์ 3 (3-0-6) ปรับชื่อวิชา\nมนุษย์เชิงกลยุทธ์ เชิงกลยุทธ์ / ปรับคำอธิบาย\nร.455 สมัมนาประเดน็นโยบาย 3 (3-0-6) ร.455 สมัมนาประเดน็นโยบาย 3 (3-0-6) คงเดิม\nสาธารณะ สาธารณะ\nร.463 สมัมนาการบริหารการคลัง 3 (3-0-6) ร.463 สมัมนาการบริหารการคลัง 3 (3-0-6) คงเดิม\nสาธารณะ สาธารณะ\nร.467 สัมมนาการบริหารรัฐวิสาหกจิ 3 (3-0-6) ร.467 สัมมนาการบริหารรัฐวิสาหกจิ 3 (3-0-6) คงเดิม\nร.468 ทฤษฎีเกมสำหรับนักรฐัศาสตร์ 3 (3-0-6) เปิดเพิ่ม\nร.567 การฝึกงานทางบรหิารรัฐกจิ 3 (0-6-3) เปิดเพิ่ม\nร.569 สหกจิศึกษาบริหารรัฐกจิ 3 (0-6-3) ร.569 สหกจิศึกษาบริหารรัฐกจิ 3 (0-6-3) คงเดิม\n2.2.3 สาขาการระหว่างประเทศ 2.2.3 สาขาการระหว่างประเทศ\nวิชาบังคับสาขา 7 วิชา 21 หน่วยกิต วิชาบังคับสาขา 6 วชิา 18 หน่วยกิต\nร.272 ประวตัิศาสตรก์ารทูต 3 (3-0-6) ร.272 ประวตัิศาสตรก์ารทูต 3 (3-0-6) คงเดิม\nร.280 การเมอืงระหว่างประเทศ : 3 (3-0-6) ร.280 การเมอืงระหว่างประเทศ : 3 (3-0-6) คงเดิม\nทฤษฎีและกรณศีึกษา ทฤษฎีและกรณศีึกษา\nร.282 การอ่านและการวเิคราะห์ใน 3 (3-0-6) ร.282 การอ่านและการวเิคราะห์ใน 3 (3-0-6) คงเดิม\nความสัมพนัธ์ระหว่างประเทศ ความสัมพนัธ์ระหว่างประเทศ\nร.320 การเมอืงการปกครอง 3 (3-0-6) ร.320 การเมอืงการปกครอง 3 (3-0-6) คงเดิม\nเปรียบเทียบ เปรียบเทียบ\nร.370 การต่างประเทศของไทย 3 (3-0-6) ร.370 การต่างประเทศของไทย 3 (3-0-6) คงเดิม\n119 หลักสูตร ฉบับ พ.ศ. 2561 หลักสูตร ฉบับ พ.ศ. 2566 สรุปการ\nเปลี่ยนแปลง\nร.371 ความสัมพันธ์ระหว่างประเทศ 3 (3-0-6) ร.283 ความสมัพันธ์ระหว่างประเทศ 3 (3-0-6) ย้ายไปวิชาเลือก\nเอเชยีตะวันออกเฉยีงใต้ ในเอเชยีตะวันออกเฉยีงใต้ / ปรับรหัสวิชา\nร.480 ทฤษฎีความสมัพันธ์ระหว่าง 3 (3-0-6) ร.480 ทฤษฎีความสมัพันธ์ระหว่าง 3 (3-0-6) คงเดิม\nประเทศระดับสงู ประเทศระดับสงู\nวิชาเลือกในสาขา 7 วิชา 21 หนว่ยกิต วิชาเลือกในสาขา 8 วชิา 24 หน่วยกิต\nโดยเปน็ภาษาต่างประเทศที่ 2 จา นวน 2 วิชา ใน โดยเปน็ภาษาต่างประเทศที่ 2 จา นวน 2 วิชา ใน\nภาษาเดยีวกัน และเลือกเรยีนวิชาเลือกในสาขาของ ภาษาเดยีวกัน และเลือกเรยีนวิชาเลือกในสาขาของ\nตน 5 วิชา (ในกรณีท่นีศ.ศึกษาภาษา ต่างประเทศที่ 2 ตน 6 วิชา (ในกรณีที่นศ.ศึกษาภาษา ต่างประเทศที่\nวิชาโท อาจเลอืกภาษา ต่างประเทศที่ 2 ภาษาใด 2 วิชาโท อาจเลอืกภาษา ต่างประเทศที่ 2\nก็ได้ 2 วิชา ตามเงื่อนไขข้างตน้หรอืศึกษาวิชาเลือกใน ภาษาใดก็ได้ 2 วิชา ตามเงื่อนไขข้างตน้หรอืศึกษา\nสาขา วิชาเลือกในสาขา ของตนทดแทน 2 วิชา) และให้\nของตนทดแทน 2 วิชา) ดังนี้นักศึกษาเลือกลงทะเบยีนตามกลุ่มวิชาดงันี้\nร.293 กฎหมาย องคก์ารและระบอบ 3 (3-0-6) ร.293 กฎหมาย องคก์ารและระบอบ 3 (3-0-6) คงเดิม\nระหว่างประเทศ ระหว่างประเทศ\nร.373 ความสัมพันธ์ระหว่างประเทศ 3 (3-0-6) ร.373 ความสัมพันธ์ระหว่างประเทศ 3 (3-0-6) คงเดิม\nในเอเชยีตะวันออก ในเอเชยีตะวันออก\nร.374 การเมืองและการต่างประเทศ 3 (3-0-6) ร.374 การเมืองและการต่างประเทศ 3 (3-0-6) คงเดิม\nของสหราชอาณาจักร ของสหราชอาณาจักร\nร.375 ความสัมพันธ์ระหว่าง 3 (3-0-6) ร.375 ความสัมพันธ์ระหว่าง 3 (3-0-6) คงเดิม\nประเทศในละตนิอเมรกิา ประเทศในละตนิอเมรกิา\nร.376 ความสัมพันธ์ระหว่าง 3 (3-0-6) ร.376 ความสัมพันธ์ระหว่าง 3 (3-0-6) คงเดิม\nประเทศในตะวันออกกลาง ประเทศในตะวันออกกลาง\nร.377 สิ่งแวดล้อมกับความสมัพันธ์ 3 (3-0-6) ร.377 สิ่งแวดล้อมกับความสัมพันธ์ 3 (3-0-6) คงเดิม\nระหว่างประเทศ ระหว่างประเทศ\nร.378 การเมืองภายในของความ 3 (3-0-6) ปิด/ตดัออก\nสมัพันธ์ระหว่างประเทศ\nร.379 พิธีทางการทูตและการกงสุล 3 (3-0-6) ร.379 พิธีทางการทูตและการกงสุล 3 (3-0-6) คงเดิม\nร.383 การเมอืงและการต่างประเทศ 3 (3-0-6) ร.383 การเมอืงและการต่างประเทศ 3 (3-0-6) คงเดิม\nของจีน ของจีน\nร.384 การเมืองและการต่างประเทศ 3 (3-0-6) ร.384 การเมืองและการต่างประเทศ 3 (3-0-6) คงเดิม\nของญี่ปนุ่ของญี่ปนุ่\nร.385 การเมอืงและการต่างประเทศ 3 (3-0-6) ร.385 การเมอืงและการต่างประเทศ 3 (3-0-6) คงเดิม\nของรัสเซีย ของรัสเซีย\n120 หลักสูตร ฉบับ พ.ศ. 2561 หลักสูตร ฉบับ พ.ศ. 2566 สรุปการ\nเปลี่ยนแปลง\nร.386 การเมืองและการต่างประเทศ 3 (3-0-6) ร.386 การเมืองและการต่างประเทศ 3 (3-0-6) คงเดิม\nของสหรัฐอเมรกิา ของสหรัฐอเมรกิา\nร.387 ความสัมพันธ์ระหว่างประเทศ 3 (3-0-6) ร.387 ความสัมพันธ์ระหว่างประเทศ 3 (3-0-6) คงเดิม\nในยโุ รป ในยโุ รป\nร.388 มหาอำนาจกับระเบียบโลก 3 (3-0-6) ร.388 มหาอำนาจกับระเบียบโลก 3 (3-0-6) คงเดิม\nร.389 ความสมัพันธ์ระหว่างประเทศ 3 (3-0-6) ร.389 ความสมัพันธ์ระหว่างประเทศ 3 (3-0-6) คงเดิม\nในเอเชยี ใต้ ในเอเชยี ใต้\nร.393 การวิเคราะห์นโยบาย 3 (3-0-6) ร.393 การวิเคราะห์นโยบาย 3 (3-0-6) คงเดิม\nต่างประเทศ ต่างประเทศ\nร.394 ยุทธศาสตรศึ์กษาและความ 3 (3-0-6) ร.394 ยุทธศาสตรศึ์กษาและความ 3 (3-0-6) คงเดิม\nมนั่คงระหว่างประเทศ มนั่คงระหว่างประเทศ\nร.395 สื่อกับการเมอืงโลก 3 (3-0-6) ร.395 สื่อกับการเมอืงโลก 3 (3-0-6) คงเดิม\nร.396 การทูตและการเจรจา 3 (3-0-6) ร.396 การทูตและการเจรจา 3 (3-0-6) คงเดิม\nระหว่างประเทศ ระหว่างประเทศ\nร.397 การเมืองของความช่วยเหลอื 3 (3-0-6) ร.397 การเมืองของการพัฒนา 3 (3-0-6) ปรับชื่อวิชา\nและการพัฒนาระหว่างประเทศ ระหว่างประเทศและความรว่มมอื / ปรับคำอธิบาย\nระหว่างประเทศเพอื่การพัฒนา\nร.398 ประชาสังคมโลก 3 (3-0-6) ร.398 ประชาสังคมโลก 3 (3-0-6) ปรับคำอธิบาย\nร.399 ความมนั่คงของมนุษย์ 3 (3-0-6) ร.399 ความมนั่คงของมนุษย์ 3 (3-0-6) คงเดิม\nร.474 สัมมนานโยบายต่างประเทศ 3 (3-0-6) ร.474 สัมมนานโยบายต่างประเทศ 3 (3-0-6) คงเดิม\nไทย ไทย\nร.476 ทฤษฎีวิพากษใ์ นความสัมพันธ์ 3 (3-0-6) ร.476 ทฤษฎีวพิากษใ์ นความสัมพันธ์ 3 (3-0-6) คงเดิม\nระหว่างประเทศ ระหว่างประเทศ\nร.478 สัมมนาภมูิภาคนยิม 3 (3-0-6) ร.478 สัมมนาภมูิภาคนยิม 3 (3-0-6) คงเดิม\nร.479 สัมมนาปัญหาความขดั แย้ง 3 (3-0-6) ร.479 สัมมนาปัญหาความขดั แย้ง 3 (3-0-6) คงเดิม\nระหว่างประเทศและการแกไ้ข ระหว่างประเทศและการแกไ้ข\nร.488 สมัมนาหัวขอ้ เฉพาะในความ 3 (3-0-6) ร.488 สมัมนาหัวขอ้ เฉพาะในความ 3 (3-0-6) คงเดิม\nสมัพันธ์ระหว่างประเทศ สมัพันธ์ระหว่างประเทศ\nร.489 สมัมนาหัวขอ้ เฉพาะใน 3 (3-0-6) ร.489 สมัมนาหัวขอ้ เฉพาะใน 3 (3-0-6) คงเดิม\nเศรษฐกจิการเมืองระหว่างประเทศ เศรษฐกจิการเมืองระหว่างประเทศ\nร.495 สมัมนาประชาคมอาเซยีน 3 (3-0-6) ร . 4 9 5 สมัมนาประชาคมอาเซยีน 3 (3-0-6) คงเดิม\nร.496 สัมมนาสงครามโลกศกึษา 3 (3-0-6) เปิดเพิ่ม\nร.497 วิทยาศาสตร์และเทคโนโลยี 3 (3-0-6) เปิดเพิ่ม\nในการเมอืงโลก\n121 หลักสูตร ฉบับ พ.ศ. 2561 หลักสูตร ฉบับ พ.ศ. 2566 สรุปการ\nเปลี่ยนแปลง\nร.498 รัฐที่มใิช่มหาอำนาจในความ 3 (3-0-6) เปิดเพิ่ม\nสัมพนัธ์ระหว่างประเทศ\nร.499 ภมูิรัฐศาสตร์ 3 (3-0-6) เปิดเพิ่ม\nร.576 การฝึกงานทางการระหว่าง 3 (0-6-3) เปิดเพิ่ม\nประเทศ\n2.3 วิชาบังคับนอกคณะ 15 หน่วยกิต 2.3 วิชาบังคับนอกคณะ 15 หน่วยกิต\nศ.210 เศรษฐศาสตรเ์ บื้องต้น 3 (3-0-6) ศ . 2 1 0 เศรษฐศาสตรเ์ บื้องต้น 3 (3-0-6) ค งเดิม\nอ.221 การอ่านเชิงวิพากษ์ 3 (3-0-6) อ . 2 2 1 การอ่านและการเขยีนเชิง 3 (3-0-6) ป รับ ชื่อวิชา\nบูรณาการ / ปรับคำอธิบาย\nอ.231 การเขยีนเชิงวิพากษ์ 3 (3-0-6) ปิด/ตดัออก\nสษ.217 การฟังและการพูดด้าน 3 (3-0-6) เปิดเพิ่ม\nวิชาการ\nสษ.231 ภาษาอังกฤษสา หรับ 3 (3-0-6) ส ษ . 2 3 1 ภาษาอังกฤษสา หรับ 3 (3-0-6) ป รับชื่อวิชา\nนักรัฐศาสตร์ 1 รัฐศาสตร์ 1 / ปรับคำอธิบาย\nสษ.331 ภาษาอังกฤษสำหรับ 3 (3-0-6) ส ษ . 3 3 1 ภาษาอังกฤษสำหรับ 3 (3-0-6) ป รับชื่อวิชา\nนักรัฐศาสตร์ 2 รัฐศาสตร์ 2 / ปรับคำอธิบาย\n2.4 วิชาโท หรือวิชาเลือก 24 หน่วยกิต 3. วิชาโท หรอืวิชำเลือก 15 หน่วยกิต\nนักศึกษาคณะรัฐศาสตร์ อาจจะเลือกศึกษา นักศึกษาคณะรัฐศาสตร์ อาจจะเลือกศึกษา\nสาขาวิชาใดวิชาหนึ่งทั้งในและนอกคณะรัฐศาสตร์ สาขาวิชาใดวิชาหนึ่งทั้งในและนอกคณะรัฐศาสตร์\nวิชาโทได้ดังนี้ วิชาโทได้ดังนี้\n2.4.1 วิชาโทในคณะ (นอกสาขาวิชาเอก) 3.1 วิชาโทในคณะ (นอกสาขาวิชาเอก)\nก. วิชาโทสาขาการเมืองการปกครอง ก. วิชาโทสาขาการเมืองการปกครอง\nจำนวน 24 หน่วยกิต โดยจดทะเบียนเรียนวิชาตาม จำนวน 15 หน่วยกิต โดยจดทะเบียนเรียนวิชาตาม\nลักษณะวิชาบังคับเฉพาะสาขาการเมืองการปกครอง ลักษณะวิชาบังคับสาขาการเมืองการปกครอง\nจำนวน 21 หน่วยกิตและวิชาเลือกในสาขาการเมือง จำนวน 5 วิชา 15 หน่วยกิต\nการปกครองจำนวน 3 หน่วยกิต ข. วิชาโทสาขาบริหารรัฐกิจ จำนวน 15\nหมายเหตุ 1. นักศึกษาสาขาบรหิารรัฐกจิหน่วยกิต โดยจดทะเบียนเรียนวิชาตามลักษณะ\nที่เลือกศึกษาวิชาโทสาขาการเมืองการปกครอง วิชาบังคับสาขาบริหารรัฐกิจ จำนวน 5 วิชา 15\nจะต้องลงทะเบียนวิชาบังคับเฉพาะสาขาการเมือง หน่วยกิต\nการปกครองจำนวน 21 หน่วยกิต ค. วิชาโทสาขาการระหว่างประเทศ\nและเนื่องจากวิชา ร.420 วิชาบังคับของสาขา จำนวน 15 หน่วยกติ โดยจดทะเบียนเรียนวิชาตาม\nบรหิารรัฐกจิ แล้ว ดังนั้น ให้นักศึกษา ลักษณะวิชาบังคับเฉพาะสาขาการระหว่างประเทศ\nจำนวน 5 วิชา 15 หน่วยกิต\n122 หลักสูตร ฉบับ พ.ศ. 2561 หลักสูตร ฉบับ พ.ศ. 2566 สรุปการ\nเปลี่ยนแปลง\nเลือกศึกษาวิชาเลือกในสาขาการเมืองการปกครอง\nอีก 2 วิชา (6 หน่วยกิต) เพื่อให้ครบโครงสร้าง\nหลักสูตร 24 หน่วยกิต\n2. นักศึกษาสาขาการระหว่างประเทศ\nที่เลือกศึกษาวิชาโทสาขาการเมืองการปกครอง\nจะต้องลงทะเบียนวิชาบังคับเฉพาะสาขาการเมือง\nการปกครองจำนวน 21 หน่วยกิต และเนื่องจากวิชา\nร.320 วิชาบังคับเฉพาะสาขาการเมืองการ\nปกครองแล้ว ดังนั้น ให้นักศึกษาเลือกศึกษาวิชา\nเลือกในสาขาการเมืองการปกครองอีก 2 วิชา\n(6 หน่วยกิต) เพื่อให้ครบโครงสร้างหลักสูตร 24\nหน่วยกิต\nข. วิชาโทสาขาบริหารรัฐกิจ จำนวน 24\nหน่วยกิต โดยจดทะเบียนเรียนวิชาตามลักษณะวิชา\nบังคับเฉพาะสาขาบรหิารรัฐกจิจำนวน 21 หน่วยกิต\nและวิชาเลือกในสาขาบริหารรัฐกิจ จำนวน 3 หน่วย\nกิต\nหมายเหตุ นักศึกษาสาขาการเมืองการปกครอง\nที่เลือกศึกษาวิชาโทสาขาบรหิาร\nรัฐกิจ จะต้องลงทะเบียนวิชาบังคับเฉพาะสาขา\nบรหิารรัฐกจิจำนวน 21 หน่วยกิต และเนื่องจากวิชา\nร.420 วิชาบังคับเฉพาะสาขาการเมืองการ\nปกครองแล้ว ดังนั้นให้นักศึกษาเลือกศึกษาวิชาเลือก\nในสาขาบรหิารรัฐกิจอีก 2 วิชา (6 หน่วยกิต) เพื่อให้\nครบโครงสร้างหลักสูตร 24 หน่วยกิต\nค. วิชาโทสาขาการระหว่างประเทศ จำนวน\n24 หน่วยกิต โดยจดทะเบียนเรยีนวิชาตามลักษณะ\nวิชาบังคับเฉพาะสาขาการระหว่างประเทศ จำนวน\n21 หน่วยกิตและวิชาเลือกในสาขาการระหว่าง\nประเทศ จำนวน 3 หน่วยกิต\nหมายเหตุ นักศึกษาสาขาการเมืองการปกครอง\nที่เลือกศึกษาวิชาโทสาขาการระหว่างประเทศ\nจะต้องลงทะเบียนวิชาบังคับเฉพาะสาขาการระหว่าง\nประเทศจำนวน 21 หน่วยกิต และเนื่องจากวิชา ร.\n123 หลักสูตร ฉบับ พ.ศ. 2561 หลักสูตร ฉบับ พ.ศ. 2566 สรุปการ\nเปลี่ยนแปลง\n320 วิชาบังคับเฉพาะสาขาการเมืองการ\nปกครองแล้ว ดังนั้น ให้นักศึกษาเลือกศึกษาวิชา\nเลือกในสาขาการระหว่างประเทศอีก 2 วิชา\n(6 หน่วยกิต) เพื่อให้ครบโครงสร้างหลักสูตร 24\nหน่วยกิต\n2.4.2 วิชาโทนอกคณะ 3.2 วิชาโทนอกคณะ\nนักศึกษาอาจเลือกศึกษาสาขาวิชาใดวิชาหนึ่งที่นักศึกษาอาจเลือกศึกษาสาขาวิชาใดวิชาหนงึ่ที่\nเปิดสอนในมหาวิทยาลยัธรรมศาสตรเ์ ป็นวิชาโท โดย เปิดสอนในมหาวิทยาลัยธรรมศาสตร์วิชาโท\nศึกษาตามข้อกำหนดและเงื่อนไขของหลักสูตรวชิาโท โดยศึกษาตามข้อกำหนดและเงื่อนไขของหลักสูตร\nในสาขาวิชา/คณะนั้น ๆ ไม่น้อยกว่า 24 หน่วยกิต วิชาโทในสาขา วิชา/คณะนั้น ๆ ไม่น้อยกว่า 15\nและหากมีจำนวนหน่วยกิตของวิชาโทเหลืออยู่หน่วยกิต และ\nนักศึกษาจะต้องเลือกศึกษาวิชาต่าง ๆ ตั้งแต่ระดับ นักศึกษาจะนำวิชาเหล่านมี้านบั วิชาโทนอก\n200 ขึน้ ไปที่เปิดสอนในมหาวิทยาลัยธรรมศาสตรใ์ ห้คณะไม่ได้ตามเงื่อนไขที่ระบุดังต่อไปนี้\nครบจำนวนหน่วยกิตที่กำหนดไว้ข้างต้น ทั้งนี้ 1. วิชาในหลักสูตรวิชาศึกษาทั่วไป ที่ใช้รหัสย่อ\nนักศึกษาสามารถเลือกศึกษาวิชาศึกษาทั่วไป หมวด “มธ” ทุกวิชา รวมทั้งวิชาที่ใช้รหัสย่อ “วฬ”\nภาษาต่างประเทศ ที่ใชร้หัสย่อ “อซ” ระดับ 100 ได้ทุกวชิา\nนักศึกษาจะนำวิชาเหล่านี้มานับวิชาโทนอก 2. วิชาพื้นฐานทางวิทยาศาสตร์และคณิตศาสตร์\nคณะไม่ได้ตามเงื่อนไขที่ระบุดังต่อไปนี้ 1. วิชาใน ทุกวชิา\nหลักสูตรวิชาศึกษาทั่วไป ทั้งส่วนที่ 1 และส่วนที่ 2\nที่ใชร้หัสย่อ “มธ” ทุกวชิา วิชาหมวดพลานามัย และ\nหมวดพัฒนานักศึกษาและการเสริมสร้างทักษะและ\nประสบการณ์ รวมทั้งวิชาที่ใชร้หัสย่อ “วฬ” ทุกวชิา\n2. วิชาพืน้ฐานทางวิทยาศาสตรแ์ ละคณิตศาสตรทุ์ก\nวิชา\n3. วิชา ท.162 การเขยีนรายงานทางวิชาการ\nและ ท.163 การเขยีนเพ่อืการสื่อสารในองคก์ ร\n2.4.3 วิชาเลือก 3.3 วิชาเลือก\nให้เลือกศึกษาจากวิชาของสาขาวิชา/คณะใดก็ได้ ให้เลือกศึกษาจากวิชาของสาขาวิชา/คณะใดก็\nตั้งแต่ระดับ 200 ขึ้นไป รวมไม่เกิน 4 สาขา/คณะ ไม่ ได้ตั้งแต่ระดับ 200 ขึ้นไป รวมไม่เกิน 4 สาขา/\nน้อยกว่า 24 หน่วยกิต ทั้งนี้นักศึกษาสามารถ คณะ ไม่น้อยกว่า 15 หน่วยกิต ซึ่งนักศึกษา\nเลือกศึกษาวิชาศึกษาทั่วไป หมวดภาษาต่างประเทศ สามารถเลือกศึกษาวิชาศึกษาทั่วไป หมวดภาษา\nที่ใช้รหัสย่อ “อซ” ระดับ 100 ได้ทั้งนี้นักศึกษาจะ ต่างประเทศ ที่ใช้รหัสย่อ “อซ” ระดับ 100 ได้\nนำวิชาเหล่านีม้านับวิชาเลือกไม่ได้ตามเงื่อนไขที่ยกเว้น “อซ.125 และ อซ.126” ทั้งนี้นักศึกษาจะ\nระบุดังต่อไปนี้นำวิชาเหล่านีม้านับวิชาเลือกไม่ได้ตามเงื่อนไข\n124 หลักสูตร ฉบับ พ.ศ. 2561 หลักสูตร ฉบับ พ.ศ. 2566 สรุปการ\nเปลี่ยนแปลง\n1. วิชาในหลักสูตรวิชาศึกษาทั่วไป ทั้งส่วนที่ 1 และ ที่ระบุดังต่อไปนี้\nส่วนที่ 2 ที่ใช้รหัสย่อ “มธ” ทุกวิชา วิชาหมวด 1. วิชาในหลักสูตรวิชาศึกษาทั่วไป ที่ใช้รหัสย่อ\nพลานามัย และหมวดหมวดพัฒนานักศึกษาและการ “มธ” ระดับ 100 ทุกวิชา รวมทั้งวิชาที่ใช้รหัสย่อ\nเสริมสร้างทักษะและประสบการณ์ รวมทั้งวิชาที่ใช้ “วฬ” ทุกวชิา\nรหัสย่อ “วฬ” ทุกวชิา 2. วิชาพื้นฐานทางวิทยาศาสตร์และคณิตศาสตร์\n2. วิชาพื้นฐานทางวิทยาศาสตร์และคณิตศาสตร์ทุก ทุกวชิา\nวิชา\n3. วิชา ท.162 การเขยีนรายงาน ทางวิชาการ และท.\n163 การเขยีนเพื่อการสื่อสารในองคก์ ร\n3. วิชาเลือกเสรี 6 หน่วยกิต 4. วิชาเลือกเสรี 6 หน่วยกิต\nนักศึกษาสามารถเลือกศึกษาวิชาใดก็ได้ตั้งแต่นักศึกษาสามารถเลือกศึกษาวิชาใดก็ได้ตั้งแต่\nระดับ 200 ขึ้นไป ที่เปิดสอนในมธ.ทั้งนี้นักศึกษา ระดับ 200 ขึ้นไป ที่เปิดสอนในมธ.ทั้งนี้นักศึกษา\nสามารถเลือกศึกษาวิชาศึกษาทั่วไป หมวดภาษา สามารถเลือกศึกษาวิชาศึกษาทั่วไป หมวดภาษา\nต่างประเทศ ที่ใชร้หัสย่อ “อซ” ระดับ 100 ได้ต่างประเทศที่ใช้รหัสย่อ “อซ” ระดับ 100 ได้\nนักศึกษาจะนำวิชาเหล่านมี้านบั วิชาเลือกเสรียกเว้น “อซ.125 และ อซ.126”\nไม่ได้คอืวิชำในหลักสูตรวิชาศึกษาทั่วไปทั้งส่วนที่ 1 นักศึกษาจะนำวิชาเหล่านี้มานับวิชาเลือก\nและส่วนที่ 2 ที่ใช้รหัสย่อ “มธ” ระดับ 100 คือ มธ. เสรีไม่ได้คือ วิชาในหลักสูตรวิชาศึกษาทั่วไป ที่ใช้\n100 – มธ.156 รหัสย่อ \"มธ\" ระดับ 100 ทุกวชิา\n6) รายวิชาในหลักสูตรที่เปดิสอนให้วิทยาลัย/\nคณะ/ภาควชิา/หลักสูตรอื่นต้องมาเรียน โดย\nเปรยีบเทยีบในลักษณะเปน็วิชำต่อวชิา\nการศึกษาสาขาวิชารัฐศาสตร์วิชาโท\nนศ.นอกคณะรัฐศาสตร์ที่ประสงค์จะศึกษา นศ.นอกคณะรัฐศาสตร์ที่ประสงค์จะศึกษาสาขา\nสาขาวิชารัฐศาสตร์วิชาโท จะต้องศึกษารายวิชา วิชารัฐศาสตร์วิชาโท จะต้องศึกษรายวิชา\nเฉพาะของสาขาวิชารัฐศาสตร์ไม่น้อยกว่า 24 หน่วย เฉพาะคณะรัฐศาสตร์ จำนวน 15 หน่วยกิต จาก\nกิต โดยได้ศึกษารายวิชาต่าง ๆ ตามเงื่อนไข รายวิชาดังต่อไปนี้\nดังต่อไปนี้\n1. วิชาบงัคับ 1. วิชาบงัคับ\nร.210 ปรัชญาการเมอืงเบื้องต้น 3 (3-0-6) ร .2 1 0 ป รัชญาการเมอืงเบื้องต้น 3 (3-0-6) ค งเดิม\nร.211 ความรเู้บื้องต้นทางรัฐศาสตร์ 3 (3-0-6) ร . 2 1 1 ความรเู้บื้องต้นทางรัฐศาสตร์ 3 (3-0-6) ค งเดิม\nร.241 ความรเู้บื้องตน้ทางบรหิารรัฐกจิ 3 (3-0-6) ร . 2 4 1 ความรเู้บื้องตน้ทางบรหิารรัฐกจิ 3 (3-0-6) คงเดิม\nร.271 ความรเู้บื้องตน้ทางความ 3 (3-0-6) ร . 2 7 1 ความรเู้บื้องตน้ทางความ 3 (3-0-6) ค งเดิม\nสมัพันธ์ระหว่างประเทศ สมัพันธ์ระหว่างประเทศ\nร.321 การเมืองการปกครองของไทย 3 (3-0-6) ร . 3 2 1 การเมืองการปกครองของไทย 3 (3-0-6) ค งเดิม\n125 หลักสูตร ฉบับ พ.ศ. 2561 หลักสูตร ฉบับ พ.ศ. 2566 สรุปการ\nเปลี่ยนแปลง\n2. วิชาอื่น ๆ ทสี่อนในคณะรฐัศาสตร์อีก 3 รายวิชา\nโดยเลือกจดทะเบียนเรยีนจากวชิาบังคับสาขาใน 3 ตัดออก\nสาขา ตามข้อ 2.2.1 ก., ข้อ 2.2.2 ก., และ ข้อ 2.2.3\nก.\nนักศึกษาหลักสูตรการผังเมืองบัณฑิต คณะ นักศึกษาหลักสูตรการผังเมืองบัณฑิต คณะ\nสถาปัตยกรรมศาสตร์และการผังเมืองที่ประสงค์จะ สถาปัตยกรรมศาสตร์และการผังเมือง ที่ประสงค์\nศึกษาสาขาวิชารัฐศาสตร์วิชาโท จะต้องศึกษา จะศึกษาสาขาวิชารัฐศาสตร์วิชาโท จะต้อง\nรายวิชาของคณะรัฐศาสตร์ จำนวน 15 หน่วยกิต ศึกษารายวิชาของคณะรัฐศาสตร์ จำนวน 15\nในรายวิชา ดังนี้หน่วยกิต ในรายวิชา ดังนี้\nร.211 ความรเู้บื้องต้นทางรัฐศาสตร์ 3 (3-0-6) ร . 2 1 1 ความรเู้บื้องต้นทางรัฐศาสตร์ 3 (3-0-6) ค งเดิม\nร.241 ความรเู้บื้องตน้ทางบรหิารรัฐกจิ 3 (3-0-6) ร . 2 4 1 ความรเู้บื้องตน้ทางบรหิารรัฐกจิ 3 (3-0-6) ค งเดิม\nร.361 นโยบายสาธารณะและการ 3 (3-0-6) ร . 3 6 1 นโยบายสาธารณะและการ 3 (3-0-6) ค งเดิม\nจัดการปกครอง จัดการปกครอง\nร.368 นโยบายและการจดัการเมือง 3 (3-0-6) ร . 3 6 8 นโยบายและการจดัการเมือง 3 (3-0-6) ค งเดิม\nร.420 กฎหมายปกครอง 3 (3-0-6) ร.418 กฎหมายปกครอง 3 (3-0-6) ป รับ รหัสวิชา\n126 ภาคผนวก 3 ตารางเทียบรายวิชาในหลักสูตรรัฐศาสตรบัณฑิต ฉบับ พ.ศ. 2561 กับ ฉบับ พ.ศ.\n2566\nสาขาการเมืองการปกครอง\nรายวิชาในหลักสูตร พ.ศ. 2561 รายวิชาในหลักสูตร พ.ศ. 2566\nรายวิชาที่เทียบได้รายวิชาที่เทียบได้\nร.210 ปรัชญาการเมอืงเบือ้งตน้ 3 (3-0-6) ร.210 ปรัชญาการเมอืงเบือ้งตน้ 3 (3-0-6)\nร.211 ความรู้เบื้องต้นทางรัฐศาสตร์ 3 (3-0-6) ร.211 ความรู้เบื้องต้นทางรัฐศาสตร์ 3 (3-0-6)\nร.212 ประวัตคิวามคิดทางการเมอืง 3 (3 -0-6) ร.212 ประวัตคิวามคิดทางการเมอืง 3 (3-0-6)\nเบือ้งตน้ เบือ้งต้น\nร.221 พรรคการเมอืง กลุ่มผลประโยชน์ 3 (3-0-6) ร.221 พรรคการเมอืง กลุ่มผลประโยชน์ 3 (3-0-6)\nและการเลือกตั้ง และการเลือกตั้ง\nร.222 พลวัตการเมืองท้องถิ่น 3 (3-0-6) ร.222 พลวัตการเมืองท้องถิ่น 3 (3-0-6)\nร.224 พืน้ฐานทางเศรษฐกิจและ สังคม 3 (3-0-6) ร.224 พืน้ฐานทางเศรษฐกิจและสังคม 3 (3-0-6)\nของการเมอืงการปกครองไทย ของการเมอืงการปกครองไทย\nร.300 วธิีวิทยาทางสังคมศาสตร์ 3 (3-0-6) ร.300 วธิีวิทยาทางสังคมศาสตร์ 3 (3-0-6)\nร.304 พฤติกรรมการเมือง ความคิด 3 (3-0-6) ร.304 พฤติกรรมการเมือง ความคิด 3 (3-0-6)\nเห็นสาธารณะ และจิตวิทยา เห็นสาธารณะและจติวิทยา\nร.307 ทฤษฎีการเมืองแนวสตรีนยิม 3 (3-0-6) ร.307 ทฤษฎีการเมอืงแนวสตรีนยิม 3 (3-0-6)\nร.309 ทุน ธุรกิจ กับการเมือง 3 (3-0-6) ร.309 ทุน ธุรกิจกับการเมือง 3 (3-0-6)\nร.311 ขบวนการเคลื่อนไหวทางสังคม 3 (3-0-6) ร.311 ขบวนการเคลื่อนไหวทาง 3 (3-0-6)\nกับพืน้ที่ทางการเมือง สังคมกับพืน้ที่ทางการเมือง\nร.312 การเมืองกับกฎหมายมหาชน 3 (3-0-6) ร.312 การเมืองกับกฎหมายมหาชน 3 (3-0-6)\nร.314 ประวัติความคิดทางการเมอืงไทย 3 (3-0-6) ร.314 ประวัติความคิดทางการเมอืงไทย 3 (3-0-6)\nร.315 ปรัชญาสงครามและสันติภาพ 3 (3-0-6) ร.315 ปรัชญาสงครามและสันติภาพ 3 (3-0-6)\nร.319 ทฤษฎีการเมืองว่าด้วยเสรีนยิม 3 (3-0-6) ร.319 ทฤษฎีการเมืองว่าด้วยเสรีนยิม 3 (3-0-6)\nและประชาธิปไตย และประชาธิปไตย\nร.320 การเมอืงการปกครอง 3 (3-0-6) ร.320 การเมอืงการปกครอง 3 (3-0-6)\nเปรียบเทียบ เปรียบเทียบ\nร.321 การเมืองการปกครองของไทย 3 (3-0-6) ร.321 การเมืองการปกครองของไทย 3 (3-0-6)\nร.322 สถาบันการเมืองและรัฐธรรมนูญ 3 (3 -0-6) ร.322 สถาบันการเมืองและรัฐธรรมนูญ 3 (3-0-6)\nร.323 การเมืองว่าด้วยการพัฒนา 3 (3-0-6) ร.323 การเมืองว่าด้วยการพัฒนา 3 (3-0-6)\nร.326 การเมืองการปกครองตะวัน 3 (3-0-6) ร.326 การเมืองการปกครองตะวัน 3 (3-0-6)\nออกกลาง ออกกลาง\n127 รายวิชาในหลักสูตร พ.ศ. 2561 รายวิชาในหลักสูตร พ.ศ. 2566\nรายวิชาที่เทียบได้รายวิชาที่เทียบได้\nร.327 การเมืองการปกครองเอเชยี ใต้ 3 (3-0-6) ร.327 การเมืองการปกครองเอเชยี ใต้ 3 (3-0-6)\nร.330 การเมืองการปกครองเอเชยี 3 (3-0-6) ร.330 การเมืองการปกครองเอเชยี 3 (3-0-6)\nตะวันออกเฉียงใต้ตะวันออกเฉียงใต้\nร.333 การเมอืงการปกครองเอเชยี 3 (3-0-6) ร.333 การเมอืงการปกครองเอเชยี 3 (3-0-6)\nตะวันออก ตะวันออก\nร.336 การเมืองการปกครอง 3 (3-0-6) ร.336 การเมืองการปกครอง 3 (3-0-6)\nพหุอเมรกิา พหุอเมรกิา\nร.337 การเมืองการปกครองยุโรป 3 (3-0-6) ร.337 การเมืองการปกครองยุโรป 3 (3-0-6)\nร.403 สัมมนา : ภาษากับการเมือง 3 (3-0-6) ร.403 สัมมนา : ภาษากับการเมือง 3 (3-0-6)\nร.404 สัมมนา : ศาสนากับการเมอืง 3 (3-0-6) ร.404 สัมมนา : ศาสนากับการเมอืง 3 (3-0-6)\nร.405 สัมมนา : การเมืองและนวนยิาย 3 (3-0-6) ร.405 สัมมนา : การเมืองและนวนยิาย 3 (3-0-6)\nร.406 การเมืองของเพศสภาพและ 3 (3-0-6) ร.406 การเมืองของเพศสภาพและ 3 (3-0-6)\nเพศวิถี เพศวิถี\nร.408 รัฐและสังคม 3 (3-0-6) ร.408 รัฐและสังคม 3 (3-0-6)\nร.409 ประชาธิปไตยและการพัฒนา 3 (3-0-6) ร.409 ประชาธิปไตยและการพัฒนา 3 (3-0-6)\nประชาธิปไตย ประชาธิปไตย\nร.412 ทฤษฎีว่าด้วยสังคมและการเมือง 3 (3-0-6) ร.412 ทฤษฎีว่าด้วยสังคมและการเมือง 3 (3-0-6)\nร.414 สัมมนาแนวความคิดทางการ 3 (3-0-6) ร.414 สัมมนาแนวความคิดทางการ 3 (3-0-6)\nเมืองไทย เมืองไทย\nร.415 สัมมนา : ความรุนแรงและ 3 (3-0-6) ร.415 สัมมนา : ความรุนแรงและ 3 (3-0-6)\nสันติวธิีสันติวธิี\nร.416 สัมมนา : ประเด็นปัญหา 3 (3-0-6) ร.416 สัมมนา : ประเด็นปัญหา 3 (3-0-6)\nปรัชญาการเมือง ปรัชญาการเมือง\nร.420 กฎหมายปกครอง 3 (3-0-6) ร.418 กฎหมายปกครอง 3 (3-0-6)\nร.424 สัมมนาปัญหาการเมือง 3 (3-0-6) ร.424 สัมมนาปัญหาการเมือง 3 (3-0-6)\nการปกครองของไทย การปกครองของไทย\nร.425 สัมมนาปัญหาในทางรัฐศาสตร์ 3 (3-0-6) ร.425 สัมมนาปัญหาในทางรัฐศาสตร์ 3 (3-0-6)\nร.426 สัมมนาทฤษฎีเกี่ยวกับการ 3 (3-0-6) ร.426 สัมมนาทฤษฎีเกี่ยวกับการ 3 (3-0-6)\nเมืองการปกครองเปรียบเทียบ เมืองการปกครองเปรียบเทียบ\nร.427 การเมืองเชิงชาติพันธุ์และ 3 (3-0-6) ร.427 การเมืองเชิงชาติพันธุ์และ 3 (3-0-6)\nวัฒนธรรม วัฒนธรรม\n128 รายวิชาในหลักสูตร พ.ศ. 2561 รายวิชาในหลักสูตร พ.ศ. 2566\nรายวิชาที่เทียบได้รายวิชาที่เทียบได้\nร.428 สัมมนาทหารและการเมือง 3 (3-0-6) ร.428 สัมมนาทหารและการเมือง 3 (3-0-6)\nร.434 สัมมนาปัญหาทฤษฎีการเมอืง 3 (3-0-6) ร.434 สัมมนาปัญหาทฤษฎีการเมอืง 3 (3-0-6)\nกับปัญหาร่วมสมัย กับปัญหาร่วมสมัย\nร.438 หลักและระเบียบทางราชการไทย 3 (3 -0-6) ร.438 หลักและระเบียบทางราชการไทย 3 (3-0-6)\nร.439 เทคโนโลยีกับการเมอืง 3 (3-0-6) ร.439 เทคโนโลยีกับการเมอืง 3 (3-0-6)\nร.519 การวิจัยของแต่ละบุคคลภายใต้ 3 (2-2-5) ร.519 การวิจัยของแต่ละบุคคลภายใต้ 3 (2-2-5)\nการแนะนำเกี่ยวกับกระบวนทัศน์ การแนะนำเกี่ยวกับกระบวนทัศน์\nทางรัฐศาสตร์ ทางรัฐศาสตร์\nร.539 การวิจัยของแตล่ะบุคคลภายใต้ 3 (2-2-5) ร.539 การวิจัยของแตล่ะบุคคลภายใต้ 3 (2-2-5)\nการแนะนำเกี่ยวกับประเด็นทาง การแนะนำเกี่ยวกับประเด็นทาง\nรัฐศาสตร์ รัฐศาสตร์\nรายวิชาที่เทียบไม่ได้\nร.400 การฝึกงานทางรัฐศาสตร์ 1 (0-30-0)\n3 (3-0-6)\nร.407 ความมั่นคงศึกษาเชิงวิพากษ์\n3 (3-0-6)\nร.419 ความคิดทางการเมืองแบบ\nยูโทเปีย\n3 (3-0-6)\nร.423 สัมมนาการเปลี่ยนแปลงทาง\nสังคมและการเมืองในเอเชีย\nตะวันออกเฉียงใต้\n3 (3-0-6)\nร.429 สัมมนาเรื่องผู้นำทางการเมอืง\n3 (3-0-6)\nร.437 สัมมนาความรเู้กี่ยวกับระเบียบ\nวิธีวิเคราะหท์างปรัชญาและ\nการเมอืง\n3 (3-0-6)\nร.537 การศกึษาวิจัยภาคสนามทาง\nรัฐศาสตร์\nรายวิชาที่เทียบไม่ได้\nร.523 การฝกึงานทางการเมืองการ 3 (0-6-3)\nปกครอง\n129 สาขาบรหิารรัฐกิจ\nรายวิชาในหลักสูตร พ.ศ. 2561 รายวิชาในหลักสูตร พ.ศ. 2566\nรายวิชาที่เทียบได้รายวิชาที่เทียบได้\nร.241 ความรู้เบื้องต้นทางบริหารรัฐกิจ 3 (3-0-6) ร.241 ความรู้เบื้องต้นทางบริหารรัฐกิจ 3 (3 - 0-6)\nร.242 ทฤษฎีองค์การและการจัดการ 3 (3-0-6) ร.242 ทฤษฎีองค์การและการจัดการ 3 (3 -0-6)\nร.250 การวางแผนและการจัดการเชิง 3 (3-0-6) ร.250 การวางแผนและการจัดการเชิง 3 (3-0-6)\nกลยุทธ์ในบริบทสาธารณะ กลยุทธ์ในบริบทสาธารณะ\nร.251 การบริหารทรัพยากรมนุษย์ 3 (3-0-6) ร.251 การบริหารทรัพยากรมนุษย์ 3 (3-0-6)\nภาครัฐ ภาครัฐ\nร.342 เครื่องมือการบริหารและการ 3 (3-0-6) ร.342 เครื่องมือการบริหารและการ 3 (3-0-6)\nจัดการ จัดการ\nร.343 พฤติกรรมและวัฒนธรรมองค์การ 3 (3-0-6) ร.343 พฤติกรรมและวัฒนธรรมองค์การ 3 (3-0-6)\nร.345 องค์การและการจัดการ 3 (3-0-6) ร.345 องค์การและการจัดการ 3 (3-0-6)\nสาธารณะไทย สาธารณะไทย\nร.346 การบริหารโครงการ 3 (3-0-6) ร.346 การบริหารโครงการ 3 (3-0-6)\nร.347 การประเมินผลโครงการ 3 (3-0-6) ร.347 การประเมินผลโครงการ 3 (3-0-6)\nร.348 ความรเู้บือ้งต้นเกี่ยวกับนโยบาย 3 (3-0-6) ร.348 ความรเู้บือ้งต้นเกี่ยวกับนโยบาย 3 (3-0-6)\nและการวางแผนสิ่งแวดล้อม และการวางแผนสิ่งแวดล้อม\nร.349 ความสัมพันธ์ระหว่างหน่วยงาน 3 (3-0-6) ร.349 ความสัมพันธ์ระหว่างหน่วยงาน 3 (3-0-6)\nของรัฐและการบริหารจัดการ ของรัฐและการบริหารจัดการ\nเครือข่าย เครือข่าย\nร.350 การบริหารรัฐกิจไทย 3 (3-0-6) ร.350 การบริหารรัฐกิจไทย 3 (3-0-6)\nร.353 การบริหารแรงงาน 3 (3-0-6) ร.353 การบริหารแรงงาน 3 (3-0-6)\nร.356 เทคโนโลยีนวัตกรรมและการ 3 (3-0-6) ร.356 เทคโนโลยีนวัตกรรมและการ 3 (3-0-6)\nบริหารจัดการระบบข้อมูล บริหารจัดการระบบข้อมูล\nสาธารณะ สาธารณะ\nร.357 การพัฒนาทรัพยากรมนุษย์ 3 (3-0-6) ร.357 การพัฒนาทรัพยากรมนุษย์ 3 (3-0-6)\nร.358 การบริหารการพัฒนาใน 3 (3-0-6) ร.358 การบริหารการพัฒนาใน 3 (3-0-6)\nบริบทโลก บริบทโลก\nร.359 การบริหารรัฐกิจเปรียบเทียบ 3 (3-0-6) ร.359 การบริหารรัฐกิจเปรียบเทียบ 3 (3-0-6)\nร.360 การบริหารการคลังและ 3 (3-0-6) ร.360 การบริหารการคลังและ 3 (3-0-6)\nงบประมาณ งบประมาณ\n130 รายวิชาในหลักสูตร พ.ศ. 2561 รายวิชาในหลักสูตร พ.ศ. 2566\nรายวิชาที่เทียบได้รายวิชาที่เทียบได้\nร.361 นโยบายสาธารณะและการ 3 (3-0-6) ร.361 นโยบายสาธารณะและการ 3 (3-0-6)\nจัดการปกครอง จัดการปกครอง\nร.363 การบริหารการคลังท้องถิ่น 3 (3-0-6) ร.363 การบริหารการคลังท้องถิ่น 3 (3-0-6)\nร.364 การจัดการความหลากหลาย 3 (3-0-6) ร.364 การจัดการความหลากหลาย 3 (3-0-6)\nวัฒนธรรมองคก์าร วัฒนธรรมองคก์าร\nร.366 การบริหารจัดการสิ่งแวดล้อม 3 (3-0-6) ร.366 การบริหารจัดการสิ่งแวดล้อม 3 (3-0-6)\nอย่างยั่งยืน อย่างยั่งยืน\nร.367 เทคนิคการวิเคราะห์และการออก 3 (3-0-6) ร.367 แนวทางวิเคราะหน์ โยบายและ 3 (3-0-6)\nแบบนโยบาย หลักปฏิบัติแบบบูรณาการ\nร.368 นโยบายและการจัดการเมอืง 3 (3-0-6) ร.368 นโยบายและการจัดการเมอืง 3 (3-0-6)\nร.369 การบริหารจัดการองค์กร 3 (3-0-6) ร.369 การบริหารจัดการองค์กร 3 (3-0-6)\nปกครองสว่นท้องถิ่น ปกครองสว่นท้องถิ่น\nร.443 สัมมนาการบริหารรัฐกิจ 3 (3-0-6) ร.443 สัมมนาการบริหารรัฐกิจ 3 (3-0-6)\nร.444 การบริหารรัฐกิจกับการพัฒนา 3 (3-0-6) ร.444 การบริหารรัฐกิจกับการพัฒนา 3 (3-0-6)\nระหว่างประเทศ ระหว่างประเทศ\nร.445 การบริหารจัดการองค์การไม่ 3 (3-0-6) ร.445 การบริหารจัดการองค์การไม่ 3 (3-0-6)\nแสวงหากำไรและธุรกิจเพื่อ แสวงหากำไรและธุรกิจเพื่อ\nสังคม สังคม\nร.446 การจัดการความเสี่ยงและความ 3 (3-0-6) ร.446 การจัดการความเสี่ยงและความ 3 (3-0-6)\nต่อเน่อืงองค์การ ต่อเน่อืงองค์การ\nร.449 การบริหารจัดการความเสี่ยง 3 (3-0-6) ร.449 การบริหารจัดการความเสี่ยง 3 (3-0-6)\nภัยพิบัติภัยพิบัติ\nร.453 สัมมนาการจัดการทรัพยากร 3 (3-0-6) ร.453 สัมมนาการจัดการทุนมนุษย์เชิง 3 (3-0-6)\nมนุษย์เชิงกลยุทธ์ กลยุทธ์\nร.455 สัมมนาประเด็นนโยบาย 3 (3-0-6) ร.455 สัมมนาประเด็นนโยบาย 3 (3-0-6)\nสาธารณะ สาธารณะ\nร.463 สัมมนาการบริหารการคลัง 3 (3-0-6) ร.463 สัมมนาการบริหารการคลัง 3 (3-0-6)\nสาธารณะ สาธารณะ\nร.467 สัมมนาการบริหารรัฐวิสาหกิจ 3 (3-0-6) ร.467 สัมมนาการบริหารรัฐวิสาหกิจ 3 (3-0-6)\nร.569 สหกิจศกึษาบริหารรัฐกิจ 3 (0-6-3) ร.569 สหกิจศกึษาบริหารรัฐกิจ 3 (0 - 6 - 3)\n131 รายวิชาในหลักสูตร พ.ศ. 2561 รายวิชาในหลักสูตร พ.ศ. 2566\nรายวิชาที่เทียบไม่ได้\nร.355 การบริหารจัดการสวัสดิการ 3 (3-0-6)\nรายวิชาที่เทียบไม่ได้\nร.468 ทฤษฎีเกมสำหรับนักรัฐศาสตร์ 3 (3-0-6)\nร.567 การฝึกงานทางบริหารรัฐกิจ 3 (0-6-3)\nสาขาการระหว่างประเทศ\nรายวิชาในหลักสูตร พ.ศ. 2561 รายวิชาในหลักสูตร พ.ศ. 2566\nรายวิชาที่เทียบได้รายวิชาที่เทียบได้\nร.271 ความรเู้บือ้งตน้ทาง 3 (3-0-6) ร.271 ความรเู้บือ้งตน้ทางความสัมพันธ์ 3 (3 - 0 - 6)\nความสัมพันธ์ระหว่างประเทศ ระ ห ว่างประเทศ\nร.272 ประวัติศาสตร์การทูต 3 (3-0-6) ร.272 ประวัติศาสตร์การทูต 3 (3-0-6)\nร.280 การเมืองระหว่างประเทศ: 3 (3-0-6) ร.280 การเมืองระหว่างประเทศ:ทฤษฎี 3 (3-0-6)\nทฤษฎีและกรณีศึกษา และกรณีศกึษา\nร.282 การอ่านและการวิเคราะหใ์ น 3 (3-0-6) ร.282 การอ่านและการวิเคราะหใ์ น 3 (3-0-6)\nความสัมพันธ์ระหว่างประเทศ ความสัมพันธ์ระหว่างประเทศ\nร.293 กฎหมาย องค์การและระบอบ 3 (3-0-6) ร.293 กฎหมาย องค์การและระบอบ 3 (3-0-6)\nระหว่างประเทศ ระหว่างประเทศ\nร.370 การต่างประเทศของไทย 3 (3-0-6) ร.370 การต่างประเทศของไทย 3 (3-0-6)\nร.371 ความสัมพันธ์ระหว่างประเทศ 3 (3-0-6) ร.283 ความสัมพันธ์ระหว่างประเทศใน 3 (3-0-6)\nในเอเชียตะวันออกเฉียงใต้ เอเชียตะวันออกเฉียงใต้\nร.373 ความสัมพันธ์ระหว่างประเทศ 3 (3-0-6) ร.373 ความสัมพันธ์ระหว่างประเทศ 3 (3-0-6)\nในเอเชยีตะวันออก ในเอเชยีตะวันออก\nร.374 การเมืองและการต่างประเทศ 3 (3-0-6) ร.374 การเมืองและการต่างประเทศ 3 (3-0-6)\nของสหราชอาณาจักร ของสหราชอาณาจักร\nร.375 ความสัมพันธ์ระหว่างประเทศ 3 (3 - 0 -6) ร.375 ความสัมพันธ์ระหว่างประเทศ 3 (3-0-6)\nในละตินอเมริกา ในละตินอเมริกา\nร.376 ความสัมพันธ์ระหว่างประเทศ 3 (3 - 0 -6) ร.376 ความสัมพันธ์ระหว่างประเทศ 3 (3-0-6)\nในตะวันออกกลาง ในตะวันออกกลาง\nร.377 สิ่งแวดล้อมกับความสัมพันธ์ 3 (3-0-6) ร.377 สิ่งแวดล้อมกับความสัมพันธ์ 3 (3-0-6)\nระหว่างประเทศ ระหว่างประเทศ\nร.379 พิธีทางการทูตและการกงสุล 3 (3-0-6) ร.379 พิธีทางการทูตและการกงสุล 3 (3-0-6)\n132 รายวิชาในหลักสูตร พ.ศ. 2561 รายวิชาในหลักสูตร พ.ศ. 2566\nร.380 พัฒนาการเศรษฐกิจและการ 3 (3-0-6) ร.380 พัฒนาการเศรษฐกิจและการ 3 (3-0-6)\nเมืองโลก เมืองโลก\nร.383 การเมอืงและการต่างประเทศ 3 (3-0-6) ร.383 การเมอืงและการต่างประเทศ 3 (3-0-6)\nของจนีของจนี\nร.384 การเมืองและการต่างประเทศ 3 (3-0-6) ร.384 การเมืองและการต่างประเทศ 3 (3-0-6)\nของญี่ปุ่น ของญี่ปุ่น\nร.385 การเมอืงและการต่างประเทศ 3 (3-0-6) ร.385 การเมอืงและการต่างประเทศ 3 (3-0-6)\nของรัสเซีย ของรัสเซีย\nร.386 การเมอืงและการต่างประเทศ 3 (3-0-6) ร.386 การเมอืงและการต่างประเทศ 3 (3-0-6)\nของสหรัฐอเมริกา ของสหรัฐอเมริกา\nร.387 ความสัมพันธ์ระหว่างประเทศ 3 (3-0-6) ร.387 ความสัมพันธ์ระหว่างประเทศ 3 (3-0-6)\nในยุโรป ในยุโรป\nร.388 มหาอำนาจกับระเบียบโลก 3 (3-0-6) ร.388 มหาอำนาจกับระเบียบโลก 3 (3-0-6)\nร.389 ความสัมพันธ์ระหว่างประเทศ 3 (3-0-6) ร.389 ความสัมพันธ์ระหว่างประเทศ 3 (3-0-6)\nในเอเชยี ใต้ ในเอเชยี ใต้\nร.393 การวิเคราะหน์ โยบาย 3 (3-0-6) ร.393 การวเิคราะหน์ โยบายต่างประเทศ 3 (3-0-6)\nต่างประเทศ\nร.394 ยุทธศาสตรศ์ กึษาและความ 3 (3-0-6) ร.394 ยุทธศาสตรศ์ กึษาและความมั่นคง 3 (3-0-6)\nมั่นคงระหว่างประเทศ ระหว่างประเทศ\nร.395 ส่อืกับการเมอืงโลก 3 (3-0-6) ร.395 ส่อืกับการเมอืงโลก 3 (3-0-6)\nร.396 การทูตและการเจรจาระหว่าง 3 (3-0-6) ร.396 การทูตและการเจรจาระหว่าง 3 (3-0-6)\nประเทศ ประเทศ\nร.397 การเมืองของความช่วยเหลอื 3 (3-0-6) ร.397 การเมืองของการพัฒนาระหว่าง 3 (3-0-6)\nและการพัฒนาระหว่าง ประเทศและความรว่มมอืระหว่าง\nประเทศ ประเทศเพื่อการพัฒนา\nร.398 ประชาสังคมโลก 3 (3-0-6) ร.398 ประชาสังคมโลก 3 (3-0-6)\nร.399 ความมั่นคงของมนุษย์ 3 (3-0-6) ร.399 ความมั่นคงของมนุษย์ 3 (3-0-6)\nร.474 สัมมนานโยบายต่างประเทศ 3 (3-0-6) ร.474 สัมมนานโยบายต่างประเทศไทย 3 (3-0-6)\nไทย\nร.476 ทฤษฎีวพิากษ์ในความสัมพันธ์ 3 (3-0-6) ร.476 ทฤษฎีวพิากษ์ในความสัมพันธ์ 3 (3-0-6)\nระหว่างประเทศ ระหว่างประเทศ\nร.478 สัมมนาภูมิภาคนิยม 3 (3-0-6) ร.478 สัมมนาภูมิภาคนิยม 3 (3-0-6)\n133"
}