{
    "C:\\Users\\User\\Desktop\\project\\DSI324\\pdf\\ศศบ-การจัดการมรดก66-ผ่านกมอ-11-66-8พย66.pdf": {
        "faculty_name_th": "วิทยาลัยนวัตกรรม",
        "faculty_name_en": "Innovation College",
        "campus": "ท่าพระจันทร์",
        "curr_id": "25570051102416",
        "curr_type": "หลักสูตรปริญญาตรีทางวิชาการ",
        "careers": [
            "พนักงานและผู้ประกอบการด้านมรดกวัฒนธรรม",
            "พนักงานและผู้ประกอบการด้านอุตสาหกรรมสร้างสรรค์",
            "บุคลากรสายวิชาการ และพนักงานสายสนับสนุนด้านการจัดการมรดกวัฒนธรรมและอุตสาหกรรมสร้างสรรค์",
            "นักวิจัยหรือผู้ช่วยนักวิจัยในโครงการขององค์การยูเนสโก และงานด้านวัฒนธรรมอื่น ๆ ที่เกี่ยวข้อง",
            "ภัณฑารักษ์หรือผู้ดูแลพิพิธภัณฑ์",
            "พนักงานองค์กรฝ่ายการตลาดและการประชาสัมพันธ์ทางวัฒนธรรม",
            "พนักงานองค์กรฝ่ายวิเคราะห์และวางแผนโครงการทางวัฒนธรรม",
            "พนักงานองค์กรฝ่ายประสานงานโครงการทางวัฒนธรรมและโครงการอื่น ๆ ที่เกี่ยวข้อง",
            "พนักงานองค์กรด้านการออกแบบสื่อวัฒนธรรมสร้างสรรค์",
            "เจ้าหน้าที่บริษัทผลิตรายการโทรทัศน์และภาพยนตร์และสื่อสมัยใหม่",
            "เจ้าหน้าที่บริษัทรับจัดงานและการแสดงทางวัฒนธรรม (Event)",
            "อาชีพอิสระ เช่น ผู้ผลิตงานสร้างสรรค์ (ภาพยนตร์ เพลง ศิลปะการแสดง ฯลฯ) ผู้ประกอบกิจการสตาร์ทอัป (Startup)"
        ],
        "curr-name-th": "หลักสูตรศิลปศาสตรบัณฑิต สาขาวิชาการจัดการมรดกวัฒนธรรมและอุตสาหกรรมสร้างสรรค์",
        "curr-name-en": "Bachelor of Arts Program in Management of Cultural Heritage and Creative Industries",
        "degree_full_th": "ศิลปศาสตรบัณฑิต (การจัดการมรดกวัฒนธรรมและอุตสาหกรรมสร้างสรรค์)",
        "degree_full_en": "Bachelor of Arts (Management of Cultural Heritage and Creative Industries)",
        "degree_abr_th": "ศศ.บ. (การจัดการมรดกวัฒนธรรมและอุตสาหกรรมสร้างสรรค์)",
        "degree_abr_en": "B.A. (Management of Cultural Heritage and Creative Industries)",
        "num-major": "1",
        "approved-date": "2566-04-25",
        "cat-name": "โครงการพิเศษ",
        "organization": [
            "หลักสูตรของสถาบันโดยเฉพาะ"
        ],
        "lang": "จัดการศึกษาภาษาไทย"
    }
}